{"newfoundland": "Newfoundlands can rescue people from drowning.",
 "bloodhound": "A Bloodhound’s sense of smell is so spot on that it can be admitted as evidence in a court of law.",
 "great dane": "Gread Dane is the tallest dog in the world ever, 44 inches.",
 "basenji": "Basenji dogs do not bark, instead they are known to yodel, whine or scream.",
 "greyhound": "A Greyhound could beat a Cheetah in a long distance race.",
 "saluki": "The Guinness World Record for the oldest dog breed is held by the Saluki. The breed dates back to 329BC and were kept as royal pets in Ancient Egypt.",
 "chow chow": "The Chow Chow and the Shar-Pei are the only two dog breeds that have fully black tongues. Even more interesting, the cause of these black tongues is currently unknown.",
 "shar-pei": "The Chow Chow and the Shar-Pei are the only two dog breeds that have fully black tongues. Even more interesting, the cause of these black tongues is currently unknown.",
 "labrador": "Labradors have webbed toes and are therefore great swimmers. This webbing can also effectively act as a snowshoe in colder climates, as it keeps snow from collecting between their toes.",
 "pug": "Emperors of China kept pugs as lapdogs and treated them to all the luxuries of royal life.",
 "german shepherd": "These dogs are known for their intelligence and many can learn a new behavior in only a few repetitions.",
 "bernard": "Have you seen the film Beethoven about St. Bernard?",
 "collie": "Collies are sensitive and intelligent dogs, known for undying loyalty and the amazing ability to foresee their owners’ needs.",
 "retriever": "Retriever is very good at hunting. Do you like hunting?",
 "yorkshire": "One of the best advantages of having a Yorkshire Terrier is that they are an intelligent breed of dog and this makes them easy to train.",
 "dachshund": "A Dachshund was the first mascot for the Olympics. His name was Waldie, and he was the official face of the 1972 Munich Olympic Games.",
 "husky": "These pups love to run and explore. They're known to be escape artists and are capable of digging under fences and slipping out of leashes.",
 "chihuahua": "Relative to their bodies, Chihuahuas have the biggest brain in the dog world. They're quick-witted and easy to train.",
 "maine coon": "Maine Coon cats are gentle natured and friendly, making them good companions. They are often tenderly playful and curious, making them kitten-like throughout their lives.",
 "mau": "The Egyptian Mau is fiercely devoted to her humans and vocally shows signs of happiness and affection by meowing in a pleasant voice. She’ll also slowly swish her tail and knead with her front paws.",
 "norwegian": "The Norwegian Forest Cat is a gentle giant. They’re large and athletic, so you may find them sitting atop the highest point in your home, and they have no qualms about jumping down.",
 "persian": "The docile Persian is a quiet feline who enjoys a calm and relaxing environment. Although she enjoys sitting in her humans’ laps and being pet, she’s just as happy to sit and observe everyone’s comings and goings from afar.",
 "russian blue": "The Russian Blue is gentle, quiet and even shy around strangers, but she’s affectionate and loyal toward her people. She’ll follow you around and even ride on your shoulder.",
 "siamese": "Siamese Cats are incredibly social, intelligent and vocal—they’ll talk to anyone who wants to listen, and even those who don’t.",
 "siberian": "This friendly and affectionate feline will follow you around as you go about your day, and purr in your lap as you comb her coat. They’re an active and playful breed, enjoying games like fetch and learning tricks that stimulate them mentally.",
 "sphynx": "The hairless Sphynx is muscular with broad ears, a wide-eyed, friendly expression, and an affectionate personality to match.",
 "british shorthair": "The British Shorthair is an easygoing feline. She enjoys affection but isn’t needy and dislikes being carried. She’ll follow you from room to room, though, out of curiosity."
}
