[
    "Here is the fun fact about chiefs from funtrivia.com: Willie Lanier comes from the old school style of pro football, where the rules of tackling offensive players were more lenient than they are now. He was nicknamed 'Contact', and he made a lot of that with the Kansas City Chiefs. Enshrined in the Kansas City Chiefs Hall of Fame in 1985 and the NFL Hall of Fame in 1986, he was one third of one of the most feared set of linebackers in NFL history.",
    "Here is the fun fact about chiefs from funtrivia.com: The uniforms have changed very little since 1963. The team colors remain predominantly red and white, and the arrowhead logo with 'KC' remained.",
    "Here is the fun fact about chiefs from funtrivia.com: Julian Battle wore number 26, and he was the Chiefs second round draft pick in 2003. Julian gave a crucial block, some say clip, during Dante Hall's electrifying 93 punt return against Denver in week 5.",
    "Here is the fun fact about chiefs from funtrivia.com: The Chiefs' only playoff appearance of the 70s came in 1971. On Christmas Day, they lost in the first round to the Miami Dolphins 27-24, in another double overtime game. This game surpassed the Texans' AFL Championship win over the Oilers as the longest game ever played. The team didn't make the playoffs again until 1986.",
    "Here is the fun fact about chiefs from funtrivia.com: Albert Lewis had 38 interceptions in his career, with 20 in the first four seasons he played. This caused offensive coordinators and quarterbacks to plan schemes away from Lewis for the latter part of his career, he was just that good. He joined the Chiefs hall in 2007.",
    "Here is the fun fact about chiefs from funtrivia.com: Jan Stenerud once held the record for longest field goal in college at 59 yards, impressive for a man who joined college on a scholarship for ski jumping. He put his skis aside when his talents for kicking a ball was discovered and the rest is history. He made the Kansas City Chiefs Hall of Fame in 1992."
]