{"Smartphone": {"page_content": {"first_par": ["A smartphone is a [[mobile device]] that combines [[mobile phone|cellular]] and [[mobile computing]] functions into one unit. They are distinguished from [[feature phone]]s by their stronger hardware capabilities and extensive [[mobile operating system]]s, which facilitate wider [[application software|software]], [[internet]] (including [[web browsing]] over [[mobile broadband]]), and [[multimedia]] functionality (including music, video, [[camera phone|camera]]s, and [[mobile gaming|gaming]]), alongside core phone functions such as [[telephone call|voice call]]s and [[text messaging]]. Smartphones typically contain a number of [[metal–oxide–semiconductor]] (MOS) [[integrated circuit]] (IC) chips, include various [[sensor]]s that can be leveraged by their software (such as a [[magnetometer]], [[proximity sensor]]s, [[barometer]], [[gyroscope]], or [[accelerometer]]), and support [[wireless]] communications protocols (such as [[Bluetooth]], [[Wi-Fi]], or [[satellite navigation]]).", "Early smartphones were marketed primarily towards the enterprise market, attempting to bridge the functionality of standalone [[personal digital assistant]] (PDA) devices with support for cellular [[telephony]], but were limited by their bulky form, [[History of the battery|short battery life]], slow analog [[cellular networks]], and the immaturity of wireless data services. These issues were eventually resolved with the [[MOSFET scaling|exponential scaling]] and [[miniaturization]] of [[MOS transistor]]s down to [[List of semiconductor scale examples|sub-micron levels]] ([[Moores law]]), the improved [[lithium-ion battery]], faster [[digital electronics|digital]] [[Mobile broadband|mobile data networks]] ([[Edholms law]]), and more mature [[Mobile operating system|software]] [[Computing platform|platforms]] that allowed mobile device [[Digital ecosystem|ecosystems]] to develop independently of [[Mobile network operator|data providers]].", "In the 2000s, [[NTT DoCoMo]]s [[i-mode]] platform, [[BlackBerry]], [[Nokia]]s [[Symbian]] platform, and [[Windows Mobile]] began to gain market traction, with models often featuring [[QWERTY]] keyboards or [[resistive touchscreen]] input, and emphasizing access to [[push email]] and wireless internet. Following the rising popularity of the [[iPhone]] in the late 2000s, the majority of smartphones have featured thin, slate-like [[Form factor (mobile phones)|form factors]], with large, [[capacitive sensing|capacitive]] screens with support for [[multi-touch]] gestures rather than physical keyboards, and offer the ability for users to download or purchase additional [[mobile app|applications]] from a centralized [[app store|store]], and use [[Mobile cloud storage|cloud storage]] and synchronization, [[virtual assistant]]s, as well as [[mobile payment]] services. Smartphones have largely replaced PDAs and [[handheld PC|handheld/palm-sized PCs]].", "Improved hardware and faster wireless communication (due to standards such as [[LTE (telecommunication)|LTE]]) have bolstered the growth of the smartphone industry. In the third quarter of 2012, one billion smartphones were in use worldwide. Global smartphone sales surpassed the sales figures for feature phones in early 2013."], "History": {"Other Developments in the 2020s": {"2020": ["In 2020, the first smartphones featuring high-speed 5G network capability were announced."]}, "Other developments in the 2010s": {"2019": ["In 2019, the majority of smartphones released have more than one camera, are waterproof with IP67 and IP68 ratings, and unlock using facial recognition or fingerprint scanners."], "2018": ["In 2018, the first smartphones featuring fingerprint readers embedded within [[OLED]] displays were announced, followed in 2019 by an implementation using an ultrasonic sensor on the [[Samsung Galaxy S10]]."], "2016": ["Major technologies that began to trend in 2016 included a focus on [[virtual reality]] and [[augmented reality]] experiences catered towards smartphones, the newly introduced [[USB-C]] connector, and improving LTE technologies."], "2015": ["Samsung and LG used to be the \"last standing\" manufacturers to offer flagship devices with user-replaceable batteries.", "But in 2015, Samsung succumbed to the [[minimalism]] trend set by Apple, introducing the [[Galaxy S6]] without a user-replaceable battery.", "In addition, Samsung was criticised for pruning long-standing features such as [[Mobile High-Definition Link|MHL]], Micro[[USB 3.0]], [[Waterproofing|water resistance]] and [[MicroSD]] card support, of which the latter two came back in 2016 with the [[Galaxy S7]] and S7 Edge.", "As of 2015, the global [[median]] for smartphone ownership was 43%. [[Statista]] forecast that 2.87 billion people would own smartphones in 2020."], "2014": ["Microsoft, expanding upon the concept of Motorolas short-lived \"Webtop\", unveiled functionality for its [[Windows 10 Mobile|Windows 10 operating system for phones]] that allows supported devices to be [[Docking station|docked]] for use with a PC-styled [[desktop environment]]."], "2013": ["In 2013, [[Fairphone]] launched its first \"socially ethical\" smartphone at the [[London Design Festival]] to address concerns regarding the sourcing of materials in the manufacturing followed by [[Shiftphone]] in 2015. In late 2013, QSAlpha commenced production of a smartphone designed entirely around security, encryption and identity protection.", "In October 2013, [[Motorola Mobility]] announced [[Project Ara]], a concept for a [[modular smartphone]] platform that would allow users to customize and upgrade their phones with add-on modules that attached magnetically to a frame. Ara was retained by Google following its sale of Motorola Mobility to [[Lenovo]], but was shelved in 2016. That year, LG and Motorola both unveiled smartphones featuring a limited form of modularity for accessories; the [[LG G5]] allowed accessories to be installed via the removal of its battery compartment, while the [[Moto Z]] utilizes accessories attached magnetically to the rear of the device."], "2012": ["In 2012, Samsung introduced the [[Galaxy S3]] (GT-i9300) with retrofittable [[wireless charging]], pop-up video playback, [[4G]]-[[LTE (telecommunication)|LTE]] variant (GT-i9305) [[quad-core]] processor."], "2011": ["The first smartphone with a [[fingerprint reader]] was the [[Motorola Atrix 4G]] in 2011. In September 2013, the [[iPhone 5S]] was unveiled as the first smartphone on a major U.S. carrier since the Atrix to feature this technology. Once again, the iPhone popularized this concept. One of the barriers of fingerprint reading amongst consumers was security concerns, however [[Apple Inc.|Apple]] was able to address these concerns by encrypting this fingerprint data onto the A7 Processor located inside the phone as well as make sure this information could not be accessed by third-party applications and is not stored in iCloud or Apple servers "]}, "Foldable smartphones": ["Smartphones utilizing [[Rollable display|flexible displays]] were theorized as possible once manufacturing costs and production processes were feasible. In November 2018, the startup company Royole unveiled the first commercially available [[foldable smartphone]], the Royole FlexPai. Also that month, Samsung presented a prototype phone featuring an \"Infinity Flex Display\" at its developers conference, with a smaller, outer display on its \"cover\", and a larger, tablet-sized display when opened. Samsung stated that it also had to develop a new polymer material to coat the display as opposed to glass. Samsung officially announced the [[Samsung Galaxy Fold|Galaxy Fold]], based on the previously-demonstrated prototype, in February 2019 for an originally-scheduled release in late-April. Due to various durability issues with the display and hinge systems encountered by early reviewers, the release of the Galaxy Fold was delayed to September to allow for design changes Motorola also introduced a variation of the concept with its re-imagining of the [[Motorola Razr (2020)|Razr]], using a horizontally-folding display to create a [[Clamshell design|clamshell]] form factor of the companys previous [[Motorola Razr|feature phone range of the same name]]."], "Display advancements": ["In the early 2010s, larger smartphones with screen sizes of at least diagonal, dubbed \"[[phablet]]s\", began to achieve popularity, with the 2011 [[Samsung Galaxy Note series]] gaining notably wide adoption. In 2013, Huawei launched the [[Huawei Mate series]], sporting a HD (1280x720) IPS+ LCD display, which was considered to be quite large at the time.", "Some companies began to release smartphones in 2013 incorporating [[flexible display]]s to create curved form factors, such as the [[Samsung Galaxy Round]] and [[LG G Flex]].", "By 2014, [[1440p]] displays began to appear on high-end smartphones. In 2015, Sony released the [[Xperia Z5 Premium]], featuring a [[4K resolution]] display, although only images and videos could actually be rendered at that resolution (all other software was shown at 1080p).", "New trends for smartphone displays began to emerge in 2017, with both LG and Samsung releasing flagship smartphones ([[LG G6]] and [[Galaxy S8]]), utilizing displays with taller [[Display aspect ratio|aspect ratio]]s than the common [[16:9]] ratio, and a high screen-to-body ratio, also known as a \"bezel-less design\". These designs allow the display to have a larger diagonal measurement, but with a slimmer width than 16:9 displays with an equivalent screen size.", "Another trend popularized in 2017 were displays containing tab-like cut-outs at the top-centre—colloquially known as a \"notch\"—to contain the front-facing camera, and sometimes other sensors typically located along the top bezel of a device. These designs allow for \"edge-to-edge\" displays that take up nearly the entire height of the device, with little to no bezel along the top, and sometimes a minimal bottom bezel as well. This design characteristic appeared almost simultaneously on the Sharp Aquos S2 and the [[Essential Phone]], which featured circular tabs for their cameras, followed just a month later by the [[iPhone X]], which used a wider tab to contain a camera and facial scanning system known as [[Face ID]]. The 2016 [[LG V10]] had a precursor to the concept, with a portion of the screen wrapped around the camera area in the top-left corner, with the resulting area marketed as a \"second\" display that could be used for various supplemental features.", "Other variations of the practice later emerged, such as a \"hole-punch\" camera (such as those of the [[Honor (brand)|Honor]] View 20, and Samsungs [[Samsung Galaxy A8s|Galaxy A8s]] and [[Galaxy S10]])—eschewing the tabbed \"notch\" for a circular or rounded-rectangular cut-out within the screen instead, while [[Oppo]] released the first \"all-screen\" phones with no notches at all, including one with a mechanical front camera that pops up from the top of the device ([[Oppo Find X|Find X]]), and a 2019 prototype for a front-facing camera that can be embedded and hidden below the display, using a special partially-translucent screen structure that allows light to reach the [[image sensor]] below the panel. The first implementation was the [[ZTE]] Axon 20 5G, with a 32 MP sensor manufactured by Visionox.", "[[Refresh rate]]s greater than 60 Hz first appeared in 2017 on the [[Razer Phone]] and [[Sharp Corporation|Sharp]] Aquos R Compact, and were popularized by several brands in 2019. Devices with a high refresh rate have lower motion blur and input lag."], "Camera advancements": {"Front cameras": [";Photo", "Emphasis is being put on the front camera since the mid-2010s, where front cameras have reached resolutions as high as typical rear cameras, such as the 2015 [[LG G4]] (8 megapixels), [[Sony Xperia C5 Ultra]] (13 megapixels), and 2016 [[Sony Xperia XA Ultra]] (16 megapixels, optically stabilized). The 2015 [[LG V10]] brought a dual front camera system where the second has a wider angle for group photography. Samsung implemented a front-camera sweep panorama (panorama selfie) feature since the [[Galaxy Note 4]] to extend the field of view.", ";Video", "In 2012, the [[Galaxy S3]] and [[iPhone 5]] brought [[720p]] HD front video recording (at 30 fps). In early 2013, the [[Samsung Galaxy S4]], [[HTC One M7]] and [[Sony Xperia Z]] brought 1080p Full HD at that framerate, and in late 2014, the [[Galaxy Note 4]] introduced 1440p video recording on the front camera. Apple adapted [[1080p]] front camera video with the late 2016 [[iPhone 7]]. ", "In 2019, smartphones started adapting [[2160p]] 4K video recording on the front camera, six years after rear camera 2160p commenced with the [[Galaxy Note 3]]."], "Audio recording": ["Mobile phones with multiple [[microphone]]s usually allow video recording with [[stereo audio]] for spaciality, with Samsung and Sony initially implementing it in 2012 on their [[Samsung Galaxy S3]] and [[Sony Xperia S]]. In 2013, the [[HTC One M7]] followed suit. Apple implemented stereo audio starting with the 2018 [[iPhone Xs]] family and [[iPhone XR]]."], "HDR video": ["The first smartphones to record [[HDR video]] were the early 2013 [[Sony Xperia Z]] and mid-2013 [[Xperia Z Ultra]], followed by the early 2014 [[Galaxy S5]], all at 1080p."], "Slow motion video": ["A distinction between different camera softwares is how high frame rate video footage is stored, with more recent phones retaining both the image sensors original output frame rate and audio, while earlier phones do not record audio and stretch the video so it be played back slowly at default speed. While the latter encoding method increases compatibility on older devices if the aim were to achieve a slow motion effect, the former method offers greater versatility for video editing, where slowed down portions of the footage can be freely selected by the user, and exported into a separate video. A rudimentary video editing software for this purpose is usually precluded. The video can optionally be played back at normal speed, acting as usual video.", ";Slow motion on early smartphones", "The earliest smartphone known to feature a slow motion mode is the 2009 [[Samsung i8000 Omnia II]], which can record at QVGA (320×240) at 120 fps ([[frames per second]]). Slow motion was not available on the 2010 [[Galaxy S1]], 2011 [[Galaxy S2]], 2011 [[Galaxy Note 1]], and 2012 [[Galaxy S3]] flagships. ", "In late 2012, the [[Galaxy Note 2]] brought back slow motion, with D1 (720×480) at 120 fps. In early 2013, the [[Galaxy S4]] and [[HTC One M7]] recorded at that frame rate with 800×450, followed by the [[Note 3]] and [[iPhone 5s]] with 720p (1280×720) in late 2013, the latter of which retaines audio and original sensor frame rate, as with all later iPhones. In early 2014, the [[Sony Xperia Z2]] and [[HTC One M8]] adapted this resolution as well. In late 2014, the [[iPhone 6]] doubled the frame rate to 240fps, and in late 2015, the [[iPhone 6s]] added support for 1080p (1920×1080) at 120 frames per second. In early 2015, the [[Galaxy S6]] became the first Samsung mobile phone to retain the sensor framerate and audio, and in early 2016, the [[Galaxy S7]] became the first Samsung mobile phone with 240fps recording, also at 720p.", "In early 2015, the MT6795 chipset by [[MediaTek]] promised 1080p@480fps video recording. The projects status remains indefinite.", "Since early 2017, starting with the [[Sony Xperia XZ]], smartphones have been released with a slow motion mode that unsustainably records at framerates multiple times as high, by temporarily storing frames on the image sensors internal burst memory. Such a recording endures few real-time seconds at most.", "In late 2017, the [[iPhone 8]] brought 1080p at 240fps, as well as 2160p at 60fps, followed by the Galaxy S9 in early 2018. In late 2018, the [[OnePlus 6]] brought 720p at 480fps, sustainable for one minute.", "So far, no device has claimed the spot for 2160p at 120fps."], "first_par": ["The first commercial [[camera phone]] was the [[Kyocera]] [[Kyocera VP-210 Visual Phone|Visual Phone VP-210]], released in Japan in May 1999. It was called a \"mobile videophone\" at the time, and had a 110,000-[[pixel]] [[front-facing camera]]. It could send up to two images per second over Japans [[Personal Handy-phone System]] (PHS) [[cellular network]], and store up to 20 [[JPEG]] [[digital images]], which could be sent over [[e-mail]]. The first mass-market camera phone was the [[J-SH04]], a [[Sharp Corporation|Sharp]] [[J-Phone]] model sold in Japan in November 2000. It could instantly transmit pictures via cell phone [[telecommunication]].", "By the mid-2000s, higher-end [[cell phones]] commonly had integrated digital cameras. In 2003 [[camera phone]]s outsold stand-alone digital cameras, and in 2006 they outsold film and digital stand-alone cameras. Five billion camera phones were sold in five years, and by 2007 more than half of the [[installed base]] of all mobile phones were camera phones. Sales of separate cameras peaked in 2008.", "Many early smartphones didnt have cameras at all, and earlier models that had them had low performance and insufficient image and video quality that could not compete with budget pocket cameras and fulfill users needs. By the beginning of the 2010s almost all smartphones had an integrated digital camera. The decline in sales of stand-alone cameras accelerated due to the increasing use of smartphones with rapidly improving camera technology for casual photography, easier [[Digital image processing|image manipulation]], and abilities to directly [[Image sharing|share photos]] through the use of [[Mobile app|apps]] and web-based services. By 2011, cell phones with integrated cameras were selling hundreds of millions per year. In 2015, digital camera sales were 35.395 million units or only less than a third of digital camera sales numbers at their peak and also slightly less than film camera sold number at their peak.", "Contributing to the rise in popularity of smartphones being used over dedicated cameras for photography, smaller pocket cameras have difficulty producing [[bokeh]] in images, but nowadays, some smartphones have dual-lens cameras that reproduce the bokeh effect easily, and can even rearrange the level of bokeh after shooting. This works by capturing multiple images with different focus settings, then combining the background of the main image with a [[Macro photography|macro focus shot]].", "In 2007 the [[Nokia N95]] was notable as a smartphone that had a 5.0 [[Megapixel]] (MP) camera, when most others had cameras with around 3 MP or less than 2 MP. Some specialized feature phones like the [[LG Viewty]], [[Samsung SGH-G800]], and [[Sony Ericsson K850i]], all released later that year, also had 5.0 MP cameras. By 2010 5.0 MP cameras were common; a few smartphones had 8.0 MP cameras and the [[Nokia N8]], [[Sony Ericsson Satio]], and [[Samsung M8910 Pixon12]] feature phone had 12 MP. In 2009 the [[Samsung Omnia HD]] was the first phone with [[720p]] video recording. A 14-megapixel smartphone with 3x optical zoom was announced in late 2010. In 2012 Nokia announced the [[Nokia 808 PureView]], featuring a 41-megapixel 1/1.2-inch sensor and a high-resolution f/2.4 [[Carl Zeiss AG|Zeiss]] all-aspherical one-group lens. [[1080p]] video recording on a smartphone was achieved [[Galaxy S2|in 2011]], and [[2160p]] (4K) video recording [[Galaxy Note 3|in 2013]]. In 2016 [[Apple Inc.|Apple]] introduced the [[iPhone 7 Plus]], one of the phones to popularize a dual camera setup. The [[iPhone 7 Plus]] included a main 12 MP camera along with a 12 MP telephoto camera. In early 2018 [[Huawei]] released a new flagship phone, the [[Huawei P20|Huawei P20 Pro]], one of the first triple camera lens setups with [[Leica Camera|Leica]] optics. In late 2018, [[Samsung]] released a new mid-range smartphone, the [[Samsung Galaxy A9 (2018)|Galaxy A9 (2018)]] with the worlds first quad camera setup. The [[Nokia 9 PureView]] was released in 2019 featuring a penta-lens camera system.", "2019 saw the commercialization of high resolution sensors, which use [[Bayer filter|pixel binning]] to capture more light. 48 MP and 64 MP sensors developed by Sony and Samsung are commonly used by several manufacturers. 108 MP sensors were first implemented in late 2019 and early 2020."]}, "Form factor and operating system shifts": {"Operating system competition": ["The iPhone and later touchscreen-only Android devices together popularized the slate [[Form factor (mobile phones)|form factor]], based on a large [[capacitive touchscreen]] as the sole means of interaction, and led to the decline of earlier, keyboard- and keypad-focused platforms. Later, navigation keys such as the [[home button|home]], back, [[menu key|menu]], task and search buttons have also been increasingly replaced by nonphysical touch keys, then virtual, simulated on-screen navigation keys, commonly with access combinations such as a long press of the task key to simulate a short menu key press, as with home button to search. More recent \"bezel-less\" types have their screen surface space extended to the units front bottom to compensate for the display area lost for simulating the navigation keys. While virtual keys offer more potential customizability, their location may be inconsistent among systems and/or depending on screen rotation and software used.", "Multiple vendors attempted to update or replace their existing smartphone platforms and devices to better-compete with Android and the iPhone; Palm unveiled a new platform known as [[webOS]] for its [[Palm Pre]] in late-2009 to replace [[Palm OS]], which featured a focus on a task-based \"card\" metaphor and seamless synchronization and integration between various online services (as opposed to the then-conventional concept of a smartphone needing a PC to serve as a \"canonical, authoritative repository\" for user data). [[Hewlett-Packard|HP]] acquired Palm in 2010 and released several other webOS devices, including the [[Pre 3]] and [[HP TouchPad]] tablet. As part of a proposed divestment of its consumer business to focus on enterprise software, HP abruptly ended development of future webOS devices in August 2011, and sold the rights to webOS to [[LG Electronics]] in 2013, for use as a [[smart TV]] platform.", "[[Research in Motion]] introduced the vertical-sliding [[BlackBerry Torch]] and BlackBerry OS 6 in 2010, which featured a redesigned user interface, support for gestures such as pinch-to-zoom, and a new web browser based on the same [[WebKit]] rendering engine used by the iPhone. The following year, RIM released BlackBerry OS 7 and new models in the [[BlackBerry Bold|Bold]] and Torch ranges, which included a new Bold with a touchscreen alongside its keyboard, and the Torch 9860—the first BlackBerry phone to not include a physical keyboard. In 2013, it replaced the legacy BlackBerry OS with a revamped, [[QNX]]-based platform known as [[BlackBerry 10]], with the all-touch [[BlackBerry Z10]] and keyboard-equipped [[BlackBerry Q10|Q10]] as launch devices.", "In 2010, Microsoft unveiled a replacement for Windows Mobile known as [[Windows Phone]], featuring a new touchscreen-centric user interface built around [[flat design]] and typography, a home screen with \"live tiles\" containing feeds of updates from apps, as well as integrated [[Microsoft Office]] apps. In February 2011, Nokia announced that it had entered into a major partnership with Microsoft, under which it would exclusively use Windows Phone on all of its future smartphones, and integrate Microsofts [[Bing (search engine)|Bing]] search engine and [[Bing Maps]] (which, as part of the partnership, would also license [[Nokia Maps]] data) into all future devices. The announcement led to the abandonment of both Symbian, as well as [[MeeGo]]—a Linux-based mobile platform it was co-developing with Intel. Nokias low-end [[Lumia 520]] saw strong demand and helped Windows Phone gain niche popularity in some markets, overtaking BlackBerry in global market share in 2013.", "Many of these attempts to compete with Android and iPhone were short-lived. Over the course of the decade, the two platforms became a clear [[duopoly]] in smartphone sales and market share, with BlackBerry, Windows Phone, and \"other\" operating systems eventually stagnating to little or no measurable market share. In 2015, BlackBerry began to pivot away from its in-house mobile platforms in favor of producing Android devices, focusing on a security-enhanced distribution of the software. The following year, the company announced that it would also exit the hardware market to focus more on software and its enterprise middleware, and began to license the BlackBerry brand and its Android distribution to third-party OEMs such as [[TCL Corporation|TCL]] for future devices.", "In September 2013, Microsoft announced its intent to acquire Nokias mobile device business for $7.1 billion, as part of a strategy under CEO [[Steve Ballmer]] for Microsoft to be a \"devices and services\" company. Despite the growth of Windows Phone and the [[Microsoft Lumia|Lumia]] range (which accounted for nearly 90% of all Windows Phone devices sold), the platform never had significant market share in the key U.S. market, and Microsoft was unable to maintain Windows Phones momentum in the years that followed, resulting in dwindling interest from users and app developers. After Balmer was succeeded by [[Satya Nadella]] (who has placed a larger focus on software and cloud computing) as CEO of Microsoft, it took a $7.6 billion [[write-off]] on the Nokia assets in July 2015, and laid off nearly the entire [[Microsoft Mobile]] unit in May 2016.", "Prior to the completion of the sale to Microsoft, Nokia released a series of Android-derived smartphones for [[emerging market]]s known as [[Nokia X family|Nokia X]], which combined an Android-based platform with elements of Windows Phone and Nokias feature phone platform [[Nokia Asha platform|Asha]], using Microsoft and Nokia services rather than Google."], "first_par": ["The late 2000s and early 2010s saw a shift in smartphone interfaces away from devices with physical keyboards and keypads to ones with large finger-operated [[Touchscreen#Capacitive|capacitive]] touchscreens. The first phone of any kind with a large capacitive touchscreen was the [[LG Prada]], announced by [[LG Electronics|LG]] in December 2006. This was a fashionable [[feature phone]] created in collaboration with Italian luxury designer [[Prada]] with a 3\" 240x400 pixel screen.", "In January 2007, [[Apple Inc.|Apple Computer]] introduced the [[iPhone (1st generation)|iPhone]]. It had a 3.5\" [[Touchscreen#Capacitive|capacitive]] touchscreen with twice the common resolution of most [[Comparison of smartphones#2007|smartphone screens at the time]], and introduced [[multi-touch]] to phones, which allowed gestures such as \"pinching\" to zoom in or out on photos, maps, and web pages. The iPhone was notable as being the first device of its kind targeted at the mass market to abandon the use of a stylus, keyboard, or keypad typical of contemporary smartphones, instead using a large touchscreen for direct finger input as its main means of interaction.", "The iPhones [[Mobile operating system|operating system]] was also a shift away from previous ones that were adapted from [[Personal digital assistant|PDA]]s and [[feature phone]]s, to one powerful enough to avoid using a limited, [[Mobile browser|stripped down web browser]] requiring pages specially formatted using technologies such as [[Wireless Markup Language|WML]], [[i-mode|cHTML]], or [[XHTML]] that previous phones supported and instead run a version of Apples [[Safari (web browser)|Safari]] browser that could easily render full websites not specifically designed for phones.", "Later Apple shipped a [[iPhone OS 2|software update]] that gave the iPhone a built-in on-device [[App Store (iOS)|App Store]] allowing direct wireless downloads of [[Mobile developers|third-party]] software. This kind of centralized App Store and free [[Software development kit|developer tools]] quickly became the new main paradigm for all smartphone platforms for software [[Software development|development]], [[Software distribution|distribution]], discovery, [[Installation (computer programs)|installation]], and payment, in place of expensive developer tools that required official approval to use and a dependence on [[List of digital distribution platforms for mobile devices#Third-party platforms|third-party sources]] providing applications for multiple platforms.", "The advantages of a design with software powerful enough to support advanced applications and a large capacitive touchscreen affected the development of another smartphone OS platform, [[Android (operating system)|Android]], with a more BlackBerry-like prototype device scrapped in favor of a touchscreen device with a slide-out physical keyboard, as Googles engineers thought at the time that a touchscreen could not completely replace a physical keyboard and buttons. Android is based around a modified Linux kernel, again providing more power than [[mobile operating system]]s adapted from PDAs and feature phones. The first Android device, the horizontal-sliding [[HTC Dream]], was released in September 2008."]}, "Early smartphones": ["Phones that made effective use of any significant data connectivity were still rare outside Japan until the introduction of the [[Danger Hiptop]] in 2002, which saw moderate success among U.S. consumers as the [[T-Mobile]] Sidekick. Later, in the mid-2000s, business users in the U.S. started to adopt devices based on Microsofts [[Windows Mobile]], and then [[BlackBerry]] smartphones from [[Research In Motion]]. American users popularized the term \"CrackBerry\" in 2006 due to the BlackBerrys addictive nature. In the U.S., the high cost of data plans and relative rarity of devices with [[Wi-Fi]] capabilities that could avoid cellular data network usage kept adoption of smartphones mainly to business professionals and \"[[early adopters]].\"", "Outside the U.S. and Japan, Nokia was seeing success with its smartphones based on [[Symbian]], originally developed by [[Psion (company)|Psion]] for their personal organisers, and it was the most popular smartphone OS in [[Europe]] during the middle to late 2000s. Initially, Nokias Symbian smartphones were focused on business with the [[Nokia Eseries|Eseries]], similar to Windows Mobile and BlackBerry devices at the time. From 2006 onwards, Nokia started producing consumer-focused smartphones, popularized by the entertainment-focused [[Nokia Nseries|Nseries]]. Until 2010, Symbian was the worlds most widely used smartphone operating system.", "The touchscreen [[PDA]]-derived nature of adapted operating systems like [[Palm OS]], the \"[[Pocket PC]]\" versions of what was later [[Windows Mobile]], and the [[UIQ]] interface that was originally designed for pen-based [[PDA]]s on [[Symbian OS]] devices resulted in some early smartphones having stylus-based interfaces. These allowed for virtual keyboards and/or handwriting input, thus also allowing easy entry of Asian characters.", "By the mid-2000s, the majority of smartphones had a physical [[QWERTY]] keyboard. Most used a \"[[Form factor (mobile phones)#Keyboard bars|keyboard bar]]\" form factor, like the [[BlackBerry]] line, [[Windows Mobile]] smartphones, [[Palm Treo]]s, and some of the [[Nokia Eseries]]. A few hid their full physical QWERTY keyboard in a [[Form factor (mobile phones)#Slider|sliding form factor]], like the [[Danger Hiptop]] line. Some even had only a [[Telephone keypad|numeric keypad]] using [[T9 (predictive text)|T9 text input]], like the [[Nokia Nseries]] and other models in the [[Nokia Eseries]]. [[Resistive touchscreen]]s with [[Stylus (computing)|stylus]]-based interfaces could still be found on a few smartphones, like the [[Palm Treo]]s, which had dropped their handwriting input after a few early models that were available in versions with [[Graffiti (Palm OS)|Graffiti]] instead of a keyboard."], "Japanese cell phones": ["In 1999, Japanese wireless provider [[NTT DoCoMo]] launched [[i-mode]], a new [[mobile internet]] platform which provided data transmission speeds up to 9.6 kilobits per second, and access web services available through the platform such as online shopping. NTT DoCoMos i-mode used [[cHTML]], a language which restricted some aspects of traditional [[HTML]] in favor of increasing data speed for the devices. Limited functionality, small screens and limited bandwidth allowed for phones to use the slower data speeds available. The rise of i-mode helped NTT DoCoMo accumulate an estimated 40 million subscribers by the end of 2001, and ranked first in market capitalization in Japan and second globally. Japanese cell phones increasingly diverged from global standards and trends to offer other forms of advanced services and smartphone-like functionality that were specifically tailored to the [[Japanese mobile phone culture|Japanese market]], such as [[mobile payment]]s and shopping, [[near-field communication]] (NFC) allowing [[Osaifu-Keitai|mobile wallet]] functionality to replace [[smart card]]s for transit fares, loyalty cards, identity cards, event tickets, coupons, money transfer, etc., downloadable content like musical [[ringtone]]s, [[Mobile game|game]]s, and [[Mobile comic|comic]]s, and [[1seg]] [[mobile television]]. Phones built by Japanese manufacturers used custom [[firmware]], however, and didnt yet feature standardized [[mobile operating system]]s designed to cater to [[mobile developers|third-party application development]], so their software and ecosystems were akin to very advanced [[feature phone]]s. As with other feature phones, additional software and services required partnerships and deals with providers.", "The degree of integration between phones and carriers, unique phone features, non-standardized platforms, and tailoring to Japanese culture made it difficult for Japanese manufacturers to export their phones, especially when demand was so high in Japan that the companies didnt feel the need to look elsewhere for additional profits.", "The rise of [[3G]] technology in other markets and non-Japanese phones with powerful standardized [[mobile operating system|smartphone operating system]]s, [[app store]]s, and advanced wireless network capabilities allowed non-Japanese phone manufacturers to finally break in to the Japanese market, gradually adopting Japanese phone features like [[emoji]]s, mobile payments, NFC, etc. and spreading them to the rest of the world."], "PDA/phone hybrids": ["Beginning in the mid-late 1990s, many people who had mobile phones carried a separate dedicated [[Personal digital assistant|PDA]] device, running early versions of operating systems such as [[Palm OS]], [[Newton OS]], [[Symbian]] or [[Windows CE]]/[[Pocket PC]]. These operating systems would later evolve into early [[mobile operating system]]s. Most of the \"smartphones\" in this era were hybrid devices that combined these existing familiar PDA OSes with basic phone hardware. The results were devices that were bulkier than either dedicated mobile phones or PDAs, but allowed a limited amount of cellular Internet access. PDA and mobile phone manufacturers competed in reducing the size of devices. The bulk of these smartphones combined with their high cost and expensive data plans, plus other drawbacks such as expansion limitations and decreased battery life compared to separate standalone devices, generally limited their popularity to \"[[early adopter]]s\" and business users who needed portable connectivity.", "In March 1996, [[Hewlett-Packard]] released the [[OmniGo 700LX]], a modified [[HP 200LX]] palmtop PC with a [[Nokia 2110]] mobile phone [[Piggy-back (transportation)|piggybacked]] onto it and [[Read-only memory|ROM]]-based software to support it. It had a 640×200 resolution CGA compatible four-shade gray-scale LCD screen and could be used to place and receive calls, and to create and receive text messages, emails and faxes. It was also 100% [[DOS]] 5.0 compatible, allowing it to run thousands of existing software titles, including early versions of [[Microsoft Windows|Windows]].", "In August 1996, [[Nokia]] released the [[Nokia 9000 Communicator]], a digital cellular PDA based on the [[Nokia 2110]] with an integrated system based on the [[PEN/GEOS 3.0]] operating system from [[Geoworks]]. The two components were attached by a hinge in what became known as a [[clamshell design]], with the display above and a physical [[QWERTY keyboard]] below. The PDA provided e-mail; calendar, address book, [[calculator]] and notebook applications; text-based Web browsing; and could send and receive faxes. When closed, the device could be used as a digital cellular telephone.", "In June 1999 [[Qualcomm]] released the \"pdQ Smartphone\", a [[Code division multiple access|CDMA]] digital [[Personal Communications Service|PCS]] smartphone with an integrated [[Palm OS|Palm]] PDA and Internet connectivity.", "* The [[Ericsson R380]] (December 2000) by [[Ericsson Mobile Communications]], the first phone running the operating system later named [[Symbian OS|Symbian]] (it ran [[EPOC (operating system)|EPOC]] Release 5, which was renamed Symbian OS at Release 6). It had PDA functionality and limited Web browsing on a [[resistive touchscreen]] utilizing a [[Stylus (computing)|stylus]]. While it was marketed as a \"smartphone\", users could not install their own software on the device.", "* The [[Kyocera 6035]] (February 2001), a dual-nature device with a separate [[Palm OS]] PDA operating system and CDMA mobile phone firmware. It supported limited Web browsing with the PDA software treating the phone hardware as an attached modem. ", "* The [[Nokia 9210 Communicator]] (June 2001), the first phone running Symbian (Release 6) with [[Nokia]]s [[Series 80 (software platform)|Series 80]] platform (v1.0). This was the first Symbian phone platform allowing the installation of additional applications. Like the Nokia 9000 Communicator its a large clamshell device with a full physical [[QWERTY keyboard]] inside.", "* [[Handspring (company)|Handspring]]s [[Treo 180]] (2002), the first smartphone that fully integrated the [[Palm OS]] on a GSM mobile phone having telephony, SMS messaging and Internet access built into the OS. The 180 model had a thumb-type keyboard and the [[Treo 180g|180g]] version had a [[Graffiti (Palm OS)|Graffiti]] handwriting recognition area, instead."], "Forerunner": ["In the early 1990s, [[IBM]] engineer [[Frank J. Canova|Frank Canova]] realised that chip-and-wireless technology was becoming small enough to use in [[handheld devices]]. The first commercially available device that could be properly referred to as a \"smartphone\" began as a prototype called \"Angler\" developed by Canova in 1992 while at IBM and demonstrated in November of that year at the [[COMDEX]] computer industry trade show. A refined version was marketed to consumers in 1994 by [[BellSouth]] under the name [[IBM Simon|Simon Personal Communicator]]. In addition to placing and receiving [[cellular frequencies|cellular]] [[telephone call|call]]s, the touchscreen-equipped Simon could send and receive [[fax]]es and [[email]]s. It included an address book, calendar, appointment scheduler, calculator, world time clock, and notepad, as well as other visionary mobile applications such as maps, stock reports and news.", "The [[IBM Simon]] was manufactured by [[Mitsubishi Electric]], which integrated features from its own wireless [[personal digital assistant]] (PDA) and [[cellular radio]] technologies. It featured a [[liquid-crystal display]] (LCD) and [[PC Card]] support. The Simon was commercially unsuccessful, particularly due to its bulky form factor and limited [[battery life]], using [[NiCad]] batteries rather than the [[Nickel–metal hydride battery|nickel–metal hydride batteries]] commonly used in mobile phones in the 1990s, or [[lithium-ion battery|lithium-ion batteries]] used in modern smartphones.", "The term \"smart phone\" was not coined until a year after the introduction of the Simon, appearing in print as early as 1995, describing AT&Ts PhoneWriter Communicator. The term \"smartphone\" was first used by [[Ericsson]] in 1997 to describe a new device concept, the GS88."], "first_par": ["The development of the smartphone was enabled by several key technological advances. The [[MOSFET scaling|exponential scaling]] and [[miniaturization]] of [[MOSFET]]s (MOS transistors) down to [[List of semiconductor scale examples|sub-micron levels]] during the 1990s2000s (as predicted by [[Moores law]]) made it possible to build portable [[smart devices]] such as smartphones, as well as enabling the transition from analog to faster digital [[wireless]] [[mobile network]]s (leading to [[Edholms law]]). Other important enabling factors include the [[lithium-ion battery]], an indispensable [[energy source]] enabling long [[battery life]], invented in the 1980s and commercialized in 1991, and the development of more mature [[Mobile operating system|software]] [[Computing platform|platforms]] that allowed mobile device [[Digital ecosystem|ecosystems]] to develop independently of [[Mobile network operator|data providers]]."]}, "Hardware": {"Accessories": ["A wide range of accessories are sold for smartphones, including [[Mobile phone accessories#Cases|cases]], [[#Memory_cards|memory card]]s, [[screen protector]]s, power [[charging cable]]s, [[wireless charging|wireless power]] stations, [[USB On-The-Go]] adapters (for connecting USB drives and or, in some cases, a HDMI cable to an external monitor), [[Mobile High-Definition Link|MHL]] adapters, add-on batteries, [[power bank]]s, [[headphones]], combined headphone-microphones (which, for example, allow a person to privately conduct [[Telephone call|call]]s on the device without holding it to the ear), and [[Bluetooth]]-enabled [[powered speaker]]s that enable users to listen to media from their smartphones wirelessly.", "Cases range from relatively inexpensive rubber or soft plastic cases which provide moderate protection from bumps and good protection from scratches to more expensive, heavy-duty cases that combine a rubber padding with a hard outer shell. Some cases have a \"book\"-like form, with a cover that the user opens to use the device; when the cover is closed, it protects the screen. Some \"book\"-like cases have additional pockets for credit cards, thus enabling people to use them as [[wallet]]s.", "Accessories include products sold by the manufacturer of the smartphone and compatible products made by other manufacturers."], "Cameras": {"Dedicated camera button": ["Some mobile phones such as the [[Samsung i8000 Omnia 2]], some [[Nokia Lumia]]s and some [[Sony Xperia]]s are equipped with a physical camera shutter button. ", "Those with two pressure levels resemble the [[point-and-shoot]] intuition of dedicated [[compact camera]]s. The camera button may be used as a [[shortcut (computing)|shortcut]] to quickly and [[ergonomy|ergonomically]] launch the camera software, as it is located more accessibly inside a pocket than the power button."], "Space constraints": ["Typically smartphones have at least one main rear-facing camera and a lower-resolution front-facing camera for \"[[selfie]]s\" and [[video chat]]. Owing to the limited depth available in smartphones for [[image sensor]]s and [[Lens|optics]], rear-facing cameras are often housed in a \"bump\" thats thicker than the rest of the phone. Since increasingly thin mobile phones have more abundant horizontal space than the depth that is necessary and used in dedicated cameras for better lenses, theres additionally a trend for phone manufacturers to include multiple cameras, with each optimized for a different purpose ([[Telephoto lens|telephoto]], [[Wide-angle lens|wide angle]], etc.).", "Modern advanced smartphones have cameras with [[Image stabilization#Optical image stabilization|optical image stabilisation]] (OIS), larger sensors, bright lenses, and even optical zoom plus [[Raw image format|RAW]] images. [[High-dynamic-range imaging|HDR]], \"[[Bokeh]] mode\" with multi lenses and multi-shot [[Night mode camera|night mode]]s are now also familiar. Many new smartphone camera features are being enabled via [[computational photography]] [[Digital image processing|image processing]] and multiple specialized lenses rather than larger sensors and lenses, due to the constrained space available inside phones that are being made as slim as possible."], "first_par": ["Cameras have become standard features of smartphones. As of 2019 phone cameras are now a highly competitive area of differentiation between models, with advertising campaigns commonly based on a focus on the quality or capabilities of a devices main cameras.", "Images are usually saved in the [[JPEG]] file format; some high-end phones also have [[Raw image format|RAW]] imaging capability."]}, "Battery": ["A smartphone typically uses a [[lithium-ion battery]] due to its high [[energy density]].", "Batteries chemically wear down as a result of repeated charging and discharging throughout ordinary usage, losing both energy capacity and output power, which results in loss of processing speeds followed by system outages. Battery capacity may be reduced to 80% after few hundred recharges, and the drop in performance accelerates with time.", "Some mobile phones are designed with batteries that can be interchanged upon expiration by the end user, usually by opening the back cover. While such a design had initially been used in most mobile phones, including those with touch screen that were not [[Apple iPhone]]s, it has largely been usurped throughout the 2010s by permanently built-in, non-replaceable batteries; a design practice criticized for [[Planned obsolescence#Non-user-replaceable batteries|planned obsolescence]].", "While charging rates have been increasing, with 15 [[Watt]]s in 2014, 20 Watts in 2016, and 45 Watts in 2018, the power throughput may be throttled down significantly during operation of the device.", "[[Wireless charging]] has been widely adapted, allowing for intermittent recharging without wearing down the charging port through frequent reconnection, with [[Qi_(standard)|Qi]] being the most common standard, followed by [[Powermat]]. Due to the lower efficiency of wireless power transmission, charging rates are below that of wired charging, and more heat is produced at similar charging rates.", "By the end of 2017, smartphone battery life has become generally adequate; however, earlier smartphone battery life was poor due to the weak batteries that could not handle the significant power requirements of the smartphones computer systems and color screens.", "Smartphone users purchase additional chargers for use outside the home, at work, and in cars and by buying portable external \"battery packs\". External battery packs include generic models which are connected to the smartphone with a cable, and custom-made models that \"piggyback\" onto a smartphones case. In 2016, Samsung had to recall millions of the [[Galaxy Note 7]] smartphones due to an explosive battery issue. For consumer convenience, [[inductive charging|wireless charging]] stations have been introduced in some hotels, bars, and other public spaces."], "Sound": {"Audio connector": ["The [[Phone_connector_(audio)#Miniature_size|3.5mm headphone receptible]] ([[colloquialism|coll.]] \"headphone jack\") allows the immediate operation of passive [[headphone]]s, as well as connection to other external auxiliary audio appliances. Among devices equipped with the connector, it is more commonly located at the bottom (charging port side) than on the top of the device ", "The decline of the connectors availability among newly released mobile phones among all major vendors commenced in 2016 with its lack on the Apple [[iPhone 7]]. An [[adapter]] reserving the charging port can retrofit the plug.", "Battery-powered, wireless [[Bluetooth]] headphones are an alternative. Those tend to be costlier however due to their need for internal hardware such as a Bluetooth [[transceiver]], and a Bluetooth coupling is required ahead of each operation."], "first_par": ["Some audio quality enhancing features, such as [[Voice over LTE]] and [[HD Voice]] have appeared and are often available on newer smartphones. Sound quality can remain a problem due to the design of the phone, the quality of the cellular network and compression algorithms used in [[long-distance call]]s. Audio quality can be improved using a [[VoIP]] application over [[WiFi]]. Cellphones have small speakers so that the user can use a [[speakerphone]] feature and talk to a person on the phone without holding it to their ear. The small speakers can also be used to listen to digital audio files of music or speech or watch videos with an audio component, without holding the phone close to the ear.", "Some mobile phones such as the [[HTC One M8]] and the [[Sony Xperia Z2]] are equipped with [[Stereophonic sound|stereophonic]] speakers to create spacial sound when in horizontal orientation."]}, "Storage": {"File transfer": ["Originally, [[mass storage]] access was commonly enabled to computers through USB. Over time, mass storage access was removed, leaving the [[Media Transfer Protocol]] as protocol for USB file transfer, due to its non-exclusive access ability where the computer is able to access the storage without it being locked away from the mobile phones software for the duration of the connection, and no necessity for common [[file system]] support, as communication is done through an [[abstraction layer]].", "However, unlike mass storage, Media Transfer Protocol lacks parallelism, meaning that only a single transfer can run at a time, for which other transfer requests need to wait to finish. In addition, the direct access of files through MTP is not supported. Any file is wholly downloaded from the device before opened."], "Memory cards": ["The space for data storage of some mobile phones can be expanded using [[MicroSD#Mobile phones|MicroSD]] [[memory card]]s, whose capacity has multiplied throughout the 2010s (→ ). Benefits over [[USB on the go]] storage and [[cloud storage]] include [[offline]] availability and [[privacy]], not reserving the [[charging port]], no connection instability or [[latency (engineering)|latency]], no dependence on voluminous [[data plan]]s, and preservation of the limited rewriting cycles of the devices permanent internal storage.", "In case of technical [[brick (electronics)|defects]] which make the device unusable or un[[boot (computing)|boot]]able as a result of liquid damage, fall damage, screen damage, [[bendgate|bending damage]], [[malware]], or bogus [[software update|system update]]s, etc., data stored on the memory card is likely [[data recovery|rescueable]] externally, while data on the inaccessible internal storage would be [[data loss|lost]]. A memory card can usually immediately be re-used in a different memory-card-enabled device with no necessity for prior [[file transfer]]s.", "Some [[dual-SIM]] mobile phones are equipped with a hybrid slot, where one of the two slots can be occupied by either a [[SIM card]] or a memory card."], "first_par": ["While [[eMMC]] (embedded multi media card) [[flash storage]] was most commonly used in mobile phones, its successor, [[Universal Flash Storage|UFS]] (Universal Flash Storage) with higher transfer rates emerged throughout the 2010s for upper-class devices.", ";Capacity", "While the internal storage capacity of mobile phones has been near-stagnant during the first half of the 2010s, it has increased steeper during its second half, with [[Samsung Telecommunications|Samsung]] for example increasing the available internal storage options of their flagship class units from 32 GB to 512 GB within only 2 years between 2016 and 2018."]}, "Display": ["One of the main characteristics of smartphones is the [[Display device|screen]]. Depending on the devices design, the screen fills most or nearly all of the space on a devices front surface. Many smartphone displays have an [[Display aspect ratio|aspect ratio]] of [[16:9]], but taller aspect ratios became more common in 2017.", "Screen sizes are measured in diagonal [[inch]]es. Phones with screens larger than 5.2 inches are often called \"[[phablet]]s\". Smartphones with screens over 4.5 inches in size are commonly difficult to use with only a single hand, since most thumbs cannot reach the entire screen surface; they may need to be shifted around in the hand, held in one hand and manipulated by the other, or used in place with both hands. Due to design advances, some modern smartphones with large screen sizes and \"edge-to-edge\" designs have compact builds that improve their ergonomics, while the shift to taller aspect ratios have resulted in phones that have larger screen sizes whilst maintaining the ergonomics associated with smaller 16:9 displays.", "[[Liquid-crystal display]]s (LCDs) and [[organic light-emitting diode]] (OLED) displays are the most common. Some displays are integrated with pressure-sensitive digitizers, such as those developed by [[Wacom (company)|Wacom]] and [[Samsung]], and Apples [[Force Touch]] system. A few phones, such as the [[YotaPhone]] prototype, are equipped with a low-power [[electronic paper]] rear display, as used in [[e-book reader]]s.", "Some devices are equipped with additional input methods such as a [[stylus]] for higher precision input, and/or a [[Touchscreen#Self-capacitance|self-capacitive touch screen]]s layer for floating finger detection. The latter was utilized by few phones such as the [[Samsung Galaxy S4]], [[Samsung Galaxy Note 3|Note 3]], [[Samsung Galaxy S5|S5]], and [[Sony Xperia Sola]] for preview [[tooltip]]s (such as on the [[video player]]s seek bar, in text messages, and quick contacts on the [[dial pad]]), [[lock screen]] animation, and the simulation of a [[mouseover|hover]]ing [[mouse cursor]] on web sites."], "Central processing unit": ["Smartphones have [[central processing unit]]s (CPUs), similar to those in computers, but optimised to operate in low power environments. In smartphones, the CPU is typically integrated in a [[CMOS]] (complementary [[metal–oxide–semiconductor]]) [[system-on-a-chip]] (SoC) [[microprocessor|application processor]].", "The performance of mobile CPU depends not only on the clock rate (generally given in multiples of [[hertz]]) but also on the [[memory hierarchy]]. Because of these challenges, the performance of mobile phone CPUs is often more appropriately given by scores derived from various standardized tests to measure the real effective performance in commonly used applications."], "first_par": ["A typical smartphone contains a number of [[metal–oxide–semiconductor]] (MOS) [[integrated circuit]] (IC) chips, which in turn contain billions of tiny [[MOSFET|MOS field-effect transistors]] (MOSFETs). A typical smartphone contains the following MOS IC chips.", "*[[Microprocessor|Application processor]] ([[CMOS]] [[system-on-a-chip]])", "*[[Flash memory]] ([[floating-gate]] [[MOS memory]])", "*[[Cellular modem]] ([[baseband]] [[RF CMOS]])", "*[[RF transceiver]] ([[RF CMOS]])", "*[[Phone camera]] [[image sensor]] ([[CMOS image sensor]])", "*[[Power management integrated circuit]] ([[power MOSFET]]s)", "*[[Display driver]] ([[LCD]] or [[LED driver]])", "*[[Wireless communication]] chips ([[Wi-Fi]], [[Bluetooth]], [[GPS receiver]])", "*[[Sound chip]] ([[audio codec]] and [[power amplifier]])", "*[[Gyroscope]]", "*[[Capacitive sensing|Capacitive]] [[touchscreen]] controller ([[ASIC]] and [[Digital signal processor|DSP]])", "*[[RF power amplifier]] ([[LDMOS]])", "* A hardware [[notification LED]] on some phones"]}, "Software": {"Application stores": ["The introduction of Apples App Store for the iPhone and iPod Touch in July 2008 popularized manufacturer-hosted [[list of digital distribution platforms for mobile devices|online distribution]] for third-party applications ([[software]] and [[computer programs]]) focused on a single platform. There are a huge variety of apps, including [[video game]]s, music products and business tools. Up until that point, smartphone application distribution depended on [[List of digital distribution platforms for mobile devices#Third-party platforms|third-party sources]] providing applications for multiple platforms, such as [[GetJar]], [[Handango]], [[Handmark]], and [[PocketGear]]. Following the success of the App Store, other smartphone manufacturers launched application stores, such as Googles Android Market (later renamed to the Google Play Store) and RIMs [[BlackBerry App World]], Android-related app stores like [[Aptoide]], [[Cafe Bazaar]], [[F-Droid]], [[GetJar]], and [[Opera Mobile Store]]. In February 2014, 93% of [[mobile developers]] were targeting smartphones first for mobile app development."], "Mobile app": ["A mobile app is a computer program designed to run on a mobile device, such as a smartphone. The term \"app\" is a short-form of the term \"software application\"."], "Mobile operating systems": ["A mobile operating system (or mobile OS) is an [[operating system]] for phones, [[tablet computer|tablet]]s, [[smartwatch]]es, or other [[mobile device]]s.", "Mobile operating systems combine features of a [[personal computer]] operating system with other features useful for mobile or handheld use; usually including, and most of the following considered essential in modern mobile systems; a [[touchscreen]], [[Cellular network|cellular]], [[Bluetooth]], [[Wi-Fi Protected Access]], [[Wi-Fi]], [[Global Positioning System]] (GPS) mobile navigation, [[video camera|video-]] and [[digital camera|single-frame picture cameras]], [[speech recognition]], [[Sound recording and reproduction|voice recorder]], [[portable media player|music player]], [[near field communication]], and [[infrared blaster]]. By Q1 2018, over 383 million smartphones were sold with 85.9 percent running [[Android (operating system)|Android]], 14.1 percent running [[iOS]] and a negligible number of smartphones running other OSes. Android alone is more popular than the popular desktop operating system Windows, and in general smartphone use (even without tablets) exceeds desktop use.", "Mobile devices with mobile communications abilities (e.g., smartphones) contain two mobile operating systemsthe main user-facing software platform is supplemented by a second low-level proprietary [[real-time operating system]] which operates the radio and other hardware. Research has shown that these low-level systems may contain a range of security vulnerabilities permitting malicious [[base station]]s to gain high levels of control over the mobile device."]}, "Sales": {"By manufacturer": ["In 2011, Samsung had the highest shipment [[market share]] worldwide, followed by Apple. In 2013, Samsung had 31.3% market share, a slight increase from 30.3% in 2012, while Apple was at 15.3%, a decrease from 18.7% in 2012. Huawei, LG and Lenovo were at about 5% each, significantly better than 2012 figures, while others had about 40%, the same as the previous years figure. Only Apple lost market share, although their shipment volume still increased by 12.9%; the rest had significant increases in shipment volumes of 36–92%. In Q1 2014, Samsung had a 31% share and Apple had 16%. In Q4 2014, Apple had a 20.4% share and Samsung had 19.9%. In Q2 2016, Samsung had a 22.3% share and Apple had 12.9%. In Q1 2017, IDC reported that Samsung was first placed, with 80 million units, followed by Apple with 50.8 million, Huawei with 34.6 million, [[Oppo]] with 25.5 million and Vivo with 22.7 million.", "Samsungs mobile business is half the size of Apples, by revenue. Apple business increased very rapidly in the years 2013 to 2017. [[Realme]], a brand owned by Oppo, is the fastest-growing phone brand worldwide since Q2 2019. In China, Huawei and Honor, a brand owned by Huawei, have 46% of market share combined and posted 66% annual growth as of 2019, amid growing Chinese nationalism. In 2019, Samsung had a 74% market share in 5G smartphones while 5G smartphones had 1% of market share in China.", "Research has shown that iPhones are commonly associated with wealth, and that the average iPhone user has 40% more annual income than the average Android user. Women are more likely than men to own an iPhone. TrendForce predicts that foldable phones will start to become popular in 2021."], "first_par": ["Since 1996, smartphone shipments have had positive growth. In November 2011, 27% of all photographs created were taken with camera-equipped smartphones. In September 2012, a study concluded that 4 out of 5 smartphone owners use the device to shop online. Global smartphone sales surpassed the sales figures for feature phones in early 2013. Worldwide shipments of smartphones topped 1 billion units in 2013, up 38% from 2012s 725 million, while comprising a 55% share of the mobile phone market in 2013, up from 42% in 2012. In 2013, smartphone sales began to decline for the first time. In Q1 2016 for the first time the shipments dropped by 3 percent [[:wikt:year-over-year|year on year]]. The situation was caused by the maturing China market. A report by NPD shows that fewer than 10% of US citizens have bought $1,000+ smartphones, as they are too expensive for most people, without introducing particularly innovative features, and amid [[Huawei]], [[Oppo]] and [[Xiaomi]] introducing products with similar feature sets for lower prices. In 2019, smartphone sales declined by 3.2%, the largest in smartphone history, while China and India were credited with driving most smartphone sales worldwide. It is predicted that widespread adoption of 5G will help drive new smartphone sales."]}, "Use": {"Convergence with other devices": ["The rise in popularity of touchscreen smartphones and mobile apps distributed via app stores along with rapidly advancing [[Cellular network|network]], [[mobile processor]], and [[Computer data storage|storage]] technologies led to a [[Technological convergence|convergence]] where separate [[mobile phone]]s, [[Personal organizer|organizer]]s, and [[portable media player]]s were replaced by a smartphone as the single device most people carried. Advances in [[Image sensor|digital camera sensor]]s and on-device [[Digital image processing|image processing]] software more gradually led to smartphones replacing simpler [[Point-and-shoot camera|camera]]s for photographs and video recording. The built-in [[Global navigation satellite systems|GPS]] capabilities and [[List of online map services|mapping]] apps on smartphones largely replaced stand-alone [[satellite navigation]] [[Personal navigation assistant#Market developments|devices]], and paper [[Road map|map]]s became less common. [[Mobile gaming]] on smartphones greatly grew in popularity, allowing many people to use them in place of [[handheld game consoles]], and some companies tried creating game console/phone hybrids based on phone hardware and software. People frequently have chosen not to get [[Landline|fixed-line telephone service]] in favor of smartphones. [[Streaming media#Music streaming platforms|Music streaming]] apps and services have grown rapidly in popularity, serving the same use as listening to music stations on a terrestrial or satellite [[Radio receiver|radio]]. [[Streaming media|Streaming video]] services are easily accessed via smartphone apps and can be used in place of watching [[television]]. People have often stopped wearing [[wristwatch]]es in favor of checking the time on their smartphones, and many use the clock features on their phones in place of [[alarm clock]]s. Mobile phones can also be used as a digital [[note taking]], [[text editing]] and [[memorandum]] device whose [[computer|computerization]] facilitates searching of entries.", "Additionally, [[Global Internet usage#Broadband usage|in many lesser technologically developed regions]] smartphones are peoples first and only means of [[Mobile broadband|Internet access]] due to their portability, with [[personal computer]]s being relatively uncommon outside of business use. The cameras on smartphones can be used to photograph documents and send them via email or [[Text messaging|messaging]] in place of using [[fax]] (facsimile) machines. [[Mobile payment|Payment apps and services]] on smartphones allow people to make less use of wallets, purses, credit and debit cards, and cash. [[Mobile banking]] apps can allow people to deposit checks simply by photographing them, eliminating the need to take the physical check to an [[Automated teller machine|ATM]] or teller. [[Guide book]] apps can take the place of paper travel and restaurant/business guides, museum brochures, and dedicated [[Audio tour#Smartphone tours|audio guide]] equipment."], "Facsimile": ["Some [[mobile apps|apps]] allows for sending and receiving [[Fax|facsimile (Fax)]], over a smartphone, including facsimile data (composed of raster [[Binary image|bi-level]] graphics) generated directly and digitally from [[Document file format|document]] and [[Image file formats|image]] file formats."], "Mobile banking and payment": ["In many countries, mobile phones are used to provide [[mobile banking]] services, which may include the ability to transfer cash payments by secure SMS text message. Kenyas [[M-PESA]] mobile banking service, for example, allows customers of the mobile phone operator [[Safaricom]] to hold cash balances which are recorded on their SIM cards. Cash can be deposited or withdrawn from M-PESA accounts at Safaricom retail outlets located throughout the country and can be transferred electronically from person to person and used to pay bills to companies.", "[[Branchless banking]] has been successful in South Africa and the [[Philippines]]. A pilot project in [[Bali]] was launched in 2011 by the [[International Finance Corporation]] and an [[Indonesia]]n bank, [[Bank Mandiri]].", "Another application of mobile banking technology is [[Zidisha]], a US-based nonprofit micro-lending platform that allows residents of developing countries to raise small business loans from Web users worldwide. Zidisha uses mobile banking for loan disbursements and repayments, transferring funds from lenders in the United States to borrowers in rural Africa who have mobile phones and can use the Internet.", "Mobile payments were first trialled in Finland in 1998 when two Coca-Cola vending machines in [[Espoo]] were enabled to work with SMS payments. Eventually, the idea spread and in 1999, the Philippines launched the countrys first commercial mobile payments systems with mobile operators [[Globe Telecom|Globe]] and [[Smart Communications|Smart]].", "Some mobile phones can make [[mobile payment]]s via direct mobile billing schemes, or through [[contactless payment]]s if the phone and the [[point of sale]] support [[near field communication]] (NFC). Enabling contactless payments through NFC-equipped mobile phones requires the co-operation of manufacturers, network operators, and retail merchants."]}, "Criticism and issues": {"Sleep": ["Using smartphones late at night can disturb sleep, due to the blue light and brightly lit screen, which affects [[melatonin]] levels and [[sleep cycles]]. In an effort to alleviate these issues, \"Night Mode\" functionality to change the [[color temperature]] of a screen to a warmer hue based on the time of day to reduce the amount of blue light generated became available through several apps for Android and the [[f.lux]] software for [[Jailbreak (iPhone OS)|jailbroken]] iPhones. [[iOS 9|iOS 9.3]] integrated a similar, system-level feature known as \"[[Night Shift (software)|Night Shift]].\" Several Android device manufacturers bypassed Googles initial reluctance to make Night Mode a standard feature in Android and included software for it on their hardware under varying names, before [[Android Oreo]] added it to the OS for compatible devices.", "It has also been theorized that for some users, addiction to use of their phones, especially before they go to bed, can result in \"[[ego depletion]].\" Many people also use their phones as alarm clocks, which can also lead to loss of sleep."], "Security": ["Smartphone malware is easily distributed through an insecure [[app store]]. Often, malware is hidden in [[Copyright infringement of software|pirated]] versions of legitimate apps, which are then distributed through third-party app stores. Malware risk also comes from what is known as an \"update attack\", where a legitimate application is later changed to include a malware component, which users then install when they are notified that the app has been updated. As well, one out of three robberies in 2012 in the United States involved the theft of a mobile phone. An online petition has urged smartphone makers to install [[kill switch]]es in their devices. In 2014, Apples \"Find my iPhone\" and Googles \"Android Device Manager\" can locate, disable, and wipe the data from phones that have been lost or stolen. With BlackBerry Protect in OS version 10.3.2, devices can be rendered unrecoverable to even BlackBerrys own Operating System recovery tools if incorrectly authenticated or dissociated from their account.", "Leaked documents published by [[WikiLeaks]], codenamed [[Vault 7]] and dated from 2013 to 2016, detail the capabilities of the [[United States]] [[Central Intelligence Agency]] (CIA) to perform electronic surveillance and [[cyber warfare]], including the ability to compromise the operating systems of most smartphones (including [[iOS]] and [[Android (operating system)|Android]]).", "Guidelines for mobile device security were issued by NIST and many other organizations. For conducting a private, in-person meeting, at least one site recommends that the user switch the smartphone off and disconnect the battery."], "Medical": ["With the rise in number of mobile medical apps in the market place, government regulatory agencies raised concerns on the safety of the use of such applications. These concerns were transformed into regulation initiatives worldwide with the aim of safeguarding users from untrusted medical advice. According to the findings of these medical experts in recent years, excessive smartphone use in society may lead to headaches, sleep disorders and insufficient sleep, while severe smartphone addiction may lead to physical health problems, such as hunchback, muscle relaxation and uneven nutrition."], "Legal": ["A \"patent war\" between Samsung and Apple started when the latter claimed that the original [[Samsung Galaxy S|Galaxy S]] Android phone copied the interfaceand possibly the hardwareof Apples iOS for the [[iPhone 3GS]]. There was also smartphone patents licensing and litigation involving [[Sony Mobile]], [[Google]], [[Apple Inc.]], [[Samsung Electronics|Samsung]], [[Microsoft]], [[Nokia]], [[Motorola]], [[HTC]], [[Huawei]] and [[ZTE]], among others. The conflict is part of the [[Technology patent wars|wider \"patent wars\"]] between multinational technology and software corporations. To secure and increase [[market share]], companies granted a [[patent]] can sue to prevent competitors from using the methods the patent covers. Since the 2010s the number of lawsuits, counter-suits, and trade complaints based on patents and [[Industrial design right|designs]] in the market for smartphones, and devices based on [[Mobile operating system|smartphone OSes]] such as [[Android (operating system)|Android]] and [[iOS]], has increased significantly. Initial suits, countersuits, rulings, license agreements, and other major events began in 2009 as the smartphone market stated to grow more rapidly by 2012."], "While driving": ["Mobile phone use while driving—including [[Telephone call|call]]ing, [[text messaging]], playing media, [[web browsing]], [[Video game|gaming]], using mapping apps or operating other phone features—is common but controversial, since it is widely considered dangerous due to what is known as [[distracted driving]]. Being distracted while operating a motor vehicle has been shown to increase the risk of [[accident]]s. In September 2010, the US [[National Highway Traffic Safety Administration]] (NHTSA) reported that 995 people were killed by drivers distracted by phones. In March 2011 a US insurance company, [[State Farm Insurance]], announced the results of a study which showed 19% of drivers surveyed accessed the Internet on a smartphone while driving. Many jurisdictions prohibit the use of mobile phones while driving. In Egypt, Israel, Japan, Portugal and Singapore, both handheld and hands-free [[telephone call|calling]] on a mobile phone (which uses a [[speakerphone]]) is banned. In other countries including the UK and France and in many US states, only the use of calling on handheld phones is banned, while hands-free use is permitted.", "A 2011 study reported that over 90% of college students surveyed text (initiate, reply or read) while driving.", "The [[scientific literature]] on the danger of driving while sending a text message from a mobile phone, or [[texting while driving]], is limited. A simulation study at the [[University of Utah]] found a sixfold increase in distraction-related accidents when texting. Due to the complexity of smartphones that began to grow more after, this has introduced additional difficulties for law enforcement officials when attempting to distinguish one usage from another in drivers using their devices. This is more apparent in countries which ban both handheld and hands-free usage, rather than those which ban handheld use only, as officials cannot easily tell which function of the phone is being used simply by looking at the driver. This can lead to drivers being stopped for using their device illegally for a call when, in fact, they were using the device legally, for example, when using the phones incorporated controls for car stereo, [[GPS]] or [[satnav]].", "A 2010 study reviewed the incidence of phone use while [[cycling]] and its effects on behavior and safety. In 2013 a national survey in the US reported the number of drivers who reported using their phones to access the Internet while driving had risen to nearly one of four. A study conducted by the University of Vienna examined approaches for reducing inappropriate and problematic use of mobile phones, such as using phones while driving.", "Accidents involving a driver being distracted by being in a [[Telephone call|call]] on a phone have begun to be prosecuted as negligence similar to speeding. In the [[United Kingdom]], from 27 February 2007, motorists who are caught using a handheld phone while driving will have three penalty points added to their license in addition to the fine of [[£]]60. This increase was introduced to try to stem the increase in drivers ignoring the law. [[Japan]] prohibits all use of phones while driving, including use of hands-free devices. New Zealand has banned handheld phone use since 1 November 2009. Many states in the United States have banned text messaging on phones while driving. Illinois became the 17th American state to enforce this law. As of July 2010, 30 states had banned texting while driving, with Kentucky becoming the most recent addition on July 15.", "Public Health Law Research maintains a list of distracted driving laws in the [[United States]]. This database of laws provides a comprehensive view of the provisions of laws that restrict the use of mobile devices while driving for all 50 states and the District of Columbia between 1992, when first law was passed through December 1, 2010. The dataset contains information on 22 dichotomous, continuous or categorical variables including, for example, activities regulated (e.g., texting versus talking, hands-free versus handheld calls, web browsing, gaming), targeted populations, and exemptions."], "Social impacts": ["In 2012, [[University of Southern California]] study found that [[Safe sex|unprotected]] [[adolescent sexuality|adolescent sexual]] activity was more common among owners of smartphones. A study conducted by the [[Rensselaer Polytechnic Institute]]s (RPI) Lighting Research Center (LRC) concluded that smartphones, or any backlit devices, can seriously affect [[Stages of sleep|sleep cycles]]. Some persons might become psychologically attached to smartphones resulting in anxiety when separated from the devices. A \"[[smombie]]\" (a combination of \"smartphone\" and \"[[zombie]]\") is a walking person using a smartphone and not paying attention as they walk, possibly risking an accident in the process, an increasing social phenomenon. The issue of slow-moving smartphone users led to the temporary creation of a \"mobile lane\" for walking in [[Chongqing]], [[China]]. The issue of distracted smartphone users led the city of [[Augsburg, Germany]] to embed pedestrian traffic lights in the pavement."]}, "Lifespan": ["In mobile phones released since the second half of the 2010s, operational life span commonly is limited by built-in batteries which are not designed interchangeable. The life expectancy of batteries depends on usage intensity of the powered device, where activity (longer usage) and tasks demanding more energy expire the battery earlier.", "[[Lithium-ion]] and [[Lithium-polymer]] batteries, those commonly powering [[portable electronics]], additionally wear down more from fuller charge and deeper discharge cycles, and when unused for an extended amount of time while depleted, where self-discharging may lead to a harmful depth of discharge.", "The functional life span of mobile phones may be limited by lack of [[software update]] support, such as deprecation of [[Transport Layer Security|TLS]] cipher suites by [[certificate authority]] with no official patches provided for earlier devices."]}, "main_pages": {"Hardware": ["Mobile phone features"], "Memory cards": ["MicroSD#Mobile_phones"], "Mobile operating systems": ["Mobile operating system"], "Application stores": ["List of mobile app distribution platforms"], "Social impacts": ["Problematic smartphone use"], "While driving": ["Mobile phones and driving safety", "Texting while driving"], "Legal": ["Smartphone wars"], "Medical": ["Mobile app"], "Security": ["Mobile security", "Malware", "Mobile virus", "Media Transfer Protocol"], "Sleep": ["Electronic media and sleep"]}}}