{
	"games": [
	"It's no secret that Esports have exploded in recent years, but the extent of their popularity might surprise you.",
	"For the past several championships, the League of Legends world competition has drawn more viewers than the Super Bowl or NBA finals."
	],
	"movies": [
	"The Wizarding world's plants come from a real book penned in the seventeenth century by English botanist Nicholas Culpeper.",
	"The Harry Potter franchise boasts basically every British character actor in film, but it also squeezed in some British rock stars, too. In Harry Potter and the Goblet of Fire, The Weird Sisters include Pulp members Jarvis Cocker and Steve Mackey as well as Radiohead's Jonny Greenwood and Phil Selway.",
    "The Matrix Code Comes From Sushi. Those complex-looking green digits scrolling down the screen in The Matrix may look like mysterious code, but in fact they were symbols from a sushi cookbook, scanned by the movie's production designer.",
	"According to the book The Making of Star Wars by J.W. Rinzler, George Lucas originally planned for Yoda to be played by an adorable monkey wearing a mask and carrying a cane."
	],
	"sports": [
	"Tom Brady is one of the best players in NFL history.",
	"Tom Brady has more Super Bowl appearances than any other player in NFL history.",
	"The first basketball “hoops” were actually peach baskets and the first backboards were made of wire.",
	"The Ancient Greeks prepared their young men for war by doing gymnastics.",
	"The New York Yankees have won 26 World Series titles, which is more than any other team."
	],
	"science": [
	"A baseball diamond is a perfect rhombus.",
	"In 1942 the famous science fiction writer Isaac Asimov first formulated 'Three basic laws of robotics' in his work 'Runaround'.",
	"Every star you see in the night sky is bigger and brighter than our sun.",
	"There are no green stars.",
	"The Moon always shows Earth the same face.",
	"The Moon's surface is actually dark.",
	"The Moon is drifting away from the Earth."
	],
	"emotions": [
	"Emotions are electrochemical signals that flow through us in an unending cycle.",
	"Emotions function to guide us to survive and thrive.",
	"Humans have 43 facial muscles expressing the whole spectrum of emotions."
	],
	"relationships": [
	"Couples' heartbeats synchronize."
	],
	"music": [
	"Your heartbeat syncs to the rhythm of the music.",
	"The British rock band Queen members appeared on the British £5 coin issued in January 2020.",
	"The Queen’s hit song Bohemian Rhapsody is the most-streamed song from the 20th century.",
	"Leo Fender, the founder of the iconic electric guitar and bass brand and Rock and Roll Hall of Fame inductee, never learned to play either instrument.",
	"Metallica is the first and only band to play on all seven continents."
	],
	"food": [
	"Raspberries are a member of the rose family.",
	"Broccoli contains more protein than steak.",
	"Apples give you more energy than coffee.",
	"Pistachios are actually fruits: technically, they are fleshy tree fruits that contains a shell-covered seed."
	],
	"weather": [
	"Sandstorms can swallow up entire cities.",
	"Raindrops can be the size of a housefly and fall at more than 30kilometers per hour.",
	"Some frogs get noisier just before it rains."
	],
	"activities": [
	"Tree shaping is a very cool hobby in which you train living trees and other woody plants into artistic shapes or useful structures.",
	"Competitive duck herding is a hobby where you learn to herd duck like you would sheep.",
	"Leonardo Da Vinci is credited with writing the first resume."
	],
	"celebrities": [
	"Harry Styles and Justin Bieber can both juggle.",
	"Daniel Craig was the first actor to play James Bond, who was born after the series began in 1962.",
	"Angelina Jolie performed her own stunts whilst filming Lara Croft: Tomb Raider."
	],
	"children": [
	"LEGO comes from the Danish word leg godt meaning 'play well'.",
	"During the Christmas season almost 28 LEGO sets are sold each second.",
	"On average there are 80 LEGO bricks for every person on earth."
	],
	"travel": [
	"The number of lakes in Canada is bigger than the rest of the lakes on the planet combined.",
	"The Eiffel Tower is the daily work place of 600 Parisians.",
	"Science has proved that jet lag feels worse if you travel from west to east."
	],
	"art": [
	"Learning and practicing art leads to higher achievement in reading and maths.",
	"Many Roman statues were made with detachable heads; if the person it represented became unpopular or even just forgotten, or if some new magnate took a fancy to your statue's body, it was more likely to be re-headed than destroyed."
	],
	"men": [
	"60 million cars are produced every year.",
	"Beer is the third-most popular drink on Earth, after water and tea."
	],
	"jokes": [
	"The entire world's population could fit inside Los Angeles."
	],
	"France": [
	"French toast and French fries were not actually made in France! French fries were actually introduced to the American soldiers during World War one by Belgian soldiers who spoke French. As such, the Americans called them French Fries. As for French toast, it can be traced back to being in existence during the Roman Empire."
	]
}