{
  "Afghanistan": [
    "Afghanistan is a newly created democracy. Under the new constitution of the country, the President & two Vice Presidents are elected every five years. The International Security Force Assistance assists the government in maintaining peace & rebuilding the country. However, there still are issues with the Taliban and internal security",
    "Afghanistan is considered one of the least developed countries and also one of the world's poorest owing to the years of war & being short of foreign investments. With a GDP of about $29 billion, Afghanistan has an exchange rate of $18 billion, with about $1 thousands as the GDP per capita",
    "Most of the times, Afghanistan is ranked at the bottom in the list of Human Development Index",
    "According to reports, only 28.1% of the entire population over the age of 15 is educated in Afghanistan which means that about 71.9% of adults are incompetent of even the basic reading & writing skills"
  ],
  "Argentina": [
    "Argentina is the eighth largest country in the World, second Largest in Latin America and Largest Spanish speaking country by Area. It posses 2 thousands thousands square km area.",
    "The word \"Argentina\" is named after comes from the Latin word for silver, argentum. The original European settlers believed the country was full of silver.",
    "Every country does not celebrate Friends day but Argentina. In the early 1970s, an Argentinian scholar founded Dia del Amigo after he felt connected to everyone on the planet when Apollo 11 landed on the moon. Friend's Day is an official holiday in Buenos Aires, although it is not a national public holiday. Friends gather, parties are held, and everyone gets together late at night to celebrate friendship on July 20th of every year.",
    "Argentina is the first country to create very first animated film in 1917. This film was created by Argentine Quirino Cristiani. The film was 70 minutes long and had over 58 thousands frames.",
    "Argentina is said to have the highest infidelity rate in all of South America. Divorce has been legal in the country since 1987, and now the country has the highest divorce rate also.",
    "Canada was the first county in Americas to legalize same-sex marriage in 1999. A decade later Argentina followed this. Argentina became the first country after legalizing this law on July 22, 2010.",
    "The hottest and coldest temperatures in South America have been recorded in Argentina. On June 6, 1907, Sarmiento a small town of Patagonia recorded a temperature of -32.8 degrees Celsius (-27 Fahrenheit). Thirteen years later, Villa de Maria in the Cordova province experienced the highest recorded temperature in South America on January 2, 1920. The thermometer reached a sweltering 49.1 degrees Celsius (120.4 Fahrenheit)."
  ],
  "Australia": [
    "Very few people know the unique and proud story of the Australian Flag. The Flag engulfs the pragmatic Australian culture and its remarkable history. Besides being the only National Flag to fly over the entire continent, there is a lot to know about the Australian Flag and its unique chronology. Here are some interesting facts about the Australian Flag worth knowin",
    "The Australian Flag is considered the first and the only flag to be chosen in an open public competition",
    "Guidelines for flying the Australian Flag are laid down in the 1953 Flags Act. The guidelines say that it should be treated with dignity and respect and as the nation's most important National Symbol. According to the guidelines, while in the Australian territory, it should be flown in a superior position to other flags. The flag must be flown on all government buildings in Australia and should always be flown aloft and free",
    "The design of Australian flag is a compilation of three different thing",
    "The proclamation of the Australian Flag as a National Flag was made under The Flags Act of 1953",
    "Not to forget that the Australian national flag is not only the one chosen through an open public competition but also the only national flag to fly over an entire continent"
  ],
  "Bangladesh": [
    "Textile work of the Bangladesh earns it a huge amount of money per year. The principal source of foreign exchange earnings in the Country is the Textile Industry. After China, currently, Bangladesh is the second largest ready-made garments (RMG) manufacturer. By the next five years, Bangladesh will become the largest ready-made garments manufacturer.",
    "There are over 158 million people living in a country roughly the size of Iowa, making Bangladesh the 7th most populous country in the world and the most densely populated.",
    "Bangladesh has been at the receiving end of one of the world's worst natural disasters. A cyclone hit the country in the year 1970. It is reported that 300 thousands to 500 thousands people were killed in the natural disaster."
  ],
  "Bhutan": [
    "Well! The name Bhutan is derived from a Sanskrit word \"Bhota-anta,\" which connotes \"End of Tibet.",
    "In Bhutanese manners, you should refuse food whenever it's offered to you. The tradition is to say the words \"Meshu Meshu\" and cover your mouth with your hands. You can give in, though, after two or three offers"
  ],
  "China": [
    "China is the third largest country in the world after Russia and Canada. It has the area of 9 thousands thousands Square km.",
    "China is called the Flowery Kingdom too due to its abundance of Flowers and Fruits.",
    "The modern word \"China\" most likely derives from the name of the Qin (pronounced \"chin\") dynasty.",
    "The Known record of the invention of Ice-Cream is in China. It is said around 200 BC Chinese used a frozen mixture of milk and rice. That was the ice-cream of that time.",
    "China is the World's largest Economy in PPP (Purchasing Power Parity). Its GDP is valued at US$20 trillion approximately. China surpassed the USA in GDP in 2014.",
    "Facebook is blocked in China. Despite getting blocked, there are 95 million users of it in China. Not only Facebook, Twitter, New York Times are also Blocked."
  ],
  "Denmark": [
    "Eco-friendly Denmark hails visitors with everything from a sophistication, food-loving city in Copenhagen to Renaissance castles, wind-swept offshore islands and tiny fishing villages. This tiny country is filled with magnificent fountains and statues that bear witness to a remarkable past; regal rooms in majestic castles; centuries-old houses lining tranquil canals; a park that is the stuff of fairy tales, with twinkling lights and exotic buildings; and everywhere, people on bicycles, at sidewalk cafes, and in sailboats. Let us know some intriguing facts about this gorgeous land of Danes, Denmark",
    "Denmark is the least corrupt country in the world. In Corruption Perceptions Index, Denmark ranked first out of 178 countries with score 91 in 2015.",
    "Average every second day in Denmark is rainy. Denmark has an average of 179 days per year with precipitation, on average receiving a total of 765 millimetres (30 in) per year; autumn is the wettest season and spring the driest. The position between a continent and an ocean means that weather often changes.",
    "Denmark is the World's happiest country as per World's happiness report 2016. Denmark has good GDP per capita, healthy life expectancy, people are very generous and people in Denmark get more freedom to make life choices.",
    "Denmark is one of the most coffee consuming countries in the world. 5.3 kg coffee is consumed per capita each year. It makes Denmark one of the most coffee consuming Nations.",
    "Same-sex sexual activity was legitimated in 1933, and since 1977, the age of consent is 15, regardless of sexual orientation. Denmark was the first country in the world to grant legal recognition to same-sex unions, in the form of \"registered partnerships\", in 1989. However the Same-Sex marriage law came into effect on 15 June 2012."
  ],
  "Ethiopia": [
    "Once on the southern part of the Ethiopian Highlands, there was a kingdom named the Kingdom of Kaffa a medieval-early modern state, whence the coffee plant was exported to the Arabian Peninsula. The land is very fertile, capable of three harvests a year.",
    "The Ethiopian Highlands began to rise 75 million years ago, as magma from the Earth's mantle uplifted a broad dome of the ancient rocks of the Arabian-Nubian Shield.",
    "The cultivation of coffee, Ethiopia's main export, and teff, an endemic grain runs on a large scale. This is causing several land problems such as droughts and soil erosion.",
    "The Ethiopian Highlands home, Ethiopia, is the only country in Africa never to have been colonized.",
    "The popular saying \"Ethiopia-13 Months of Sunshine\" is derived from Ethiopia's all year round mild climate with a lot of warm sunshine and a calendar system that has 13 months. With approximately 850 mm (34inches) of rainfall, the countrywide average annual rainfall is moderate.",
    "Ethiopian Highlands are suffering from deforestation, drought, and soil degradation which have caused crop failures and famine during the past few decades; seven million people face starvation."
  ],
  "France": [
    "France, the land of people, the l'hexagone, the country of rich culture and art, is a unitary sovereign comprising the parts in Western Europe. France is the biggest country by size in Europe at 643 thousands km sq., which includes the islands of French Guiana, Guadeloupe, Martinique, Mayotte, and Réunion Island. From having some of the world's oldest buildings to world's oldest human being, France is pretty astonishing in itself! Let us read more about it",
    "The two-piece bikini as we know it now, was invented in France in 1946 and was almost called atome (atom"
  ],
  "Georgia": [
    "Georgia, the last of original 13 colonies, was named after King George of the Great Britain. It was one of the seven Confederate States and joined the Union on 15th July 1870. Largely known as the Empire state of the south or the peach state, Georgia has several interesting and awe-inspiring hidden aspects. Let's dig up some interesting facts about Georgi",
    "The state of Georgia is known for some of its \"firsts,\" like hosting the first gold rush in the U.S. and being the first largest state east of the Mississippi River. Besides, Georgia was the last of the original thirteen English colonies",
    "In May 1886, John Pemberton, a Confederate Colonel, formulated Coca-Cola at a drugstore in Columbus, Georgia. At present, the headquarter of Coca-Cola is in Atlanta, the Capital of Georgia",
    "Six Flags over Georgia is a popular theme park which as a matter of fact named for six flags that flew over Georgia. The flags of Spain, Liberty, Georgia, England, Confederate States of America and the United States of America",
    "Watermelons are native to Georgia, with Cordele being the watermelon capital of the world. Add in the state's fruit- peach, and you'll know the reason why Georgia is one of the sweetest, juiciest states in the world"
  ],
  "Ghana": [
    "Ghana stands for \"Warrior King\" in the Soninke language.",
    "The British colony of the Gold Coast and the Togoland trust territory lead to the formation of the nation, Ghana in the year 1957. Ghana became the first colonial nation in the sub-Saharan countries of Africa to gain its independence.",
    "The Ghana Empire was built on trade in salt and gold, which is why British merchants later called it the Gold Coast.",
    "Ghana is known as one of the more stable democratic countries in West Africa since it has become a multi-party democracy in the year 1992.",
    "Ghana is Africa's second-largest producer of Gold. The Ghanaians are big exporters of gold with Ghanaian gold bars and other Ghanaian natural minerals. In 2016, it produced 90 metric ton gold, ranked 11th in the world.",
    "Ghana was ranked as Africa's most peaceful country by the Global Peace Index."
  ],
  "Greece": [
    "Nowadays most of the countries follow democracy. Greece is the birthplace of democracy, not only democracy it is the birthplace of Western Philosophy, History, Political Science, Western literature, major mathematical principles, and Western theories of tragedy and comedy.",
    "In Greece, the dead are always buried because the Greek Orthodox Church forbids cremation. Five years after a burial, the body is exhumed and the bones are first washed with wine and then placed in an Ossuary (a container or room in which the bones of dead people are placed). This is done in part to relieve the shortage of land in Greek cemeteries.",
    "Greece has one of the lowest divorce rates in the EU. Greece traditionally also has the highest abortion rates."
  ],
  "Guinea": [
    "Well, don't just go on the name. Guinea pigs are not really pigs, and they do not come from Guinea. They originally come from Andes Mountains of South America. They are tailless rodents with stout bodies",
    "Guinea pigs cannot make their own Vitamin C. Therefore; they need to get it supplemented into their diet",
    "Guinea pigs have a small triangular mouth, which contains 20 teeth. Unlike other rodents, they keep on growing teeth continuously for which they need to chew or gnaw constantly from growing them too long",
    "Guinea pigs have the ability to build social relationships with humans and other animals",
    "Guinea pigs are quite an intelligent animal and love to seek its owner attention by making sounds and whistling",
    "Guinea pigs don't really like to sleep for long hours. Instead, they take short naps throughout the day and night",
    "Guinea pigs like to purr like a cat when they are happy especially when they are held and loved. They also whistle when they see their food. Now, this is adorable"
  ],
  "India": [
    "It is unthinkable not to be staggered by the word India. It is known for its rich blend of art and culture. Settled within Southern Asia, India's head is roofed by the mighty Himalayas, one hand ends on the Arabian Sea, the opposite on the Bay of Bengal, feet extends up to the Indian Ocean, heart covers the Vindhyachal Mountain and the nerves are rivers like Ganga, Yamuna, and Kaveri. Let's explore some interesting facts about Indi",
    "Be it attributable to secular, non-secular reasons or personal selections or each, around 1/3 of Indians are vegetarians, creating it the most important vegan-friendly place in the world. KFC & McDonald's also have a vegetarian menu in their outlets in India",
    "A study shows that India was once a continent around 100 million years ago when dinosaurs ruled the planet earth. It had burst far away from associate ancient supercontinent cited as Gondwanaland, and was moving slowly within the northward. But with continental drifting, it'll become an island in some million years",
    "A bitter indisputable fact that will not surprise those who are familiar with Indian roads and traffic sense. Around 1,37 thousands people died on Indian roads alone in 2013. Numerous awareness campaigns and initiatives have been taken by the government, NGO's and media, however, the rising road accident rate appears to be unconcerned",
    "As a rich agricultural nation, India is the leading producer of fruits (41.5 metric ton), sugarcane (295.73 metric ton) and coconut (13 billion nuts). India alone has around 1/2 of the buffaloes in the world (8.42 million) and therefore, it's also among the world's leading milk producers",
    "Indian Economy is one of the fastest growing economies in the world. Thanks to its demographic dividend (young population), controlled dependency ratio, and economic liberalization since 1991",
    "Derived from a Sanskrit language word \"Chaturanga,\" which implies quad associates of military personnel, is believed to be fabricated in northern India in the 6th century and due to its massive acceptance, it reached all over the world",
    "Let's give you a tipsy fact! It might be hard to believe, but, it's a fact that about half of the world's whiskey consumption happens in India, which is around about 1.5 billion liters every year",
    "India was the only Diamond producing country in the world until 1896",
    "Martial Arts were originated in India. Later, Buddhist missionaries spread it to the rest of Asia",
    "Located in Northern Kashmir, the Siachen Glacier is regarded as the world's highest battlefield. Situated at altitudes that range from 13 thousands-22 thousands ft (4 thousands-6 thousands m), the area is claimed by both India and Pakistan, and the two rival nations have thousands of soldiers stationed there. However, death mostly comes from freezing temperatures, falls into crevasses or from being swept away by avalanches"
  ],
  "Indonesia": [
    "Indonesia, the name of the country itself is quite interesting as it is made up of two different words from two different languages. Indonesia is a combination of Latin word 'Indus' which means Indian and Greek word 'nesos' which means Island. Let's learn some more interesting facts about this diverse archipelago of Islan",
    "Indonesia is composed of more a huge number of islands; basically there are more than 17000 islands and about 6000 of them are inhibited by people. That's why Indonesia had gained the status of being the largest archipelago in the world. The most surprising fact about these islands is that about half of these islands are still unnamed. So, if you ever plan on disappearing you can just go to one of these no-name islands and your address will be: one of the 8 thousands no named island",
    "When people of so many different tribes and religion coexist in a single country then their motto must be \"Unity in Diversity\" and it is actually the motto of Indonesia",
    "To most people the word Java is synonymous to the computer programming language JAVA. But Java is also the name of one of the island of Indonesia. This island is so popular for its coffee beans that Java became a slang term for Coffee",
    "One earthquake makes fear creep in our heart. Imagine the plight of people who faces around 4 earthquakes every day. No, it is not a joke. Indonesia contains about 400 volcanoes all over the country out of which about 150 are active and hence faces so many earthquakes"
  ],
  "Israel": [
    "Israel is the largest Jewish state in the world. Israel has largest population for Jewish people of over six million.",
    "Israel is situated at the lowest point on the surface of the Planet. The Dead Sea is located 1 thousands feet below sea level and is also one of the saltiest bodies of water.",
    "Israel is the one of the most controversial countries in the world. Israel has several conflicts with Palestine over land.",
    "Israel has the third highest rate of entrepreneurship in the world.",
    "Israel has over 3000 hi-tech companies. Israel has the highest concentration of hi-tech companies in the world (apart from the Silicon Valley).",
    "Israel has been the hub of some of the major technological advances in recent years, incorporating: the development for the very first cell phone was believed to have been done in Israel by Motorola (which has its largest development center in Israel), most of the Windows NT operating systems were developed by Microsoft-Israel, the Pentium MMX Chip technology was designed in Israel at Intel, and voice mail technology was also developed in Israel.",
    "Most of the population in Israel contains Computers at home. This country has one of the highest percentage of home computers in the World."
  ],
  "Italy": [
    "Italy is quite exquisite when it comes to the architecture and culture. Often referred to as \"lo Stivale\" (the boot), it is a unitary parliamentary republic in Europe. The place is quite fascinating with its picturesque monuments and gardens. In order to really know what's inside, keep the following facts in mind about this boot-shaped countr"
  ],
  "Japan": [
    "Japan is an archipelago; consisting of 6852 islands out of which only 430 islands are inhabited, and most popular ones are- Honshu, Hokkaido, Shikoku, and Kyushu; consisting of cities like Tokyo, Yokohama, Osaka, and Kobe",
    "In Okinawa, there are currently hundreds of residents who are over the age of 100 years. As of 2017, there were over 2 million residents in Japan with the age of 90 or more. As per a report of 2018, the life expectancy in Japan is 84.2 years",
    "According to a poll, on average, Japanese workers get 6 hours and 22 minutes sleep on the work night; lesser than any other country. Concerning the health of their employees, companies in Japan allow their employees to have power naps during work hours for better work performance and also to overcome the challenge of afternoon dozing",
    "The islands of Japan lay on the Pacific Ring of Fire, where lots of crust movements take place underneath; resulting in almost 1500 earthquakes each year, and minor aftershocks are felt on a daily basis. The intensity of deadly earthquakes can reach up to 9.0 magnitude",
    "As per recent reports, Japanese men and women shy away from getting married. The reasons are multiple- lack of job security, insufficient financial resources to support a wife and family, punishing work schedules; all these limit the opportunities to interact with the opposite sex",
    "Japan is one of the most global per capita fish consuming countries in the world. Fish forms a large part of their diet and is perhaps the secret behind their longer life expectancy",
    "If you are a sushi lover, then you owe a big one to Japan as Sushi was originated in Japan. The origin dates back to the 8th century, but it was not until the 1900s that sushi started spreading in the west and the whole world",
    "Magna is the Japanese style comic series and every year almost 2 billion copies are sold. Ever since the publishing of Magna began, its popularity grew immensely irrespective of the age and gender. Magna contains varied content which may be historical, futuristic sci-fi or teenage romance. The comic series has become so popular that there are Magna cafes and events inspired by Magna",
    "According to the recent statistics, Japan recorded a drop in the crime rate. As of 2017, the number of crimes recorded was only 915 thousands which was over 2 million back in the 2000s. The credit goes to the use of security cameras and harsh criminal justice practices. A suspect can be held for up to 23 days for interrogation without any charges",
    "In Japan, cleaning your classroom and school is a part of the school education. Students at a very young age are taught to clean their class, serve lunch and even clean toilets. Some may refer this to as child abuse, but Japan considers it a healthy practice which will make the child more responsible",
    "Japan never fails to surprise. To get away from loneliness and stress, one can go to Soine Ya (Cuddle Cafes) and pay a hefty price of 3000 Yen ($30) for 20 minutes of companionship",
    "Chopsticks are not the only way to eat food in Japan. Here are some Japanese dining etiquette",
    "It is forbidden for someone with tattoos to take bathe in hot springs and Onsen because in Japanese culture tattoos are related to punishment",
    "Aokigahara Forest also known as the Sea of Trees, right along the edge of Mt. Fuji, is the most popular suicide destination in Japan. This eerie forest gained the notorious reputation of the Suicide Forest as there were more than 100 suicides in the year of 2013-2015",
    "Japan is known for the most significant things in the world and never fails to surprise the tourists. To keep up to its reputation, Japan surprisingly holds the record for World's Shortest Escalator which is located at the basement level of the More's Department store, Kawasaki. The height of this record-holding escalator is 89.4 cm or 2.7 feet which is equivalent to a 2-year-old girl",
    "Japanese metro trains are impressively on schedule. The secret behind their success is that they count time to centisecond, i.e. one-hundredth of a second. So you need to find some other excuse in case you get late to work",
    "Japan recently made headlines with state of the art Maglev (Magnetic Levitation) train breaking the record for world's fastest train with the speed of 600 km/h"
  ],
  "Kenya": [
    "Kenya has its roots originated from the word Kikuyu and Kamba which mean Mount Kenya. The Republic of Kenya is named after Mount Kenya. While in Russia, the word Kenya stands for harmless and innocent.",
    "Kenya was also a British colony for more than 65 years. The colonial rule began with the arrival of the British East Africa Company in 1888. It got Independence in 1963.",
    "Kenyans were tortured by slavery in the ancient times. They were kidnapped and made slaves by Arabs, Europeans, and Americans. This cruel tradition was later abolished by most countries. Several Kenyan people were taken away to other countries safely then.",
    "Lake Turkana is located in the desert of northern Kenya. Scientists discovered a mummy i.e., a trace of humankind's earliest ancestors there. This mummy was a fossil known as Kenya Man and is known to be some 3 million years old.",
    "There is this place in the Machakos city in Kenya where you would find the things going upward against the flow of gravity. It's a miraculous place on the earth which defies gravity a little."
  ],
  "Malaysia": [
    "Located partly on the Asian mainland and partly on the Northern Island of Borneo, Malaysia is truly Asia. It is one of the wealthiest countries in Southeast Asia with investments in technology industries and reasonable oil wealth. From sky gazing skyscrapers to exotic wildlife, Malaysia is sure to mesmerize you. Here we present some interesting facts about Malaysia worth knowin",
    "Malaysia is the only country in the world with its territory on both the mainland of Asia and the islands that form the Malay Archipelago. Yes, that's correct",
    "Tun is the most senior federal title in Malaysia, and there can only be 35 local living Malaysian recipients of the title at any one time",
    "Malaysia has nine different Royal Families, the highest in the world. Yang di-Pertuan Agong (The Malaysian King) is elected from these nine royal families to be the Head of State for a 5-year term",
    "The ultimate sunken treasure trove lies in the remains of Flor de la mar at the seabed of Malaysia's Strait of Malacca. The Portuguese ship headed by Admiral Afonso de Albuquerque is said to the richest ship ever lost in the sea with its holds loaded with around 200 coffers of gold, precious stones and diamonds"
  ],
  "Mexico": [
    "Mexico is a country between the U.S. and Central America and is known for its Pacific and Gulf of Mexico beaches and its sundry landscape of mountains, deserts and jungles. Guacamole, Quesadillas, Tacos, Enchiladas!!! One shall not forget the mouth watering Mexican dishes which is popular worldwide. Let's dig deeper into the Mexican world to know about this exuberant country a little mor"
  ],
  "Morocco": [],
  "Namibia": [
    "Namibia was a colony of Germany formerly. The people of the country hurled a guerrilla war for independence in the year 1966 but did not gain independence until 1990.",
    "Namibia is the second least densely populated country on earth. It has a population of 2.1 million people only.",
    "Namibia was the first country to sign a statement that included the protection of the environment into the country's constitution. It's a proud fact!"
  ],
  "Nepal": [
    "You are about to get stunned, Nepali is not the only language spoken in this ethnic hub, in fact, 123 languages are spoken in this geographically small country. Its closeness to Tibet, India, and China for centuries gave birth to many colloquial languages",
    "It's difficult for folks from developed countries to believe that load-shedding in Nepal can last for as long as 16 hours every day. Surprisingly people here are accustomed to such living, and they deal with it by following the Blackout schedule to take care of their daily activities. Well, such is life",
    "Forget about 3G or 4G Nepal doesn't even have 2G. Nepal has world's slowest internet. People still rely on cybercafes for their internet needs",
    "Nepal also recorded many of its top of the world records in Guinness Book. They are world's shortest person, longest handshake, youngest photographer, highest mobile phone call and much more",
    "In the past few days the constitution of Nepal has been a subject for a lot of negative news; still, the country managed to leave behind the rest of the world in a groundbreaking move by becoming the first ever Asian country to have explicit laws benefiting the LGBT community. While most of the progressive Western countries have legalized same-sex marriage, none provides for full anti-discrimination legislation in their constitutions. Nepal is now the 3rd country in the world after South Africa and Ecuador to have non-discriminatory laws for LGBT community"
  ],
  "Netherlands": [
    "The Netherlands comes at the top in the world for having the most, nutritious, healthy and affordable food among 125 countries in an Oxfam report. The country is hence, known as the \"healthiest country.\"",
    "The local citizens of Netherlands take their own bags to the supermarket before buying their groceries. In case you head to the Netherlands, make sure you go there don't forget to take your carry bag with you."
  ],
  "Pakistan": [
    "In Persian and Urdu, the word 'Pakistan' means, \"the land of Pure\". In Persian and Pashto, the word pak meaning pure while the suffix -stan is a Persian word meaning place of, cognate with the Sanskrit word sthana.",
    "Indus Valley Civilization was one of the oldest and prosperous civilization. It prospered along the basin of Indus River from 3300 BCE until 1300 BCE. Harappa, Moenjo Daro, Taxila, Mehr Garh, Kot Diji, Takht Bhai, Juniper Shaft cave, the Murghagull Gharra cave and Mughall saa cave are major archaeological sites in Pakistan."
  ],
  "Peru": [
    "The city of Machu Picchu was voted in 2007 as one of the New Seven Wonders of the world. The lost city is an important landmark in Peru. It remained undiscovered for about 400 years.",
    "Peruvian restaurants have a very typical dish here and that is Cuy or Guinea Pig. It is a traditional dish in Peru."
  ],
  "Poland": [
    "The Name 'Poland' is derived from a West Slavic tribe of Polans (Polanie) that inhabited the basin of Warta river, the historic Greater Poland region in the 8th century. The origin of the name Polanie itself derives from the western Slavic word pole that means field.",
    "In the history the first Polish ruler recorded was Mieszko, about A.D. 963. In 966, Mieszko adopted Christianity, making Poland the easternmost country within the orbit of Latin culture.",
    "Poland is the country of Nicolaus Copernicus and Johannes Hevelius. Nicolaus Copernicus was the first person to propose that the Earth is not the centre of the Universe and Johannes Hevelius was the first person to publish the first exact map of the Moon.",
    "Polish Diaspora is one of the largest Diaspora in the World. Around 20 million people of Polish ancestry living outside Poland. Most of the people of polish ancestry living in United States, Germany, France, Canada, UK etc. About 10 million polish are living in US, 2.5 million in Germany.",
    "First Constitution in Europe was taken accepted in Polish-Lithuanian Commonwealth, a dual monarchy comprising Poland and Lithuania. The constitution of Polish-Lithuanian Commonwealth was the first in Europe, and second in the World.",
    "Poland is the world's biggest Amber Exporter in the World. Amber is fossilized tree resin, which has been appreciated for its color and natural beauty since Neolithic times. Amber is used as an ingredient in perfumes, as a healing agent in folk medicine, and as jewelry.",
    "Poland has been invaded and fought for independence 43 times in insurrection from 1600 until 1945, long time period for independence."
  ],
  "Russia": [
    "Covering more than one eighth land of the Earth, Russia is the biggest country of the world. Authors (Tolstoy, Dostoyevsky and Pushkin), Traditional Food (Borscht, Blini, stroganoff, Black Bread), Architectural wonders (Saint Basil's Cathedral, Moscow Kremlin, Winter Palace, Hermitage Museum) reminds of just one name: RUSSIA! Also, back in 1939, Winston Churchill famously remarked that Russia was \"a riddle wrapped in a mystery inside an enigma.\" Quite positively, this still holds true for some people. Let's have a deeper look at the country founded by Viking Rurik in 86",
    "Russia sold Alaska to USA for just $7.2 million which, about $2.5 million less than what Real Madrid paid for Cristiano Ronaldo",
    "\"There are over 500 thousands alcohol-related deaths in Russia every year.\" An average Russian drinks about 4.8 gallons of alcohol per year which two times what doctor think is dangerous for you and four times more than an average American Cheer",
    "An extremely popular Russian meal called \"kholodets,\" is comprised of meat suspended in salty gelati",
    "In 1908, the Russian Olympic Team arrived 12 days late since it was still following the Julian calenda",
    "You can find a pickled version of almost every vegetable in Russia. That's wickedly impressiv",
    "Vodka is derived from the word \"Voda\", which is Russian for \"Water",
    "Russia is voted for the title since the children at schools are taught not to smile in school. Furthermore, people do not smile at the passer by(s). (It is considered rude!",
    "It is quite a fact that many wealthy Russians hire an ambulance in case of a hefty traffi",
    "A Russian drinks about 3.051 pounds of tea annually, compared with 0.503 pounds in the U.",
    "Russia used to have 11 time zones but it cut that down to nine in 2010. \"The less fractional division of the country will enable us to resolve a number of transport and communications issues, will increase its manageability and strengthen the position of Russia as an important chain in the world's global infrastructure,\" President Dmitry Medvede",
    "There exists a town in Russia with an average temperature of -50 degrees Fahrenheit, and a current sunrise time of 2pm and a sunset time of 3.30p"
  ],
  "Singapore": [
    "Located at the end of Malayan Peninsula between Indonesia and Malaysia, Singapore is an island City-State in Southeast Asia. Spreading across a land area of more than 714 square kilometers, Singapore is a beautiful and one of the most developed countries in Southeast Asia. Singapore has four official languages- English, Malay, Mandarin, and Tamil. Here are some interesting facts about Singapore that are sure to amuse yo",
    "Singapore is also known as \"Land of Acronyms.\" Whether it is a Highway, government agencies, skyscrapers, transportation modes or even the name of a human being (LKY - Lee Kuan Yew, First prime minister of Singapore) have acronyms. Some usual acronyms are MOE - Ministry of Education, SBS - Singapore Bus Service, MRT - Mass Rapid Transit, CTE - Central Expressway and GST - Goods and Services Tax",
    "Yes, you heard it right! If you ever manage to get a $1000 note (which is not readily available) turn it over and you will find micro text lyrics of the Singaporean national anthem. It's amazing",
    "Singapore comes on TOP in the list of countries having ease of doing business worldwide. It has been ranked no.1 successively for 7 years by the World Bank. Singapore is first in the world to have the best protection of intellectual property. It is also ranked as the 3rd most competitive country in the world"
  ],
  "Spain": [
    "There are no laws against public nudity in Spain"
  ],
  "Switzerland": [
    "People of Switzerland can gather 50 thousands signatures against any inappropriate law within 100 days. National voting occurs whether to accept the law or to reject it.",
    "Swiss have the second highest life expectancy in the world after Japan. In Switzerland, the life expectancy for both sexes is 83.4. Swiss Males ranks first in life expectancy but females at six.",
    "Switzerland is one of the most secure places in the World. Most surveys put Switzerland at the lowest crime level. Switzerland has 216 policemen on duty per 100 thousands people, ensuring harmony, tranquility, and peace at all times.",
    "Switzerland has four official and national languages; German, French, Italian and Romansh. German accounts for 61% of the population, French accounts for 22% of the total population, 8% population speaks Italian, and Rest of the population speaks Romansh and other European languages. English is getting popular in Switzerland.",
    "About one fourth of the population is of foreign descent. Predominantly Immigrants are coming from Portugal, Spain, Turkey and some Islamic Country. To curb the immigration into Switzerland, Swiss voters narrowly passed through a controversial anti-immigration initiative. It aims to impose limits on the number of foreigners allowed into Switzerland and may signal an end to the country's free movement accord with the European Union.",
    "As per consistently high rankings in global reports in 2015, Switzerland was ranked the world's happiest country, and came second in 2016 (after Denmark) out of 156 countries."
  ],
  "Syria": [
    "Home to diverse religious and ethnic groups and situated in the heart of the Middle East in Southwest Asia, Syria is currently facing its biggest turmoil in the form of Civil War. Besides being a war-torn country, Syria has many other aspects to be explored. Here are some interesting and lesser known facts about Syri",
    "Syria has a long chronology of invasion. It was 1st invaded by the Egyptians in 1500 B.C., followed by Hebrews, Assyrians and Persians. After that, it became a part of the Roman Empire, followed by the Ottoman Empire. France was given control over Syria after the World War I.",
    "In 2000, Mahmoud Zuabi (the then Prime Minister of Syria) shot himself when police arrived to arrest him on corruption charges and in 2005, Ghazi Kanaan (the then Interior Minister of Syria) also shot himself in mysterious circumstances."
  ],
  "Thailand": [
    "\"Land of the Free\" is appropriate because Thailand is the only country in Southeast Asia that has never been colonized by a foreign power.",
    "Thailand has over 1 thousands islands within its territory. Phuket is the largest Island in the country.",
    "Blue Diamond Affair is the series of unresolved crimes caused by the 1989 theft of gems belonging to the House of Saud by a Thai employee. Because of this, the relationship deteriorated between Saudi Arabia and Thailand. That's why Saudi Arabia does not issue working visas for Thais and discourages its citizens from visiting the country.",
    "It is forbidden to touch a local on the head - it's best to lower your head - even to a child - in Thailand!. Thais believe that head is the most revered part of the body so it should not be touched."
  ],
  "Turkey": [
    "Turkey, which got its name from the ethnonym \"Turk\" and the first usage has been recorded in the Turkic Inscriptions. Although, the English name \"Turkey\" was first used in the late fourteen century. Turkey is the sixth most popular tourist destination in the world and so it is rather necessary to know some interesting facts about this beautiful countr"
  ],
  "Zimbabwe": [
    "Zimbabwe has the highest literacy rate in Africa. 90% of the population in Zimbabwe is educated.",
    "The Zimbabwe dollar was abandoned as its national currency in 2009 after hyperinflation caused an inflation rate of 79.6 billion percent. It is also the only country to have 8 official currencies. They are US Dollars, South African Rand, Botswanan Pula, British Pound Sterling, Australian Dollars, Chinese Yuan, Indian Rupees and Japanese Yen. It is shocking that none of these currencies is exclusive to Zimbabwe.",
    "Another interesting fact about Zimbabwe is that more than half of the people in Zimbabwe are below the age of 21.",
    "Zimbabweans mostly call every kind of toothpaste \"Colgate,\" every soft drink \"Coke,\" every washing powder \"Surf\" and every floor polish \"Cobra.\" Isn't it interesting!",
    "Zimbabwe is said to be the location of Ophir, the Biblical land of which King Solomon got ivory, gold, peacocks and other precious items.",
    "The major industries in Zimbabwe consist of coal, gold, steel, cement, chemicals and wood products. It exports gold, tobacco, textiles, clothing and ferroalloys to the other countries of the world.",
    "Zimbabwe has 16 official languages; English, Chewa, Chibarwe, Kalanga, Koisan, Nambya, Ndau, Ndebele, Shangani, Shona, Sotho, Tonga, Tswana, Venda, Xhosa and sign language! This number is more than any other country in the world."
  ]
}