{
  "Dubai": [
    "In 1991, Dubai had only one tall building, but now they have over 400 skyscrapers making Dubai one of the fastest growing cities in the world",
    "Burj Khalifa in Dubai is the tallest building in the world with a height of 828 m (830 m to tip) and 163 floors. Burj Khalifa is also home to the world's highest restaurant, highest mosque, highest nightclub, and highest observatory deck",
    "Yes, you heard it right! If you live in Dubai, you don't have to pay any personal income taxes",
    "Online shopping is a hassle in Dubai as it does not have an address system. Instead of a line for writing address, there is a space to draw a map or leave instructions like - \"My house is second from the mosque.",
    "In 2013, 40% of total physical gold is traded in Dubai and it weighed around 2 thousands tons. That's equivalent to the weight of 354 elephants",
    "There are no potholes or drains in Dubai as it rains only once or twice a year and that too in the winter season. So, be prepared for flash floods on a rainy day",
    "To enjoy a drink, even at the comfort of your home you must obtain a liquor license in Dubai",
    "Now, for a surprising fact, local people, called Emiratis, are in the minority in Dubai. Emiratis are just 15% of the total population. The majority of the population is split between India, Bangladesh, Pakistan and Western countries"
  ],
  "Victoria": [
    "Also called as Mosi-oa-tuniya (The smoke that thunders), the Victoria Falls is the largest water falls in this world. It is located on Zambezi river on the borders of Zambia and Zimbabw",
    "Iron-using Khoisan hunter-gatherers displaced the Stone Age people living in the area and in turn were displaced by Bantu tribes such as the southern Tonga people known as the Batoka/Tokalea, who called the Victoria falls Shungu na mutitima. The Matabele, later arrivals, named them aManz' aThunqayo. Here are some facts that are worth knowing about these fall"
  ],
  "Mendoza": [
    "In the 15th and 16th centuries, Spaniards started to come to Argentina. On March 2, 1561, Pedro del Castillo, a Spanish Conquistador founded the city of Mendoza and named it \"Ciudad de Mendoza del Nuevo Valle de La Rioja.\" Spaniards were the first to cultivate wine in this region as well as they sowed the seeds of Mendoza's flourishing future",
    "In 2008, the National Geographic Travel Magazine listed Mendoza as one of the top ten places in the world to visit for its great food, fine wine, vineyards, landscapes, and first class restaurants",
    "As we know, it's hard to grow crops in cities with no or small amount of rainfall. Mendoza is a desert town, with a dry and humid climate and only receives 10 inches of rain every year. It is only because of the snowmelt in the Andes Mountains, which showers plenty of water for irrigation purpose. Now, this is of great advantage to the growers and for wine production"
  ],
  "Lincoln": [
    "It took more than 50 years to get a memorial fully built for Abraham Lincoln and opened to the public.",
    "The Lincoln Memorial cost $3 million to build. Congress approved funding for the memorial in 1910.",
    "French presented a bronze statue of Lincoln before this Memorial was made. The current memorial is actually the second such sculpture designed by the French."
  ],
  "Vienna": [
    "Austria's capital offers a unique blend of imperial traditions and stunning architecture. This colorful city is famous for its many cultural events, classical concerts, imperial architecture, coffee houses, cozy wine taverns, and the very special Viennese charm. Let's know some intriguing facts about this Imperial City, Vienna",
    "Vienna is the only capital in the World with a major wine production within the limits of the city. Every year in Vienna over 600 wine framers produce 2.5 million liters of wine.",
    "People of Vienna are very famous for their love for dogs. They take them almost everywhere. Dogs are welcome at public places and public transportation and in many boutiques and restaurants.",
    "Zentral Friedhof is the second largest cemetery in Europe and largest in Vienna. The sprawling burial ground has more bodies (over 2.5 million) than there are living inhabitants in Vienna. Notable interments of Zentral Friedhof include Ludwig van Beethoven, Franz Schubert, Johannes Brahms, and Johann Strauss."
  ],
  "Sydney": [
    "Sydney is the capital of the state New South Wales and has the largest population of all the cities of Australia. The settlement on the land of Sydney started in 1788, when the first batch of convicts was shipped to this penal colony as founded by the Britishers. After the transportation stopped in the mid-nineteenth century, Sydney has transformed into an advanced, developed, peaceful and a beautiful place that can actually set a convict straight with its sunny beaches, laid back lifestyle and friendly people. Sydney is a strong financial hub and has a substantial role in the world econom",
    "The area of Sydney was supposed to be named as \"New Albion\" initially, but it was changed to honor Lord Sydney for authorizing the establishment and settlement",
    "In 1957, ten students from Sydney University dressed as pirates and went on-board on an American war ship. The alarms for general quarters, atomic and chemical emergency were sounded which happened to pull the crew members from their bunks. Students were escorted back and no charges were pressed against them",
    "Each and every pipe of the Grand Organ placed in the Sydney Opera House is named. That is 10 thousands names. Phew",
    "Sydney contributes to 25 percent of Australia's total economy summing up retail, services, mining, manufacturing, finance and property. About sixty percent of all the businesses have their headquarters in Sydney",
    "The local people call the Sydney Harbour Bridge as \"The Coat Hanger\" because it looks like a coat hange",
    "Not with guns, but with cameras! Over 200 films have been shot in Sydney including Hollywood as well as Bollywood",
    "Canberra was made the capital of Australia because both Sydney and Melbourne wanted to be the capital of Australia. So, I guess they chose the middle ground to keep the underbelly stable! :",
    "The Sydney Opera House was supposed to be built at a cost of AUD 7 millions. Guess how much did it cost? Whopping AUD 102 millions",
    "Sounds perfect to me! Hosted by Sydney Opera House, eminent thinkers and culture creators are invited from all over Australia and other countries. The ethical and moral issues that are vital to our society are discussed in this festival",
    "An order of extra 20 thousands condoms was placed for the athletes in the 2000 Sydney games as they had used the initial stock of 70 thousands. Since then, the amount of order has been increased to 100 thousands",
    "Australians or residents of Sydney are often jokingly called \"convicts\" because of the convict past Britain gifted to it. Sydney is also known as \"Sin City\" because of the underbelly mafia",
    "Set by convicts, the city has seen its share of violence and blood shed. The organised crime was surprisingly organised by two women. Kate Leigh, was known as the queen of Sydney and was rivalry against Tilly Devine who had strong bad network with brothers across King Cross and Darlinghurs"
  ],
  "Orange": [
    "Oranges are good absorbents that help in digesting a variety of medicines, especially Vitamin D supplements. So, next time, while taking your Vitamin D pills, don't forget to have orange juice, otherwise, it may lead to the formation of stones in your body"
  ],
  "Melbourne": [
    "The weather of Melbourne is one of its kind. It is very common to experience all the four seasons in one day. It can be hot, pleasant, rainy and cold the very same day you woke up to and that you'll go back to sleep. A year's worth of variety in just one da",
    "Melbourne was the capital of Australia for around 26 years from 1901 to 1927 before the capital was shifted to Canberra",
    "Melbourne has the largest number of Greeks and Italians outside their own country and continent i.e. Europe",
    "Melbourne is Australia's uncrowned sports capital. It can pride itself on the development of world class infrastructure and owning five international sporting facilities. It attracts hundreds and thousands of tourists that come to watch the Grand Prix, Cricket, Tennis, Horse Racecourse, Motorcycle Grand Prix, AFL etc",
    "The Tram System of Melbourne is the best in the country, the largest outside of Europe and the 4th largest in the world! It is definitely better than Sydney's as you don't have to hold your breath to squeeze in in the peak hour",
    "Melbourne's birth name is Batmania. R.I.P. Heath Ledger! It was named after John Batman, who bought 600 thousands acres of land in association with a syndicate and wrote in his journal: \"This will be the place for a village.\" Congratulations Mr. John, it has flourished beyond your expectations",
    "It has not been too long, that in 1966, the pubs used to close at 6 PM in Melbourne. Did they ever get a drink after work",
    "In 1850.. In 1850, during the Victorian Gold Rush, Melbourne became the richest and the largest city in the world",
    "The Rain Making Control Act 1966 banned Melbournians (People who come from Melbourne) to produce rain by any unauthorized methods like seeding/nucleation of clouds with an aircraft. What kind of sorcery is this? Four seasons a day are the real ones right?",
    "UNESCO recognized Melbourne as a City of Literature Major Center for street art, music and theater. It is considered Australia's cultural capital because of all the cultural institutes and festivals held in the city",
    "The world's first gay and lesbian radio was started in Melbourne. Equality, entertainment, and good food. Is there anything that this city lacks",
    "Melbourne puts a lot of resources into education, healthcare, research and development, infrastructure, tourism and sports. It has been rated as \"The Most Liveable City\" in the world for the fifth time in a row in 2015. I wanna-de go back de Melbourne"
  ],
  "Dhaka": [],
  "Halle": [
    "Halle Berry is counted among the highest-paid actresses in Hollywood. She is a combination of talent, tenacity, and beauty hence, a former fashion model, beauty queen and also a Revlon spokeswoman. Let's explore some interesting facts about Halle Berr",
    "Halle Maria Berry was born on August 14, 1966, in Cleveland, Ohio, to Jerome Berry, an African-American hospital attendant and Judith Berry, a psychiatric nurse. She has an older sister, named Heidi Berry-Henderson. After their parents had divorced, they were raised exclusively by their mother",
    "Halle's estimated net worth is $80 million, and she also owns a lush vacation home in Canada, which is currently on the market for $1.9 million. She is among the highest paid actresses in Hollywood, with the salary around $16 million per film"
  ],
  "Po": [],
  "Leo": [
    "When it comes to paintings, the foremost name appears to be that of Mona Lisa by Leonardo da Vinci- the great Italian artist of the 15th century. However, he was not only a painter but a polymath, who influenced a broad spectrum of creative fields. Let's explore some interesting facts about this Renaissance Ma",
    "Leonardo da Vinci was left handed and used to write from right to left, which resulted in a mirror script and was difficult to read for others.",
    "Throughout his life, Leonardo da Vinci had been a strict vegetarian, which is supposed to be a by-product of his affection towards the animals.",
    "Leonardo recorded only two of his childhood incidents- one was when a kite dropped from the sky and its tail brushed his face. The second when he discovered a cave while he was exploring in the mountains and was terrified that some monsters might lurk there.",
    "Based on the work of the architect Vitruvius, Leonardo da Vinci depicted the proportions of the human body in his drawing- The Vitruvian Man. He drew this around 1490 and the drawing is supposed to be the extension of the universe in the form of human body.",
    "In the late 15th century, Leonardo da Vinci drew a mural painting- The Last Supper. It was a part of a plan to restore the churches of Milan. The mural painting depicts the scene of The Last Supper of Jesus with his twelve Disciples when Jesus announced that one of them would betray him."
  ],
  "Lom": [
    "The food in Lombok is often spicy, all thanks to the fiery chilies grown here. Naga Jolokia peppers are mixed with red and green Lombok chilies to make the fiery Sambal. Try it once if you visit Lombok but make sure you have a glass of water near you",
    "While in Jakarta people do not have an inch space on the highways and freeways, the three Gili islands of Lombok enjoys a no motor vehicle policy! Transportation mode is only pony and carts and they are so quiet that you can hear the sweet jingle of pony bells while travelling",
    "Lombok has an actual monkey forest. The name of this forest is Pusuk Monkey forest and gets its name from the numerous monkeys found there. Feeding these monkeys is allowed but they are huge thief. Only one advice while visiting this forest: Keep your bananas safe"
  ],
  "Mari": [
    "You know how marijuana provides a high? Marijuana triggers the production of dopamine and supports neurogenesis meaning it produces chemicals in the brain which makes you feel good"
  ],
  "Macau": [
    "As we said that Macau was a Portuguese colony for more than 300 years, it became the Macau Special Administrative Region of China on 20 December 1990. Macau now works on 'One country, two system formula, along with Hong Kong.' An agreement was made in which China promised that China's political and economic system would not be imposed on Macau. Macau, therefore, enjoys its freedom and autonomy.",
    "Macau has a history of funny names before the era of the Portuguese. It was known as Haojing meaning 'Oyster Mirror.' Later, it got several names such as the Jinghai meaning 'Mirror Sea.'",
    "Macau is among the world's richest regions. Macau's GDP per capita is higher than that of any country in the world, according to the World Bank.",
    "Macau has its own dialect of Portuguese which is known as \"Macanese Portuguese.\" Because it was the colony of Portugal from 1557 to 1999.",
    "Macau is a highly humid region, with the humidity ranging anywhere between 75% and 90%. Macau receives a heavy amount of rainfall every year which contributes towards a humid climate all year.",
    "There are many industries in Macau of which a few are tourism, gambling, electronics, toys, footwear, textiles, and clothing. It is also an exporter of various products such as clothing, footwear, textiles, electronics, toys, machinery and machinery parts."
  ],
  "Colombo": [
    "Colombo is the commercial capital and largest city of Sri Lanka. It is the financial center of the island and a popular tourist destination. It is located on the west coast of the island and adjacent to Sri Jayewardenepura Kotte, the legislative capital of Sri Lanka.",
    "The name \"Colombo\" was first introduced by the Portuguese in 1505. The name \"Colombo\" is believed to be derived from the classical Sinhalese name meaning \"port on the river Kelani\".",
    "One of the Sri Lanka's best-kept secrets is the shopping opportunities in Colombo - With many boutiques filled with international brands, local art and fabrics, designer clothing, shoes, and handbags, plus handicrafts, home furnishings and more. People especially visit Colombo for designer shopping."
  ],
  "London": [
    "Yes, that's true! The core London city is actually the smallest city in England covering only 1.12 square miles with a population of around 7 thousands. However, Greater London, the metropolis developed around the core city is home to around 8.5 million people and is large enough to fit in 4 New Yorks",
    "Among various silliest laws in London, one such law is that it's illegal to die in the Palace of Westminster. However, it's not clear that what the punishment would be",
    "There are more than 300 languages spoken in London currently, more than in any other city in the world. Some of the most established are- Gujarati, Bengali, Mandarin, Punjabi, Hokkien, and Cantonese",
    "The most popular tourist attraction, London Eye is a huge Ferris wheel located on the South Bank of Thames. It was the tallest Ferris wheel in the world until 2006 when Star of Nanchang surpassed it. It is still the Europe's tallest Ferris wheel",
    "Did you know that the London Underground is the world's first underground railway system and the oldest rapid transit system! It started in 1863 between Paddington and Farringdon",
    "To become a London cabbie, you have to know over 50 thousands points of interest and over 25 thousands streets in London; this is essential to pass the special test called \"The Knowledge test\" for getting a license",
    "The world famous London Bridge is the third with that name. The first one stood from 1209 to 1831 and had shops and houses. The second one was built by John Rennie and lasted until 1968. The current London Bridge was opened in 1973 and is the only bridge constructed under the City of London Corporation",
    "The world's first traffic light was installed in the year 1868 at the junction of Great George St and Bridge St near Westminster Palace in London. However, it exploded after a month and the policeman who was operating it was severely hurt",
    "There are more than a dozen of secret rivers flowing beneath London. One of them is Effra which travels under the Oval cricket ground. You could be standing inches away from one of the lost secret rivers and not even realize it"
  ],
  "Toronto": [
    "25% of Hollywood films are actually filmed in Toronto! Famous Toronto film and tv actors include Mike Myers, Eugene Levy, Jim Carrey, John Candy, Eric McCormack, Catherine O'Hara, and Howie Mandel.",
    "Toronto was formerly known as York, the Upper Canada in 1793. It was later in 1834 when it was renamed to Toronto.",
    "Toronto is the safest metropolitan area in North America. EIU has ranked it number 4 in terms of safety among other categories including, public transit and cleanliness.",
    "Toronto has more than 8000 restaurants and some restaurants are now encouraging a 20% tip. Dining there in the city's culinary food items is the best experience if you visit Toronto."
  ],
  "Vancouver": [
    "Vancouver, Canada had been ranked first since 2002. However, Vancouver was lately ranked as the third most \"livable place in the world.\" It is so because of its high standard of living and superiority of life. The city is also ranked as the 10th cleanest city in the world.",
    "The Prohibition Commissioner of Vancouver couldn't resist to the tempting profits of bootlegging and was arrested and put in jail. Walter Findlay, stubborn in the fight against alcohol, was arrested for the import and sale of liquor in December 1918, less than one year into his position as commissioner."
  ],
  "Zurich": [
    "Self-confident and prosperous, Zurich is the lay-out of Swiss perfection, with its banking muscle, alpine backdrop, and love of good living. Blessed with pure air, dazzling Zurich Lake and a walkable Altstadt district full of fine boutiques and restaurants, it's a city of placid people. Enjoy a literary pint at the James Joyce Pub, or buy a funky Freitag bag to realize that behind its super-slick facade, Zurich inspires and innovates. Let us know some intriguing facts about this colorful \"Little Big City\", Züric",
    "Zurich is considered one of the happiest cities in the world. Many happy people with fulfilling jobs and talents, but 1 in every 9 jobs in the entire country is in Zurich. Most of the world's major banks have headquarters here, as do many insurance companies. As per many Zurich has been given the title as having the best quality of life in the world.",
    "Nightlife of Zurich offers classy clubs, casual and alternative bars, as well as live-music venues and strip clubs. On the weekend people from almost half of Switzerland come to the city to have a good time. The main nightlife areas are Niederdorf in the old town, the streets around Langstrasse and Zurich West. Zurich is also considered the fashion city of the country.",
    "Zurich is the city of largest Techno Street Party. Zurich holds a major event that defines that perception completely. Every year in August, millions of wildly dressed people fill the streets of Zurich to party at Street Parade, the largest techno parade in Europe. In a celebration of thumping beats, electronica music, and freedom of expression, this party will knock your socks off."
  ],
  "Wil": [
    "We probably don't spell Shakespeare's name correctly—but no issues neither did he. In the few original signatures that have survived we come to know that Shakespeare spelt his name \"Willm Shaksp,\" \"William Shakespe,\" \"Wm Shakspe,\" \"William Shakspere,\" \"Willm Shakspere,\" and \"William Shakspeare\" but there are no records present which spell it as \"William Shakespeare."
  ],
  "Man": [
    "Mandarin Chinese is spoken by 1 billion people around the globe making it the most used language amongst all. Apart from being the most common language, there are a number of interesting facts that you might not know about Mandarin. Check them ou",
    "There is another writing system to write Chinese in Roman alphabets, it is called Pinyin. In Chinese, Pinyin literally translates to spelled sound. Pinyin is really helpful in understanding different tones of Mandarin.",
    "Mandarin has four tones and because of these four tones, a word in Chinese can mean four different things. There is also a fifth tone which is sometimes not counted because it is a neutral tone. There is a famous poem in Chinese called 施氏食狮史 Shī shì shí shī shǐ which translates to - 'The Lion-Eating Poet in the Stone Den' having 120 characters, all of which have the pronunciation \"shi\".",
    "More and more famous people are learning Mandarin. Recently, Facebook CEO & Founder Mark Zuckerberg flabbergasted a group of students at Beijing University by talking in Chinese (if you ask me its tones could do with a little work, though!). Other famous people that speak Mandarin include former Australian Prime Minister Kevin Rudd and former US Treasury Secretary Timothy Geithner, who studied Chinese at Beijing University. Even Prince William gave an interview in Mandarin recently, as he wished everybody a Happy Chinese New Year.",
    "Mandarin is really bizarre. Mandarin characters can be written from left to right, right to left, or from top to bottom."
  ],
  "Bali": [
    "Since 1960 Bali had grown to be the most famous international destination. Thanks to its spectacular mountains, beaches and sweet natured people, Bali has become an exotic destination for relaxing and enjoying vacations. Keeping aside the mesmerizing natural beauty Bali has some interesting traditions, places and other facts. Let's find them ou",
    "It is amazing that every priest of every religion in Bali is paid by the government giving its true secular identity",
    "There are two volcanoes in Bali and guess what both of them are active! One of them is Mount Batur which is 5 thousands feet high and the other is Mount Agung which is 10 thousands feet high. Even though it is a major tourist attraction yet any eruption can claim large number of lives",
    "Pawukon Calendar is the Bali calendar and it has only 210 days! According to this calendar, each year is divided into six month and one month is of 35 days. There is also another calendar used in Bali. It is called Sasih and it is a 12 lunar month calendar",
    "In the north of Bali Lovina is situated where a wide variety of Dolphins is found. Even though it is hard to believe that Dolphins can be found in a place like Indonesia. Yet no less than 5 varieties of Dolphins coexist in these waters",
    "It is the belief of every Balinese that when a child is born it is accompanied and protected by four guardian angels. Those angels are around the child until his / her fourth birthday! Also special care is taken that Balinese babies do not touch the ground until they are 3 months old. So, babies are carried everywhere until twelve weeks are completed since their birth",
    "People of Bali are pet lovers and in most home there are at least 2 types of pet. Pet animal can be dog, cat, birds, cattle, pigs and even chicken (especially fighter cocks). Most pets, even cattle are kept for fun"
  ],
  "Shenzhen": [
    "The vibrant city of Shenzhen was designated as UNESCO City of Design in 2009.",
    "Shenzhen also has a high crime rate. The city has more police than anywhere else in China except Beijing. If we go by figures then, the number of crime cases jumped 57 percent in 2003 to over 100 thousands reported cases.",
    "Shenzhen is a great manufacturing center and is home to China's most successful high-tech companies such as BYD, Huawei, Tencent, ZTE etc. Many large events including China Hi-tech Expo are held here annually.",
    "Shenzhen has a warm, monsoon-influenced, humid subtropical climate. Winters are usually very mild and not that cold. Frost is a very rare scene.",
    "China's first major stock exchange opened in Shenzhen in 1990. It is shocking that it was opened in Shanghai one year later after Shenzhen."
  ],
  "Shanghai": [
    "After all these naming shenanigans, the name \"Shanghai\" is most prevalently known to us. Let's take a look at some interesting facts about the most populous city in Asi",
    "4. Shanghai Cooki"
  ],
  "Hangzhou": [
    "The Hangzhou metropolitan area is known to be the fourth largest in China. It is located in the north of Hangzhou Bay, which separates Shanghai and Ningbo.",
    "Hangzhou has a subtropical monsoon climate which makes it one of the most popular travel destinations in China. The city observes very hot, humid summers and chilly, cloudy winters with the possibility of snow sometimes.",
    "Forbes Magazine ranked Hangzhou the number 1 city for business in China in the years 2004, 2005 and 2006.",
    "In September 2015, Hangzhou was decided to host the 2022 Asian Games. It will be the third Chinese city to host the Asian Games after Beijing 1990 and Guangzhou 2010."
  ],
  "Chengdu": [
    "Chengdu is the capital of China's Sichuan province. The city is located in the west of Sichuan Basin and is one of the three most populous cities of Western China.",
    "Chengdu is located in the center of Chengdu Plain. Chengdu Plain is also known as the \"Country of Heaven\" and the \"Land of Abundance.\"",
    "Chengdu locals speak a different dialect of Mandarin. While a few local people would also know the standard dialect, it would be good if you learn some local words.",
    "Chengdu city was also called by the name 'Chengtu' in earlier times.",
    "Chengdu has six mountains of height 6000 meters. None of these six peaks has ever been climbed and all have been forbidden to climb since 2010. You can only come near the mountains to admire their beauty and spend some time.",
    "Chengdu was awarded the \"gourmet city\" by UNESCO creative cities network team. The city is also known as \"the cultural city of China\" and \"China's best tourist city\" by the people."
  ],
  "Beijing": [
    "Once the capital of four dynasties in history and the capital of People's Republic of China today, Beijing is one of the world's truly imposing cities. Beijing is the capital of exhilarating extremes with its glittering skyscrapers, mazy hutongs, and enigmatic. Combining both modern and traditional architecture, Beijing is an ever-changing megacity rich in history but also truly modern exemplified in its extraordinary global influence in politics, business & education, economy, history, culture, language, architecture, sporting, fashion, art, entertainment, innovation, and technology. Let us know some amazing and intriguing facts about this Forbidden City, Beijin",
    "Beijing has served as a capital of six notable dynasties and Governments over 21 centuries. In 221 BC, it was the Yan State capital, in 1271, it was the national capital for the Yuan dynasty, in 1402, it became the capital of Ming dynasty, in 1644, it became the capital of Qing dynasty, in 1912, it was known as the capital of Republic of China and eventually it has been serving as the capital of People's Republic of China since 1st October 1949 inaugurated by Mao Zedong.",
    "Beijing is one of the most polluted cities in the World. Beijing's Air has become perilous. If you breathe in Beijing for six days, it is equivalent to smoking one cigarette.",
    "As per recent census, the most popular surname in Beijing is Wang, with an impressive 11% holding the name.",
    "Beijing is the 16th name of the city. The city has such a rich and deep history, with different people throughout the centuries. Cities Old names were Ji, Jicheng, Yan, Yanjing, Guangyang, Fanyang, Yuyang, Jixian, Nanjing, Zhongdu, etc."
  ],
  "Anda": [
    "The language mostly spoken on the islands is Bengali followed by Hindi, Tamil, Telugu and Malayalam. Andaman Creole Hindi is also widely used as a trade language in the Andaman islands."
  ],
  "Madrid": [
    "The name 'Madrid' is found to be some 2200 years old. According to Arabic records, 'Mayrit' or 'Magerit' are the old names of Madrid meaning 'place of abundant water.'",
    "Madrid abounds five shopping districts, small outlets, and famous Spanish brands such as Zara, Mango, Massimo Dutti, Blanco or Stradivarius. These shopping provinces include the stunning neighborhood of Salamanca, also known as \"the golden mile, the more affordable Princesa and Cuatro Caminos - the best shopping destination for bargainers."
  ],
  "Florida": [
    "You may already know that Florida joined the Union as the 27th state in 1845, and is presently the third most populous state in the US and has the longest coastline, etc., but there's more to Florida than meets the eye and we have dug up a few of the coolest facts for you. Let's find out some interesting facts about Florida- \"the sunshine state",
    "The Spanish conquistador Juan Ponce de León landed near Saint Augustine in 1513 few days after Easter. To commemorate the holiday and the area's plant life; he named the land Florida from the Spanish phrase for the Easter season, Pascua Florida meaning \"feast of flowers.\" The name is the oldest surviving European place-name in the U.S",
    "Disneyland in Orlando is a city built between two counties. Disney had petitioned the Florida State legislature to let it govern its own land, making Disney-World a separate city",
    "There is an ancient burial pond in Florida which contains human remains, buried almost 2000 years before the first pyramids. The skeletal remains are so well preserved that archaeologists have managed to collect soft brain tissues from the skulls",
    "Contrary to what you might believe, the most famous car race of the year isn't in Indiana but right here in Florida at the Daytona International Speedway where the Daytona 500 is held",
    "Florida beats every single other state when it comes to the number of golf courses. It's no wonder since you can play almost every day of the year",
    "Many Florida cities are at the top of Forbes' list of millionaire Capitals in America. Fisher Island and Palm Beach make it in the top 20 cities across the nation with the highest net worth. Be careful! God knows, who you might run into",
    "In Florida it is illegal to sing in a public place wearing a swimsuit; Men are not allowed to be seen public in any kind of strapless gown; it's an offense to shower naked, and it is illegal to skateboard without a license in Florida"
  ],
  "Andes": [
    "The longest continental mountain range in the world (and also one of the highest), the Andes sweep down the spine of Ecuador setting the stage for serious adventures such as mountaineering and adrenalin-charged mountain biking, as well as rather more pastoral pursuits like hiking or a visit to a rose farm. Let us know some interesting facts about Andes Mountain Rang",
    "Some historians believe the name Andes comes from the Quechan word anti (\"east\"); others suggest it is derived from the Quechan anta (\"copper\"). It perhaps is more reasonable to ascribe it to the anta of the older Aymara language, which connotes copper color.",
    "The only mountains that are taller than the Andes are the Himalayan Mountains and their adjacent ranges, including the Hindu Kush. The average elevation in the Andes is about 13 thousands feet (3 thousands meters). The highest elevation in the Andes is Mount Aconcagua in Argentina, which is 6 thousands m.",
    "The Andes is one of the most popular natural wonders in the South America, attracting millions of visitors every year, from all around the world.",
    "The peak of Chimborazo in the Ecuadorean Andes is farther from the Earth's center than any other location on the Earth's surface. Mount Chimborazo is an inactive volcano in Ecuador, which last erupted over a thousand years ago.",
    "The Andes are not just a single chain of mountains. They are made of several parallel chains that unite, from place to place, in orographic knots or depart one from another, forming high plateaus between them.",
    "In the Atacama region of Andes, copper mineralization occurs making Chile and Peru the first and second largest exporters of copper in the world.",
    "You should know that two of the most important crops of the world, potato and tomato, originated both for the first time in the Andes Mountains!",
    "Andes are the result of the head-on collision between two tectonic plates, one (Nazca plate of the Pacific) being driven by subduction areas and buried underneath the South American plate into the Earth's mantle. The collision occurred 50 million years ago.",
    "There are large deposits of Coal, oil and natural gas, iron ore, gold, silver, tin, copper, phosphates and nitrates and Bauxite within the Andes Mountains. The Yanacocha gold mine in Peru is the largest gold mine in the world."
  ],
  "Rees": [
    "Reese Witherspoon is an American actress and producer, popular for her roles in films like Cruel Intentions, Legally Blonde, Best Laid Plans, and American Psycho. Here are some interesting facts about Reese Witherspoon you may not kno",
    "Once, Vanity Fair's director Mira Nair joked to Reese about getting pregnant for her role's demand, as she was too slim. Later, during production, Witherspoon announced that she was pregnant"
  ],
  "Hamburg": [
    "Hamburg has more bridges than Venice, London and Amsterdam combined. The total number of bridges in the city is a slight more than 2 thousands. A world record by the way.",
    "Approximately 4 million people inhabit in Hamburg's Metropolitan Area. Whole population of Northern Germany rush to Hamburg for trade and shopping.",
    "Hamburg is one of the greenest cities in Europe. About 14% area of the city is covered with gardens and parks."
  ],
  "Berlin": [
    "One in every two Berliners is single or they are not married. A study released in 2015 showed that people refuse to settle down or coupled-up life.",
    "Berlin has two zoos: Tierpark and Zoologischer Garten in the west. The latter is oldest in Germany founded more than 150 years ago and former was founded in 1955 and is located in Friedrichsfelde. Tierpark houses 7 thousands animals from 846 species.",
    "Berlin is the greenest city of Germany. About more than one-third area of the city is covered by forests, gardens and parks.",
    "City's administration takes fare-dodging quite seriously. Fare-Dodgers are not left scot-free. People of Berlin are sent to prison if they travel without a ticket. It comes to know that one in every three prisoners is fare-dodger."
  ],
  "Oran": [
    "Oranges are good absorbents that help in digesting a variety of medicines, especially Vitamin D supplements. So, next time, while taking your Vitamin D pills, don't forget to have orange juice, otherwise, it may lead to the formation of stones in your body"
  ],
  "Ibiza": [
    "When Phoenician people arrived here, they founded the port on the island. At that time, Phoenician people called the island, 'Ibossim' or 'Iboshim,' however, with the passage of time, name changed to Ibiza",
    "Ibiza is the third largest Balearic Island after Mallorca and Menorca",
    "The average temperature in Ibiza remains around 20ºC for more than 8 months of the year",
    "Due to the huge influx of tourists, restaurants, clubs, shopping centers, and edible products are very expensive in Ibiza. To buy a small bottle of water, tourists have to pay around €9. Ibiza is the second most expensive area of Spain after Madrid",
    "In the 1990s, Ibiza has been titled \"The Entertainment Island of the World\" by Guinness World Record",
    "In 2007, the local government of Ibiza declared that all hotels on the Island must be of five-star standard",
    "Once, the famous astrologer and seer, Nostradamus predicted that due to the unique winds around the island, Ibiza may be the only place to survive the impending nuclear destruction",
    "In 2018, people in Ibiza took to the street to protest against over-tourism. According to the report, more than 500 people went against the impact of over-tourism in Ibiza",
    "Ibiza is undoubtedly popular for water activities. People enjoy surfing, diving, boating, rafting, swimming, stand-up paddling, kayaking, parasailing, water-skiing, and other water activities in the clear water of Ibiza. There are 17 diving schools on the island",
    "In 1999, the whole island of Ibiza became the UNESCO World Heritage site due to its long history and coastal ecosystem"
  ],
  "Ibi": [
    "When Phoenician people arrived here, they founded the port on the island. At that time, Phoenician people called the island, 'Ibossim' or 'Iboshim,' however, with the passage of time, name changed to Ibiza",
    "Ibiza is the third largest Balearic Island after Mallorca and Menorca",
    "The average temperature in Ibiza remains around 20 Celsius for more than 8 months of the year",
    "Due to the huge influx of tourists, restaurants, clubs, shopping centers, and edible products are very expensive in Ibiza. To buy a small bottle of water, tourists have to pay around €9. Ibiza is the second most expensive area of Spain after Madrid",
    "In the 1990s, Ibiza has been titled \"The Entertainment Island of the World\" by Guinness World Record",
    "In 2007, the local government of Ibiza declared that all hotels on the Island must be of five-star standard",
    "Once, the famous astrologer and seer, Nostradamus predicted that due to the unique winds around the island, Ibiza may be the only place to survive the impending nuclear destruction",
    "In 2018, people in Ibiza took to the street to protest against over-tourism. According to the report, more than 500 people went against the impact of over-tourism in Ibiza",
    "Ibiza is undoubtedly popular for water activities. People enjoy surfing, diving, boating, rafting, swimming, stand-up paddling, kayaking, parasailing, water-skiing, and other water activities in the clear water of Ibiza. There are 17 diving schools on the island",
    "In 1999, the whole island of Ibiza became the UNESCO World Heritage site due to its long history and coastal ecosystem"
  ],
  "Vic": [
    "Also called as Mosi-oa-tuniya (The smoke that thunders), the Victoria Falls is the largest water falls in this world. It is located on Zambezi river on the borders of Zambia and Zimbabw",
    "Iron-using Khoisan hunter-gatherers displaced the Stone Age people living in the area and in turn were displaced by Bantu tribes such as the southern Tonga people known as the Batoka/Tokalea, who called the Victoria falls Shungu na mutitima. The Matabele, later arrivals, named them aManz' aThunqayo. Here are some facts that are worth knowing about these fall"
  ],
  "Leon": [
    "When it comes to paintings, the foremost name appears to be that of Mona Lisa by Leonardo da Vinci- the great Italian artist of the 15th century. However, he was not only a painter but a polymath, who influenced a broad spectrum of creative fields. Let's explore some interesting facts about this Renaissance Ma",
    "Leonardo da Vinci was left handed and used to write from right to left, which resulted in a mirror script and was difficult to read for others.",
    "Throughout his life, Leonardo da Vinci had been a strict vegetarian, which is supposed to be a by-product of his affection towards the animals.",
    "Leonardo recorded only two of his childhood incidents- one was when a kite dropped from the sky and its tail brushed his face. The second when he discovered a cave while he was exploring in the mountains and was terrified that some monsters might lurk there.",
    "Based on the work of the architect Vitruvius, Leonardo da Vinci depicted the proportions of the human body in his drawing- The Vitruvian Man. He drew this around 1490 and the drawing is supposed to be the extension of the universe in the form of human body.",
    "In the late 15th century, Leonardo da Vinci drew a mural painting- The Last Supper. It was a part of a plan to restore the churches of Milan. The mural painting depicts the scene of The Last Supper of Jesus with his twelve Disciples when Jesus announced that one of them would betray him."
  ],
  "Barcelona": [
    "Founded as a Roman city, Barcelona is now the capital city of Catalonia in Spain. Facing the Mediterranean Sea, Barcelona attracts millions of tourists every year to witness its pristine beaches and world renowned architecture. With sandy Mediterranean beaches, fabled architecture, and mouth-watering food, Barcelona is sure to mesmerize you. Here are some interesting facts that will get you craving to visit this enchanting cit"
  ],
  "Dese": [],
  "Paris": [
    "Romans conquered the Paris Basin in 52BC and named it Lutetia",
    "Before the invasion of Paris by the Nazi's during the Second World War, the Louvre was emptied and its contents were circulated among the rich French citizens, who secretly kept them in their houses",
    "Parisians are at low risk for getting a ticket on jumping a stop sign as there is only one Stop sign in the whole city of Paris",
    "Difficult to believe, but true! In the Fashion capital of the world, Paris, it was illegal for French women to wear trousers until the 214-year-old law was abolished in 2012. Although it was not enforced, still women could get arrested for it",
    "The Parisian government gives out medals to parents who have successfully \"raised several children with dignity."
  ],
  "Bron": [
    "You'll like what this gigantic lizard's name mean: Thunder Lizard! Brontosaurus, named after its discoverer Othniel Charles Marsh in 1879, is derived from Greek \"bronte\", which means thunder. So let us get to know more thunderous facts about, what others call it, \"deceptive dinosaurs"
  ],
  "Washington": [
    "It's time to see how much you really know about the capital of the United States, Washington D.C. Apart from being a home to the entire federal government and the President of the US, it is one of the oldest cities in the United States. From the memorials, monuments, and museums to secret subways and missing streets we'll explore all about the city and bring some surprising things about the Washington, D.C. Let's dig up some interesting facts about Washington, D.C",
    "After a long day of working hard who doesn't like to distress with a nice glass of wine. More wine is consumed in Washington D.C., than any state in the United States",
    "The Washington Monument was the tallest structure in the world when it was completed in 1884. But soon it was eclipsed by the Eiffel Tower, and numerous other taller buildings have sprung up since then. At 555 feet, the obelisk still remains the tallest object in D.C",
    "Imagine standing at the top of a 169 m tall monument and trembling in the wind. It might sound unbelievable, but on particularly windy days, Washington monument has been known to sway slightly in the wind. It will sway about .125th of an inch on a day when the wind speed is recorded at about 30 miles per hour",
    "The streets of Washington D.C. are set-up in a grid-like pattern of letters and numbers. But you may or may not know that between the lettered streets of \"I\" and \"K,\" there is no \"J Street.\" When the colonists were planning the streets, the \"J\" alphabet wasn't quite finished yet. The urban myths related to this missing street are much more entertaining, though. One of the stories goes on to say that the \"J\" Street was nixed because D.C. designer Pierre L'Enfant hated John Jay, the new nation's first chief justice",
    "No dancing, singing or whistling around near any \"public convenience station.\" It's possible getting a car ticket even in your driveway. Whaaaaat ? It's illegal marrying your mother-in-law in the Washington D.C. Duh",
    "Washington, D.C. is the center of all the 3 main branches of the Federal Government of the United States- The Congress, The President, and the Supreme Court"
  ],
  "Letchworth": [
    "Just a few miles away, there lies a gorgeous village, Mount Morris. It is at the north-eastern entrance of the Letchworth State Park. Take a short hike or ride to this quaint village of New York"
  ],
  "Wa": [
    "It's time to see how much you really know about the capital of the United States, Washington D.C. Apart from being a home to the entire federal government and the President of the US, it is one of the oldest cities in the United States. From the memorials, monuments, and museums to secret subways and missing streets we'll explore all about the city and bring some surprising things about the Washington, D.C. Let's dig up some interesting facts about Washington, D.C",
    "After a long day of working hard who doesn't like to distress with a nice glass of wine. More wine is consumed in Washington D.C., than any state in the United States",
    "The Washington Monument was the tallest structure in the world when it was completed in 1884. But soon it was eclipsed by the Eiffel Tower, and numerous other taller buildings have sprung up since then. At 555 feet, the obelisk still remains the tallest object in D.C",
    "Imagine standing at the top of a 169 m tall monument and trembling in the wind. It might sound unbelievable, but on particularly windy days, Washington monument has been known to sway slightly in the wind. It will sway about .125th of an inch on a day when the wind speed is recorded at about 30 miles per hour",
    "The streets of Washington D.C. are set-up in a grid-like pattern of letters and numbers. But you may or may not know that between the lettered streets of \"I\" and \"K,\" there is no \"J Street.\" When the colonists were planning the streets, the \"J\" alphabet wasn't quite finished yet. The urban myths related to this missing street are much more entertaining, though. One of the stories goes on to say that the \"J\" Street was nixed because D.C. designer Pierre L'Enfant hated John Jay, the new nation's first chief justice",
    "No dancing, singing or whistling around near any \"public convenience station.\" It's possible getting a car ticket even in your driveway. Whaaaaat ? It's illegal marrying your mother-in-law in the Washington D.C. Duh",
    "Washington, D.C. is the center of all the 3 main branches of the Federal Government of the United States- The Congress, The President, and the Supreme Court"
  ],
  "Papa": [
    "There is an interesting story about the car of the owner of Papa John's. He loved it so dearly that he went on a road trip to find it. If you are wondering what the final result of his quest was, then don't worry! He finally got united with his dear car",
    "Where do you think the first outlet of Papa John's had started? Not in a posh suburban shop or a neatly open city outskirts! It was first started in a broom closet in Indiana! So, if you want to do something novel, you know where to start",
    "It seems that PJ and football has a special bond. The official pizza of NFL is Papa John's",
    "The company has a personal football title called, 'Papa John's.com Bowl'! Who buys pizza more than football lovers? Yes, PJ you have got the right target audience",
    "Once a franchise owner of Papa John's distributed T-shirts mocking LeBron James, saying \"crybaby!\" This got a lot of attention and publicity to the outlet"
  ],
  "Budapest": [
    "Yes, you can get to see vampires in Budapest. One of the Roman Polanski successful movie screenplays, \"The Fearless Vampire Killers\" was converted into theater entitled \"Vampire's Ball Musical.\" Around five million people from across the globe have seen Vampire's Ball Musical.",
    "Facts tell that 20% of Hungary's population lives in Budapest. So, every 5th person in Hungary is a 'Budapester'."
  ],
  "Yogyakarta": [
    "Yogyakarta nicknamed as Jogja or Yogya is one of the bustling cultural centres of Java, Indonesia. It was the ruling city of the Javanese empire of Mataram in the 16th and 17th century and this mighty past had led to the amazing traditional fine art and culture of Yogyakarta at the present time. Let's dig up some interesting facts about this classical city Yogyakart",
    "In the world's largest Muslim country, when you see Hindu epics coming alive then you realize how true their motto: 'Unity in Diversity' is. The name of the city Yogyakarta which means 'a city that is fit to prosper' is taken from Hindu Epic, Ramayana's city Ajodhya",
    "The word Yogyakarta had been cut and chopped in several ways revealing a unique nickname each time for this city. It is called Jogja, Yogya, Djogja, Yoja or Ngayogyakarta",
    "Yogyakarta can be rightly stated as being the mixing pot of tradition and urban life. While on one hand they still have a sultan whose palace 'Kraton' is the finest example of Jogja traditions and on the other hand the metropolitan area of bustles with malls, cyber cafes and traffic jams",
    "Even though Yogyakarta was once the revolutionary capital of Indonesia, yet petty thieving is a common case here. Tourists are always advised to keep their belonging with them all the time. If you have any secret pocket then Yogyakarta is the best place to test its accountability"
  ],
  "Makassar": [
    "The motto of Makassar is quite unique: 'Once the sail is raised, back to the shore is not an option."
  ],
  "Surabaya": [
    "Surabaya is the capital of East Java and the second largest city in the Republic of Indonesia. Surabaya consists of extremely diverse population and it serves as the bustling port of travel and trade. Let's know some interesting facts about this unique city of Indonesi",
    "While walking around Surabaya, take care of your belongings as this city has a high crime rate. People are advised to be careful while walking at night"
  ],
  "Semarang": [
    "Located on the north coast of Java is the island's capital city Semarang. With an area of 373.78 square kilometers, Semarang is the largest city of the Central Java province. Let's find out some interesting facts about this beautiful port cit"
  ],
  "Metro": [],
  "Jakarta": [
    "Jakarta, the capital of Republic of Indonesia is located on the North West coast of the Indonesian Island, Java. Jakarta is Indonesia's busiest destination in terms of both tourism and commerce. Let's find out some interesting facts about the largest city of Indonesia, Jakart",
    "The capital city of Indonesia, Jakarta is not a city officially. It is actually a province. But it had gained the special status of being the capital of Republic of Indonesia",
    "Comparing geographically, Jakarta occupy the proud position being the 13th largest city in the whole world. It is so large that its metro area has its own special name: Jabodetabek. In the year 2016, its population is recorded to be more than 10 million! Speak about being crowded",
    "Over the last decade Jakarta city had faced many different natural calamities and hence the city's depth had now sunk by 150 centimeters! Natural calamity: Honey! I sunk Jakarta"
  ],
  "Bandung": [
    "Bandung is the capital of Java Barat province of West Java in Indonesia. It is well known for its fashion and wide varieties of flowers, trees and parks. Café and boutiques are spread throughout its street. Let's know some interesting fact about the colorful Bandun",
    "The climate of Bandung is very pleasant throughout the year. This city is situated at an elevation of 768 meters above sea level due to which it enjoys an average temperature of 23.6 degree Celsius throughout the year. Hence, it makes for a perfect getaway any time of the year. With such awesome weather life of Bandung people must be one long holiday",
    "With about 50 higher education institutions, Bandung is the most popular destination for higher studies in Indonesia. The education varying from social science and technologies to tourism education can be obtained through these institutes"
  ],
  "Dublin": [
    "The name Dublin comes from the Irish word Dubh-Linn. It translates to \"black pool.\" The Dubh Linn was a lake used by the Vikings to tie up their trade ships.",
    "There are Twelve Dublin's in the United States, six in Australia and one in Canada."
  ],
  "Uran": [
    "The third largest planet in the solar system, Uranus, looks majestic in its beautiful greenish - blue color. It is the only planet that takes its name from Greek (rather than Roman) mythology. Besides being a gas (and ice) giant, Uranus has much more things worth knowing. Here are some interesting facts about this blue gas (and ice) gian",
    "The beautiful blue color of Uranus is due to a large amount of Methane gas present in Uranus's atmosphere. Methane has a unique property of absorbing red light and scattering away blue light. That's why Uranus looks greenish-blue",
    "One rotation of Uranus about its axis takes 17.9 Earth hours, and one complete revolution of Uranus around the Sun takes 84 Earth years",
    "Because of its unique tilt, each pole of Uranus gets around 42 years of continuous sunlight, followed by 42 years of darkness. So, if you want to spend the rest of your life in darkness/brightness, Uranus is your address",
    "Uranus is nicknamed as the \"ice giant.\" Uranus gained this name as it is chiefly composed of heavier volatile substance like Ammonia and Hydrogen Sulfide. These volatile substances along with water vapor create an icy cloud over Uranus due to which Uranus appears to have the pale blue color",
    "Uranus is the coldest planet in the solar system because the minimum temperature on this planet reaches - 224 degree Celsius. Uranus gives off less heat than the heat it absorbs from the Sun. However, it is still a mystery why Uranus is so cold",
    "Massive storms occur in the atmosphere of Uranus. Some storms on Uranus can occur as large as the size of a continent. The winds in these storms can exceed the speed of 500 miles per hour"
  ],
  "Un": [],
  "Shimla": [
    "The present capital of Himachal Pradesh and the former summer capital of the Colonial India, Shimla has been gifted with all the bounties of nature which one can think of. Surrounded by lush-green hills with snow-capped peaks and scenic locations, Shimla magnetically attracts the people from all across the globe and in-fact most of the people fantasize Shimla to visit once in their life time. Let's explore some of the interesting facts about this \"Queen of the Hills"
  ],
  "Pen": [
    "When the Pentagon was built, it was made in such a way that there were separate bathrooms for black and white employees. There are 284 bathrooms within the Pentagon. During that period, the nation was stuck with racism.",
    "The Pentagon was designed to be short because steel would not have been available much during the wartime. The building was made of concrete including 680 thousands tons of sand and gravel from the Potomac. Pentagon had concrete ramps instead of lifts due to the same reason. Later, only 11 lifts were added for freight use.",
    "A 15 years old once hacked NASA and caused a 21-day shutdown of its computers. He later hacked the Pentagon, as well."
  ],
  "Nagar": [
    "Nestled in the lap of Himalayas, Nagarkot offers a breathtaking view of the highest peak in the world- The Everest. So near, yet so far away from the hustle and bustle of chaotic Kathmandu, Nagarkot, is a resort village located in the Kathmandu Valley of Nepal. It attracts tourists from far and wide due to its mountains and breathtaking views of sunset and sunrise. Let's unveil some interesting facts about Nagarko",
    "14 December 2005, was proved as a Black Day for Nagarkot when an off-duty soldier named Basudev Thapa opened fire indiscriminately at villagers, celebrating at the Kali Devi Temple in Nagarkot, killing 11 and injuring 19 people."
  ],
  "Mon": [
    "There are monkeys primarily from three groups: Old World Monkeys, New World Monkeys and Apes"
  ],
  "Leh": [],
  "Indi": [
    "Representing the unique fabric of India's diverse culture, the National Flag of India, better known as \"Tiranga\" or \"Tricolor,\" is a rectangular flag with three parallel strips of Indian Saffron, White, and Green having a circular wheel in the middle with 24 spokes called Ashoka Chakra. As Mahatma Gandhi rightly said- \"It will be necessary for us Indians Muslims, Christians, Jews, Parsis, and all others to whom India is their home- to recognize a common flag to live and to die for.\" Besides being the symbol of India's struggle for independence, Indian national flag has many other aspects worth knowing. Here are some interesting facts about the Indian Fla",
    "The wheel with 24 spokes in the middle of the \"Tricolor\" depicts Dharmachakra & represents motion or growth. It has appeared on a number of edicts of Ashoka. It is also known as the \"Wheel of Law\" in India."
  ],
  "Hyderabad": [
    "Hyderabad is well known for its educational infrastructure. Around 350 Engineering colleges are located in Hyderabad, and Ranga Reddy district in Hyderabad has the most number of engineering colleges in a city in India. Some of the renowned colleges are BITS Pilani, Osmania University, IIT Hyderabad, etc",
    "Hyderabad is considered as one of the oldest rock formations on the planet, around 2500 million years old",
    "Fish medicine is given to Asthma patients by Bathini Goud brothers in Hyderabad, which is free of cost, and reportedly, it fully cures Asthma. The fish medicine is served only once in a year (when Mrigasira Karthi date falls); usually, the date falls in June month. It is said that millions of patients have cured their Asthma disease by taking this medicine"
  ],
  "Kolkata": [
    "Located on the east bank of the Hooghly River, Kolkata truly holds the essence of Eastern India. Being a historical city, Kolkata is home to numerous palaces, monuments, and temples bearing architectural significance. Let's explore some interesting facts about this Gateway of Eastern India",
    "Kolkata's marvelous architecture, delicious cuisines, Intellectuals like Rabindranath Tagore, and a blend of various cultures; making it the scientific and cultural capital of India",
    "No surprise, being the motherland of great authors and poets, Kolkata is a book reader's dream place. It has the world's second-biggest used book center where almost any book in the world can be found",
    "For a long time, Kolkata had enjoyed the status of India's most populous city. However, during the mid-1980s, Bombay (now Mumbai) overtook Kolkata as India's most populous city",
    "The world-famous Kolkata cuisines make it a haven to food lovers. Whether it's Machher Jhol (rice and fish curry), Mishti Doi (a sweet yogurt), Phoochka Panipuri Golgappa, or desserts such as Roshogolla and Sandesh, all are iconic dishes that give Kolkata its unique flavor",
    "Although Saree is worn throughout India, when it comes to the traditional Indian sarees, the Bengali sarees have a unique place, and Kolkata is considered the most affluent market of Bengali sarees"
  ],
  "Mumbai": [
    "Mumbai, earlier known as Bombay is the commercial capital of India. Mumbai is referred to as the city that never sleeps. One of the renowned authors, Salman Rushdie, once quote",
    "As a combination of overpopulation, rush-hours, outdated local railway system and lack of alternatives; Mumbai suffers an enormous amount of overload-rail victims",
    "Although Mayor is considered to be the guardian of any city; here in Mumbai, all authority comes under the CM of Maharashtra",
    "The negative aspect of Mumbai is that the city is facing a big shortage of toilets. It leads to not only inconvenience but also to unhygienic conditions",
    "Way back in 1863, Alice Tredwell, wife of Solomon Tredwell, took the responsibility to build the railway line from Mumbai to Pune; after Solomon's death within two weeks of arriving in India",
    "The Nobel Laureate, Rudyard Kipling, the author of one of the best sellers ever \"The Jungle Book,\" was born here in Mumbai in 1865",
    "Sounds strange, but it's a fact that the first post office in Mumbai was opened at the junior magistrate's home in 1832",
    "With the rising population of migrants in Mumbai, the city has virtually no space to live; as the open space available to every person in Mumbai is only 1.28 sqm",
    "The first motor bus route in India was started on July 15, 1926, which ran between Afghan Church and Crawford Market, Mumbai",
    "Mumbai's description without \"Vada Pav\" would always remain incomplete. A pillowy pav, stuffed with a golden-fried spiced batata (potato) vada, covered with a lick of tamarind and coriander chutneys and a sprinkling of garlicky masala- Vada Pav has grown to be the darling of the masses in Mumbai",
    "Built during British rule, the Gateway of India is one of the most iconic tourist places in Mumbai. Inaugurated on December 4, 1924, it was erected in honor of King George V and Queen Mary's landing at Apollo Bunder on their visit to India. Interestingly, after India's independence in 1947, the last British ships left the country from the Gateway of India"
  ],
  "Bihar": [
    "In 2014, the longest free Wi-Fi range in the world was launched in Patna by the Government of Bihar. It spans over whopping 20 k",
    "India's is a country where Cricket is no less than a religion, and the name MS Dhoni is one of the most celebrated chapters of this religion. MS Dhoni was born in Ranchi, Bihar (now, in Jharkhand) and is considered India's most successful Cricket Captain; so far. GIF: storypick.c"
  ],
  "Bengaluru": [
    "Vibrant Bengaluru (formerly Bangalore) is one of India's most developed and progressive cities. Buzzing and alive with activity, Bengaluru is considered South India's most alive city. Situated in the heart of South India, this cosmopolitan city has everything that a world city needs. Dive through the article to get some interesting facts about this magnificent cit"
  ],
  "Anta": [
    "Situated on the Gulf of Antalya, a Turkish city, Antalya is very much a popular destination of tourists from around the world. Antalya is beautifully sprawled on the western Mediterranean coastline and hence, offers wonderful scenic views. With a population of one million people, Antalya is known to be Turkey's largest city within that area. If you are planning to pay Antalya's long sunny beaches and museums a visit, make sure you go through these few interesting facts about the Turkish resort city, Antaly",
    "The city was known as Attaleia, Attalia, Satalia, and Andalya as it was founded by the king of Pergamum, Attalus II. Later, it came to be known as Antalya.",
    "Antalya is the fifth most populous city in Turkey with over one million people in its urban area."
  ],
  "Venice": [
    "The Republic of Venice was a state in Europe that originated from the lagoon communities in the area of Venice, now northeastern Italy. It existed from the late 7th century AD until 1797, slightly over a millennium although it had a long history of war and conquest.",
    "Venice has many narrow streets. The narrowest street in Venice is called 'Calletta' or 'Ramo Varisco' and it is located on a side street near Campo San Canciano: it is one of the narrowest streets in the world because it measures only 53 cm wide at chest level.",
    "The population of Venice dropped from over 120 thousands to 60 thousands over the last 50 years. Some Experts say that Venice will be the ghost city by 2030. It would be populated only by tourists that would come in the morning and leave in the evening. The constant sinking of town making the people move out of the city.",
    "Venice has its own language, Venetian. People in Venice speak it, however, people are very fluent in Italian too. The Venetian language is not a dialect of the Italian language",
    "A country of South America, Venezuela is named after the Italian name of the city of Venice, 'Venezia.' Also, Venezuela means little Venice in Spanish",
    "The first graduate woman in the world was born in Venice. It was Elena Lucrezia Corner Piscopia, who received the academic degree from the University. She was born in 1646. She was also the first woman in the world to receive a Ph.D. degree from the University of Padua",
    "The whole city of Venice and its lagoon became the UNESCO world heritage site in 1987 due to its great history and architecture"
  ],
  "Rome": [
    "The first-ever shopping mall was built by Emperor Trajan in Rome. It consisted of several levels and more than 150 outlets that sold everything ranging from food and spices to clothes.",
    "The Romans had built a road network of 53 thousands miles by the early fourth century. Each Roman mile was about 4 thousands feet and marked by a milestone, giving birth to the saying \"All roads lead to Rome.\"",
    "It is a known fact that the life expectancy of people in ancient Rome was just 20-30 years.",
    "Urine was used in Ancient Rome to wash clothes and Ancient Romans would use Urine even to whiten their teeth."
  ],
  "Florence": [
    "Under the reign of the Medici family, Florence was a center for European trade and was among the wealthiest cities of that era. Lorenzo De' Medici was a great admirer of art and music who commissioned work to Michelangelo and Leonardo da Vinci. Even singers like Alexander Agricola, Johannes Ghiselin, and Heinrich Isaac were brought to Florence, and this marked the transition from the medieval period to a contemporary world",
    "Italy has always been famous for its breathtaking artwork. According to the UNESCO, 60% of the world's total artwork is preserved in Italy, and more than half of it is present in Florence like Piazza Della Signoria, Uffizi Gallery, Pitti Palace, Galleria dell'Accademia, and Palazzo Vecchio; making it the 'Capital of Art.",
    "Florence is home to the world's greatest painters, sculptors, poets, architects, and other intellectual minds like Leone Battista Alberti (polymath), Dante Alighieri (poet), Filippo Brunelleschi (architect), Giotto di Bondone (14th century painter), Michelangelo Buonarroti (sculptor), and the list goes on",
    "Florence is not only home to great artists, painters, and sculptors but is also the birthplace of the mother of modern nursing, Florence Nightingale. Although she was born into an upper-class British family; she was named after the town in which she was born. Florence Nightingale was the only female to be honored with the 'Order of Merit,' the highest honor given to a British person after her contribution to the field of nursing. Source; thinkglobalschool.org, GIF: giphy.c",
    "People of Florence have their dialect called Florentine; which, in turn, gave birth to the Italian language. One of the famous authors, Dante, is responsible for creating the basic standards of this language; which later came to be known as the Italian language. The whole country speaks this language now",
    "In 1938, when Benito Mussolini invited Hitler for a state visit, Hitler was amazed by the beauty of Florence. He enjoyed the view from the Ponte Vecchio. During World War II, Germans demolished all the bridges over the Arno river except Ponte Vecchio; as Hitler called it 'too beautiful to destroy.",
    "The story of Pinocchio has its roots in Florence. The story revolves around a wooden boy whose nose grows bigger and bigger as it lies. The author of Le Avventure di Pinnochio, Carlo Lorenzini (pen-name Collodi) was a Florentine by birth",
    "Bartolomeo Cristofori was not a Florentine, but he lived in Florence. In 1688, Bartolomeo was hired to take care of musical instruments of Prince Ferdinando de Medici. During that time Cristofori invented Pianoforte in Florence which later came to be known as Piano",
    "An unusual psychological disorder called Stendhal Syndrome, also known as Florence Syndrome, is triggered when a person perceives artwork to be very beautiful. He may start experiencing symptoms like rapid heartbeat, dizziness or even fainting. It was named after the French author Henri-Marie Beyle (penname 'Stendhal') because when he visited Florence's Santa Croce Cathedral and witnessed Giotto's famous ceiling, he became very emotional and couldn't hide his ecstasy. After Stendhal, there were more than 100 cases of people experiencing the same after visiting the Uffizi Gallery",
    "Tuscan and Florentine wines are known for their fantastic tastes world over. Wine producing areas in Florence have the ideal environment; like the most famous \"Chianti.\" Florence allows you to visit a \"Cantina\" (Wine cellar) to enjoy a delightful wine tasting or winery tour inside an \"Enoteca\" (Wine bar)",
    "Dan Brown's best-seller, Inferno, offers the key to visiting the city of Florence right alongside professor Robert Langdon; as he sets off in search of the threat hidden within Botticelli's \"map of Inferno.\" Some of Florence's main monuments such as Porta Romana, Boboli gardens, State Institute of Art, The Vasari CorridorPalazzo Vecchio, and The Baptistery were showcased in the film \"Inferno."
  ],
  "Yokohama": [
    "Yokohama's port was one of the first ports to be opened to foreign trade in 1859. Gradually, the city prospered from a small fishing village into one of Japan's major cities.",
    "Yokohama has hot and humid summers and chilly winters. The city has a mixed bag of climate. The coldest temperature was on 24 January 1927 when −8.2 °C (17.2 °F) was reached, whilst the hottest day was 11 August 2013 at 37.4 °C (99.3 °F).",
    "In 1872, during the Russo-Japanese War. Japan's First railroad was constructed in 1872 and Yokohama was connected to Tokyo.",
    "Yokohama suffered a huge loss during the earthquake of 1923 and the heavy bombardment during World War II. The city has been rebuilt twice and has prospered again.",
    "Yokohama was the location for Japan's first bakery, brewery, photo studio, cinema, newspaper, public restroom and ice cream.",
    "Yokohama is especially known for its exports of raw silk, canned fish and other local products such as in the export of machinery, iron, and steel."
  ],
  "Tokyo": [
    "Tokyo is a well-known city, but is officially known as a \"metropolitan prefecture\", which differs from and combines elements of both a city and a prefecture, a characteristic unique to Tokyo. Formerly known as Edo, Tokyo is frequently the setting for many Japanese movies, television shows, animated series (anime), web comics, and comic books (manga)"
  ],
  "Osaka": [
    "Ōsaka is the third largest city in Japan, with a population of over 2.5 million people in its greater metropolitan area. It is the central metropolitan city of the Kansai region and the largest of the Osaka-Kobe-Kyoto trio.",
    "Osaka translates to \"large hill\" or \"large slope\". Mountains surround three sides of the Osaka prefecture and the west faces the arc-shaped Osaka Bay.",
    "Almost all of Osaka's historical monuments were destroyed in World War II bombing raids. Many of the city's important buildings and tourist attractions were also ruined and rebuilt after the war.",
    "Osaka has served as the capital of Japan many times. It is due to its status as a popular port with lots of trade and business opportunities.",
    "Osaka is well known for its vast underground shopping malls, its varied and magnificent food, and its friendly people. The people of Osaka are well known all over Japan for their friendliness and hospitality."
  ],
  "Kamakura": [
    "If you take only one day trip outside of Tokyo, it should be to Kamakura, especially if you're unable to include the ancient capitals of Kyoto and Nara in your travels. Kamakura is a delightful hamlet with no fewer than 65 Buddhist temples and 19 Shinto shrines spread throughout the town and surrounding wooden hills. Kamakura is renowned for its relaxed atmosphere and serenity. Let us know some intriguing facts about this thriving seaside resort, Kamakur",
    "Kamakura was the political capital of Japan during the Kamakura shogunate, from 1185 to 1333. It is often described in history books as a former capital of Japan.",
    "The earliest traces of human settlements in Kamakura date back at least 10 thousands years.",
    "In ancient days, when the roads were not well constructed, several artificial narrow passes were used to go places. The seven most important such passes were called Kamakura's Seven Entrances or sometimes even known as \"Kamakura's Seven Mouths\".",
    "Kamakura is the birthplace of Japan's first military government, the \"Kamakura Bakufu.\" The warrior Minamoto no Yoritomo was appointed as shogun by the Imperial court in 1192. It was he who established the Kamakura Bakufu (the first military) government in Japan.",
    "Kamakura was the 4th largest city in the world in 1250 AD. It was the Capital of the Japan. Later it was designated as a city on 3 November 1939.",
    "Kamakura sustained significant damage during the Great Kantō earthquake of 1923. Three hundred people died in Kamakura.",
    "The city of Kamakura is surrounded by Mt. Rokkokuken from the north to the east. Today, Kamakura is famous as an upper-class area for people to live."
  ],
  "Hiroshima": [
    "Whether you are a history buff or not you must be well aware of the Hiroshima and Nagasaki incidents. When the world was drawing towards the close of a long drawn out war, US bombed two cities of Japan with the deadliest weapon ever known to mankind. This changed the history of warfare forever, ushering the nuclear era. Let's explore some interesting facts about the Hiroshima and Nagasaki bombings, the first and last atomic bomb attac",
    "Before destroying the cities of Hiroshima and Nagasaki with nuclear bombs U.S dropped fliers warning the civilians of a possible bombing at all the military centers of Japan so that the innocent civilians could evacuate and save their lives",
    "All thanks to the efforts of a brave policeman who survived the Hiroshima bombing, no policeman died in Nagasaki's atomic blast. The policeman who survived Hiroshima episode went to Nagasaki to teach the police about the duck and cover technique that saved them from the attack",
    "Little boy and Fat man dropped on Hiroshima and Nagasaki were quite different from one another. US used these bombings to figure out the potential of each. Little Boy was based on enriched Uranium-235 and Fat Man on Plutonium-239",
    "Though 141 pounds of Uranium was used to make the bomb that hit Hiroshima, the huge explosion was caused just by 0.7g of Uranium. Most of the uranium had blown apart before the bomb reached its \"supercritical\" phase",
    "Pumpkin bombs were the nickname given to the 49 practice bombs dropped by US before nuking Hiroshima and Nagasaki. They killed 400 people and injured 1 thousands",
    "US had also devised a hydrogen bomb that was 100 times more powerful than the one used on Hiroshima. It was blown up in outer space"
  ],
  "Seoul": [
    "With a variance of culture, Sports, cuisine, or economy, South Korea has landmarked its name over the world. K-pop is storming the music from around the globe through the fame of BTS or PSY. We talk about the city where the dreams take their shape- Seoul, the soul of South Korea and its capital city. If you ever plan to go there, let us be enlightened about Seou",
    "Unlike the names of other cities in Korea, Seoul has no corresponding hanja (Chinese characters used in the Korean language)",
    "South Korea developed massively after the Korean War; becoming one of the largest economies of the world. The credit goes to its work culture. With the most populated city of South Korea, Seoulites are the biggest workaholics. Moreover, the government had to force the law to reduce the working hours of the employees",
    "If you kill your time on the internet and then buffering kills your mood; here's a suggestion, go to Seoul. It serves with the world's fastest internet speed",
    "Although there are many things which make Seoul a special city, its official name is even more special- Seoul Special City",
    "The South Korean Capital is known world-over for its designs, and in 2010, Seoul was designated the World Design Capital for the year"
  ],
  "Bar": [
    "All of us have our individual quirks including the President; the only difference being that they ought to keep the 'fun facts' hidden due to their career choice. Here we bring to you some facts about President Barack Hussein Obama II, the 44th President of the United States and the first African-American to hold the office. Let's find out some interesting facts about this magnificent orato"
  ],
  "San": [
    "Sandra Annette Bullock, one of the highest-paid Hollywood actresses and the recipient of an Academy Award. She is known for her roles in 'Speed,' 'While You Were Sleeping,' 'The Proposal' and 'The Blind Side.' Let's dig out some interesting facts about Sandra Bulloc",
    "Sandra has a longtime friendship with actor George Clooney. She also did a movie called \"Gravity\" with him in 2013. Not only she but her son Louis shares a great repo with Clooney"
  ],
  "Chichen-Itza": [],
  "Jos": [
    "Born in Singapore to a Eurasian family, Joseph schooling is the most sought-after swimmer of Singapore. Besides his swimming accolades, Schooling has many other things worth knowing. Here are some of the interesting facts about Joseph Schoolin",
    "Chinese migrants in Singapore are termed as the third generation Singaporean and Joseph Schooling is one of them.",
    "Joseph Schooling has a connection with the British Military as his great grandfather was an officer in the British Military.",
    "Before Joseph, his uncle- Lloyd Valberg also represented Singapore in the 1948 Olympic Games held in London.",
    "Joseph Schooling is a big fan of football and in an online interview revealed about his favorite football club- Chelsea."
  ],
  "Amsterdam": [
    "Open-hearted, welcoming, and prosperous, Amsterdam is a good-time city in Netherlands that merrily opens its arms to all arrivals. It embraces its tourists, its cyclists, its boat-folk, and its multi-cultural community. It is friendly, unflappable, and approachable; a city confident in its own skin but with one eye fixed on the future, buzzing with creativity and bonhomie. Let us know some interesting facts about this Venice of North, Amsterda",
    "City of Amsterdam is below the sea level. At its lowest point, it is 6.7 meters below sea level. If climate change causes even a small increase in global sea levels, Amsterdam may vanish.",
    "Residents of Amsterdam are the second largest consumers of Coffee in the world. On Average, an Amsterdam resident consumes a minimum of 140 liters of coffee per year or about 3.2 cups of coffee per day."
  ],
  "Oslo": [
    "As per the Norse sagas, Oslo was founded around 1049 by King Harald Hardråde. Recent archaeological research however has uncovered Christian burials which can be dated to prior to AD 1000, evidence of a preceding urban settlement. In 1624, the Fire destroyed the city. During the reign of King Christian IV, the city's name was Christiania.",
    "This city is very prominent for Music Festival. Music Lovers visit this city so often. There's the Inferno Metal Festival, Oslo International Church Music Festival in March, Norwegian Wood Rock Festival in June, then the Oslo Jazz Festival in August and the Oslo World Music Festival in November.",
    "Oslo is considered one of the most expensive city in the world. In 2013, it was ranked one of the most expensive city in the World but in 2016, it dropped out of top 10. Currently it is at 13th spot."
  ],
  "Pokhara": [],
  "Kathmandu": [
    "While most parts of the neighboring countries like India and China was once under foreign rule; Kathmandu had never been ruled by foreigners. No one has ever been able to conquer Kathmandu",
    "Kathmandu is covered with heritage monuments and other places of scenic beauty. This is the reason why it is chosen as the backdrop for many movies and TV series. So, you can always find some celebrity around the city of Kathmandu",
    "After the earthquake in Nepal on 25 April 2015, some parts of the city of Kathmandu was lifted vertically by around 3 feet which caused severe damage to various structures in the city"
  ],
  "Sur": [
    "Surabaya is the capital of East Java and the second largest city in the Republic of Indonesia. Surabaya consists of extremely diverse population and it serves as the bustling port of travel and trade. Let's know some interesting facts about this unique city of Indonesi",
    "While walking around Surabaya, take care of your belongings as this city has a high crime rate. People are advised to be careful while walking at night"
  ],
  "David": [
    "David Duchovny is an American actor, director, singer and songwriter, famous for his role as FBI agent Fox Mulder on the TV series The X-Files and Hank Moody in Showtime's comedy-drama series Californication. Here are some interesting facts about David Duchovn",
    "David William Duchovny was born on August 7, 1960, in New York. His father Amram was a writer and publicist, and his mother Margaret was a teacher and a school administrator",
    "Once The X-Files production had to shift from Vancouver to Los Angeles because David didn't like the separation from his then-wife, Tea Leoni"
  ],
  "Mala": [
    "Located partly on the Asian mainland and partly on the Northern Island of Borneo, Malaysia is truly Asia. It is one of the wealthiest countries in Southeast Asia with investments in technology industries and reasonable oil wealth. From sky gazing skyscrapers to exotic wildlife, Malaysia is sure to mesmerize you. Here we present some interesting facts about Malaysia worth knowin",
    "Malaysia is the only country in the world with its territory on both the mainland of Asia and the islands that form the Malay Archipelago. Yes, that's correct",
    "Tun is the most senior federal title in Malaysia, and there can only be 35 local living Malaysian recipients of the title at any one time",
    "Malaysia has nine different Royal Families, the highest in the world. Yang di-Pertuan Agong (The Malaysian King) is elected from these nine royal families to be the Head of State for a 5-year term",
    "The ultimate sunken treasure trove lies in the remains of Flor de la mar at the seabed of Malaysia's Strait of Malacca. The Portuguese ship headed by Admiral Afonso de Albuquerque is said to the richest ship ever lost in the sea with its holds loaded with around 200 coffers of gold, precious stones and diamonds",
    "Malaysia produces the most expensive and best quality crude oil in the world called 'Malaysian Tapis Blend 44°'"
  ],
  "Naga": [
    "Nestled in the lap of Himalayas, Nagarkot offers a breathtaking view of the highest peak in the world- The Everest. So near, yet so far away from the hustle and bustle of chaotic Kathmandu, Nagarkot, is a resort village located in the Kathmandu Valley of Nepal. It attracts tourists from far and wide due to its mountains and breathtaking views of sunset and sunrise. Let's unveil some interesting facts about Nagarko",
    "14 December 2005, was proved as a Black Day for Nagarkot when an off-duty soldier named Basudev Thapa opened fire indiscriminately at villagers, celebrating at the Kali Devi Temple in Nagarkot, killing 11 and injuring 19 people."
  ],
  "Mexico": [
    "Mexico is a country between the U.S. and Central America and is known for its Pacific and Gulf of Mexico beaches and its sundry landscape of mountains, deserts and jungles. Guacamole, Quesadillas, Tacos, Enchiladas!!! One shall not forget the mouth watering Mexican dishes which is popular worldwide. Let's dig deeper into the Mexican world to know about this exuberant country a little mor"
  ],
  "Goa": [
    "Filled with a plentitude of sightseeing attractions, Goa is a small state situated in the western region of India with coastlines stretching along the Arabian Sea. Goa is a very popular tourist destination in India, and, in fact, it is termed as the \"Fun Capital\" of India. Its sandy beaches, lively nightlife and world heritage architectural spots attract over 2 million international and domestic tourists every year. So let's check out some interesting facts about Goa that are sure to tempt you to visit this wonderful plac",
    "Goa is the only State in India with two official languages- Konkani and Marathi",
    "Goa is the only state in India with active and imposed Uniform Civil Code implemented by the Portuguese",
    "Some of the oldest rocks in India are found in Goa between Molem and Anmod. Classified as Trondjemeitic Gneiss, these rocks are over 3 thousands million years old"
  ],
  "Moro": [],
  "Mach": [
    "In the beautiful laps of the Andes Mountains in Peru, above the Urubamba River Valley, Machu Picchu is truly a gem of South America. Due to its spectacular location and history, it is crowned as one of the 7 wonders of the world. Here are some interesting facts about Machu Picch",
    "The city of Machu Picchu was divided into 3 parts such as the sacred district, popular district, and nobility district",
    "Despite the fact that Machu Picchu was not big in size, it was well optimized; as there are nearly 140 buildings in the city as well as over 100 flights of stone steps",
    "In 1983, UNESCO declared the Machu Picchu as a World Heritage Site",
    "Machu Picchu is counted among the 7 wonders of the world. However, not much description of the ruins can be seen at the site, which makes it anonymous",
    "There is a strange gateway rule in Machu Picchu that outsiders cannot wear native or customary clothes here",
    "The houses built at the Machu Picchu were earthquake resistant; the video shows how amazing the ancient technology wa"
  ],
  "Ita": [
    "Italy is quite exquisite when it comes to the architecture and culture. Often referred to as \"lo Stivale\" (the boot), it is a unitary parliamentary republic in Europe. The place is quite fascinating with its picturesque monuments and gardens. In order to really know what's inside, keep the following facts in mind about this boot-shaped countr",
    "\"Ferrari\" is the Italian equivalent of the last name \"Smith\""
  ],
  "Osa": [
    "Ōsaka is the third largest city in Japan, with a population of over 2.5 million people in its greater metropolitan area. It is the central metropolitan city of the Kansai region and the largest of the Osaka-Kobe-Kyoto trio.",
    "Osaka translates to \"large hill\" or \"large slope\". Mountains surround three sides of the Osaka prefecture and the west faces the arc-shaped Osaka Bay.",
    "Almost all of Osaka's historical monuments were destroyed in World War II bombing raids. Many of the city's important buildings and tourist attractions were also ruined and rebuilt after the war.",
    "Osaka has served as the capital of Japan many times. It is due to its status as a popular port with lots of trade and business opportunities.",
    "Osaka is well known for its vast underground shopping malls, its varied and magnificent food, and its friendly people. The people of Osaka are well known all over Japan for their friendliness and hospitality."
  ],
  "Moscow": [
    "Moscow is the largest European city having an area of 2511 square km and with a population of 12 million. This is usually the population of various countries such as Norway and Switzerland. Technically, Moscow is so huge that it deserves all rights to be a country.",
    "Moscow boasts one of the largest numbers of billionaires in the world. According to the Forbes, there are 84 billionaires in the city with the total wealth of 367 billion dollars.",
    "In Moscow, there are seven buildings that look exactly the same. They are two hotels, two administrative buildings, two blocks of flats, and the Moscow State University. Interestingly, they are called \"Stalin's skyscrapers\" or the \"Seven Sisters.\" These buildings a",
    "Hundreds of years ago, Russian cities had to pay a great tribute to Moscow. To avoid or delay the payment, the petitioners tried to persuade the Emperor to extend the repayment period. On the contrary, the emperor didn't believe in tears. From there, a very famous Russian saying Moscow doesn't believe in tears started.",
    "There is a huge myth about the brutally cold weather in Moscow, Russia. This is not correct. The climate is temperate. The city has the mild summer season.",
    "Moscow has recorded the lowest unemployment rate in Russia that is 1% as compared to the national figure of 7%. Thus, it makes Moscow a great city for finding employment."
  ],
  "Jeddah": [
    "Jeddah Tower also Known as Kingdom Tower and Mile-High Tower is a skyscraper under construction in Jeddah, city in Saudi Arabia at a preliminary cost of SR4.6 billion (US$1.23 billion). It will be built by 2019 completely and will be the tallest building in the Worl"
  ],
  "Duba": [
    "In 1991, Dubai had only one tall building, but now they have over 400 skyscrapers making Dubai one of the fastest growing cities in the world",
    "Burj Khalifa in Dubai is the tallest building in the world with a height of 828 m (830 m to tip) and 163 floors. Burj Khalifa is also home to the world's highest restaurant, highest mosque, highest nightclub, and highest observatory deck",
    "Yes, you heard it right! If you live in Dubai, you don't have to pay any personal income taxes",
    "Online shopping is a hassle in Dubai as it does not have an address system. Instead of a line for writing address, there is a space to draw a map or leave instructions like - \"My house is second from the mosque.",
    "In 2013, 40% of total physical gold is traded in Dubai and it weighed around 2 thousands tons. That's equivalent to the weight of 354 elephants",
    "There are no potholes or drains in Dubai as it rains only once or twice a year and that too in the winter season. So, be prepared for flash floods on a rainy day",
    "To enjoy a drink, even at the comfort of your home you must obtain a liquor license in Dubai",
    "Now, for a surprising fact, local people, called Emiratis, are in the minority in Dubai. Emiratis are just 15% of the total population. The majority of the population is split between India, Bangladesh, Pakistan and Western countries"
  ],
  "Singa": [
    "Located at the end of Malayan Peninsula between Indonesia and Malaysia, Singapore is an island City-State in Southeast Asia. Spreading across a land area of more than 714 square kilometers, Singapore is a beautiful and one of the most developed countries in Southeast Asia. Singapore has four official languages- English, Malay, Mandarin, and Tamil. Here are some interesting facts about Singapore that are sure to amuse yo",
    "Singapore is also known as \"Land of Acronyms.\" Whether it is a Highway, government agencies, skyscrapers, transportation modes or even the name of a human being (LKY - Lee Kuan Yew, First prime minister of Singapore) have acronyms. Some usual acronyms are MOE - Ministry of Education, SBS - Singapore Bus Service, MRT - Mass Rapid Transit, CTE - Central Expressway and GST - Goods and Services Tax",
    "Yes, you heard it right! If you ever manage to get a $1000 note (which is not readily available) turn it over and you will find micro text lyrics of the Singaporean national anthem. It's amazing",
    "Singapore comes on TOP in the list of countries having ease of doing business worldwide. It has been ranked no.1 successively for 7 years by the World Bank. Singapore is first in the world to have the best protection of intellectual property. It is also ranked as the 3rd most competitive country in the world"
  ],
  "Singapore": [
    "Located at the end of Malayan Peninsula between Indonesia and Malaysia, Singapore is an island City-State in Southeast Asia. Spreading across a land area of more than 714 square kilometers, Singapore is a beautiful and one of the most developed countries in Southeast Asia. Singapore has four official languages- English, Malay, Mandarin, and Tamil. Here are some interesting facts about Singapore that are sure to amuse yo",
    "Singapore is also known as \"Land of Acronyms.\" Whether it is a Highway, government agencies, skyscrapers, transportation modes or even the name of a human being (LKY - Lee Kuan Yew, First prime minister of Singapore) have acronyms. Some usual acronyms are MOE - Ministry of Education, SBS - Singapore Bus Service, MRT - Mass Rapid Transit, CTE - Central Expressway and GST - Goods and Services Tax",
    "Yes, you heard it right! If you ever manage to get a $1000 note (which is not readily available) turn it over and you will find micro text lyrics of the Singaporean national anthem. It's amazing",
    "Singapore comes on TOP in the list of countries having ease of doing business worldwide. It has been ranked no.1 successively for 7 years by the World Bank. Singapore is first in the world to have the best protection of intellectual property. It is also ranked as the 3rd most competitive country in the world"
  ],
  "Pala": [
    "The National Palace Museum and the Palace Museum in the Forbidden City, Beijing are not the same museum. But, anyhow these two have the same roots. These two were once a single museum which split in two as a result of the Chinese Civil War in the country. The National Palace Museum was first built in the Forbidden City but later was moved after the reign of the last emperor of China.",
    "In 2004, the National Palace Museum began the construction of a southern branch of the museum in Chiai. The branch has now been completely established and is a major crowd puller, both local and international visitors. It is believed that this was done in order to increase Taiwan's international visibility.",
    "The National Palace Museum is a fully contemporary museum. It participates in Taiwan's National Digital Archives Program, by making the use of the latest digital technology to digitally preserve its ancient artifacts and antique things. This is done in order to improve the overall experience of the visitors."
  ],
  "Kara": [
    "In Karakoram Mountains, even in the warmest months the temperature sinks lower than 32 degree F (0 degree Celsius). In extreme conditions, the formation of snow hummocks of height 3ft or even more is common there.",
    "The word Karakoram is a Turkic word that means 'black gravel.' European travelers used the term Muztagh (meaning, \"Ice Mountain\") for the range.",
    "There are so many different ethnicities, traditions, languages, and people in the Karakoram. Despite its geography and mix of people, the Karakoram Range has an identity of its own. There are also six main local languages aside from Urdu spoken by the people of the Karakoram: Bali, Burushaski, Kalasha, Khowar, Shina, and Wakhi. Some people also know English.",
    "Only in dreams, one can traverse the Karakoram Range. However, you need not worry as here you can fly over the white paradise virtually. video: youtu"
  ],
  "Bangkok": [
    "You must be thinking Bangkok is not the longest city name in any way but look at its traditional Thai name - \"Krung Thep Mahanakhon Amon Rattanakosin Mahinthara Yuthaya Mahadilok Phop Noppharat Ratchathani Burirom Udomratchaniwet Mahasathan Amon Piman Awatan Sathit Sakkathattiya Witsanukam Prasit.\" Yes, that's the complete Thai name of Bangkok and has been listed as the longest name for a place in the Guinness Book of World Records",
    "Leaving the house without underwear in Bangkok can lend you in jail. It is also illegal to drive a vehicle bare-chested. And be careful, do not step on Thai currency as it is also against the law",
    "Thailand is home to around 200 thousands millionaires, and around 95% of them live in Bangkok",
    "While summer temperatures are not extreme in Bangkok, it is the world's hottest city because of average high temperatures year-round. With the average temperature of 88 degrees Fahrenheit throughout the year, Bangkok is sure to make you sweat even in December"
  ],
  "Mary": [
    "On December 14, King James V passed away when Mary was only six days old. Thus, Mary acquired the throne and became the Queen of Scots. Mary's coronation took place on September 9, 1543, at Stirling Castle",
    "Haddington treaty was signed in 1548 that promised marriage of Mary Queen of Scots to Dauphin Francis in return for French military help to besiege Haddington from English. With the marriage agreement in place, five-year-old Mary was sent to France to spend the next thirteen years of her life at the French court",
    "On August 19, 1561, Mary returned to her homeland, miserable and dejected. On her voyage back from France to Scotland, she even wrote a poem 'Farewell, my dearest homeland.",
    "In February 1567, Darnley was mysteriously found murdered in the garden following a blast at Kirk o' Field, apparently asphyxiated, but there were no discernible signs of brutality on the body.Treachery was suspected, and various names came under the scanner including Mary",
    "On May 2, 1568, Mary escaped from Loch Leven with the aid of the castle's owner. After a futile endeavor to regain the throne, Mary then fled towards England, seeking the shield of her first cousin, Elizabeth I. But instead of helping Mary, Elizabeth I detained her and kept her as a prisoner for almost 20 years before executing her",
    "On 11 August 1586, Mary was associated with the Babington Plot because of the letters disclosed by Elizabeth's spymaster. Mary was brought to trial & found guilty of treachery"
  ],
  "Van": [
    "Vancouver, Canada had been ranked first since 2002. However, Vancouver was lately ranked as the third most \"livable place in the world.\" It is so because of its high standard of living and superiority of life. The city is also ranked as the 10th cleanest city in the world.",
    "The Prohibition Commissioner of Vancouver couldn't resist to the tempting profits of bootlegging and was arrested and put in jail. Walter Findlay, stubborn in the fight against alcohol, was arrested for the import and sale of liquor in December 1918, less than one year into his position as commissioner."
  ],
  "Antalya": [
    "Situated on the Gulf of Antalya, a Turkish city, Antalya is very much a popular destination of tourists from around the world. Antalya is beautifully sprawled on the western Mediterranean coastline and hence, offers wonderful scenic views. With a population of one million people, Antalya is known to be Turkey's largest city within that area. If you are planning to pay Antalya's long sunny beaches and museums a visit, make sure you go through these few interesting facts about the Turkish resort city, Antaly",
    "The city was known as Attaleia, Attalia, Satalia, and Andalya as it was founded by the king of Pergamum, Attalus II. Later, it came to be known as Antalya.",
    "Antalya is the fifth most populous city in Turkey with over one million people in its urban area."
  ],
  "Montgomery": [
    "Montgomery was first settled by Palatine Germans from the middle Rhine region of Europe. Henry Wileman, who came here in 1710, is considered as the first settler of the region",
    "As it is clear that the town was inhabited by mostly Germans, so, the town Montgomery was first named as Hanover in 1772. But, 10 years later, the Town was renamed as Montgomery in the honor of Richard Montgomery who died in the Battle of Quebec in 1775"
  ],
  "Jupiter": [
    "Named after the King of the Gods, Jupiter, the fifth and the largest planet in our Solar System. Jupiter is, in fact, the synonym of \"Gigantic.\" Besides being the largest member of the Solar System, Jupiter has many other aspects worth knowing. Let's explore some interesting facts about this Gas Gian",
    "Jupiter is a planet with a unique composition. In its center, an ocean is situated, and this ocean is of liquid metal i.e. metallic hydrogen. This ocean of liquid metal is surrounded by an envelope of hydrogen and helium gas with a thickness ranging up to thousands of kilometers",
    "The mass of Jupiter equates to the mass of 317 Earths! Also, Jupiter is so huge that when lined up in a straight line, it would take about 11 Earth to reach from one end of Jupiter to another. You can fit about 1300 Earth inside Jupiter. Isn't Jupiter huge",
    "Jupiter is such a slow-moving planet that it takes about 11.8 Earth years for this planet to make one orbit around the Sun",
    "Even though Jupiter orbits very slowly around the sun, yet it is the fastest spinning planet in the entire Solar System. One rotation of Jupiter about its axis takes a mere 10 hours! It is rotating so fast that the planet has started to bulge at equator while flattening out at other places",
    "In our Solar System, Sun is the greatest source of radiation, and all planets are visible due to this radiation. Jupiter is one planet, which creates its own radiation even though its light is not as radiant as that of the Sun's",
    "Jupiter emits radiation but it can never become a star. The reason being that there is not enough mass in Jupiter to create the necessary core conditions to become a star"
  ],
  "Miami": [
    "Miami's metro area is the eighth most populous and fourth-largest urban land in the United States holding a population of around 5.5 million people. It is also known to be the second-most populous metropolis in the Southeastern U.S.",
    "A lot of gold and silver has been found on and offshore by people who have visited Miami Beach. It is believed that pirates such as Blackbeard and Gasparilla left many treasures buried in the Miami Ocean.",
    "Miami is located on the Atlantic coast. If we go precise, it is located at some 2° north of the Tropic of Cancer, and thus has a warm marine climate. The city remains hot with an average temperature of about 24° C.",
    "The first Burger King opened in Miami in the year 1954. Three years after, they introduced the Whopper at 37 cents a burger."
  ],
  "Orlando": [
    "Another interesting fact about Orlando is that before being known by its current name, it was called Jernigan after the first permanent settler of the area.",
    "The official nickname of the city of Orlando is \"The City Beautiful, because of the splendid beauty of the city. Apart from these, the city has several other nicknames such as 'O-Town', 'City Different' and 'City Phenomenal.'",
    "There is a bit of confusion as to how the name Orlando was derived. Some say it belonged to a soldier during the Second Seminole War, while others claim it belonged to a man who died on his way to Tamps and was buried."
  ],
  "Independence": [
    "Every year the whole nation of India fathoms the patriotic feeling with the tricolor of saffron, white and dark green on 15 August, which is celebrated as the Independence Day in India. Here are some interesting facts about India's Independence da",
    "Mahatma Gandhi, the chief architect of the Independence, did not participate in the celebrations. Instead, did a fast for the entire day in Calcutta, witnessing the flames of communal violence in Bengal between the Muslims and Hindus"
  ],
  "Central": [
    "Did you know that Central Park in New York is one of the most filmed locations in the world? Or that it is designated as National Historic Landmark? Well, there's so much more to know about this picturesque park than to just go and run in the bright sunshine. Here we are with some interesting facts about the par",
    "Central Park is also a home to the US' biggest Carousel which is a 54-horse marry-go-round. The vintage treasure was found abandoned in an old trolley terminal in Coney Island",
    "Central park is the most filmed location. Many movies have featured it including Romeo and Juliet, An Affair to Remember, When Harry Meets Sally, and Breakfast at Tiffany's",
    "According to a local census, 30 people called Central Park as their home. Though it has never had any permanent resident living there",
    "The reason for undertaking the Central park project was to show the European countries that the emerging cities of America were becoming culturally refined and are aware of their duties towards their citizens"
  ],
  "Highland": [
    "Highland houses many libraries. These libraries date back to the 19th and 20th century. Most famous libraries are Hillsboro Library, Greenfield Library, Leesburg Library, Lynchburg Library, etc",
    "Highland Sanctuary is an arc of Appalachia's oldest and largest preserve. Its area is around 2600 acre and famous for its beautiful Gorge, a 100-foot high steep-walled canyon recognized for its stunning rock formations",
    "In terms of ancestry, Highland is inhabited by mostly Europeans. According to the 2010 census statistics, 23.8% were Germans, 15% Irish, 10.7% English, etc. Only 14.3% were Native Americans in the region"
  ],
  "Taylor": [
    "A beautiful, inspiring and hugely talented singer and songwriter, Taylor Swift has earned a lot of fame in few years of her career. Since her arrival in the music world, this singer has shown a wide range in her singing and great maturity in her writings for which she has been appreciated and awarded. The more you know her, the more you fall for her. So, here are some interesting facts about Taylor Swift worth knowin",
    "At 20 years, 49 days, Taylor Swift became the youngest artist to win the prestigious Grammy Award; for her Album 'Fearless'",
    "The famous show 'Saturday Night Live' generally have writers to take care of celebrity's host monologue, but Taylor was the first one to come up with her own song called 'My Monologue Song."
  ],
  "Brooklyn": [
    "Brooklyn bridge, also called as the 8th wonder of the world, was built \"to bridge\" the gap between the two city hall's of Manhattan and Brooklyn. Before the bridge, the only way to travel was by a ferry and so the two mayors decided upon building a bridge and hence we have it no",
    "Of course after Emily, the first one to the cross the bridge was a rooster! Yes, it's true! In fact Emily carried the rooster from the Brooklyn side to the Manhattan side as a symbol of victory",
    "The debt of the bridge was paid by renting out a wine cellar for $1 thousands per year. There was a second cellar on the Brooklyn side which was rented for $500 per year",
    "Brooklyn bridge was initially called the New York and Brooklyn bridge, then it was changed to East River Bridge and finally to Brooklyn bridge in 1915",
    "Brooklyn Bridge is the busiest in the America since 100 thousands vehicles commute to the other side excluding 4 thousands pedestrians and 2 thousands cyclists"
  ],
  "Arvin": [
    "Former Professor of Columbia University and the incumbent Vice-Chairman of the newly created NITI Aayog, Arvind Panagariya is one of the most eminent economists in the world. Known for his economic development policies, Arvind Panagariya has some more feathers to his cap. Here are some of the interesting facts about him and his worthy lif",
    "Arvind Panagariya has been very argumentative from his childhood and has always loved to have detailed-discussions over the prevailing economic scenarios of the country.",
    "Arvind Panagariya's father was born in poverty and struggled for his education at every step in his life. However, he never compromised with Arvind's education and provided him with the best possible education of that time."
  ],
  "Stockton": [
    "Yes! this city has an inland port, the port of Stockton. The port is an inland deepwater port situated on San Joaquin River",
    "Due to the increasing crime rate, Stockton is not a safe place to live. In 2017, as many as 5 thousands criminal activities per 100 thousands residents were reported",
    "The city of Stockton went bankrupt in 2008 financial crisis. In July 2012, Stockton was the largest city in the United States to file bankruptcy protection. However, in 2015, the city resolved the problem"
  ],
  "Virginia": [
    "Just when you think you know everything about \"Old Dominion\" you'll be up for a surprise. From a ridiculous number of Presidents who hailed from Virginia to the world renowned Foamhenge, Virginia will keep you on your toes. Here is a handful of interesting facts about Virgini",
    "I bet this would double the pride of Virginians for their homeland to know that much of the land we now call the United States was simply \"Virginia.\" All new lands discovered by the British were initially named \"Virginia,\" to honor the \"Virgin Queen\" Elizabeth I. Everything north of Spanish territory in Florida and south of French territories in modern day Canada were named \"Virginia.\" Isn't that cool…",
    "Show you love for Virginia with these cool Virginia Merchandise. Click Belo",
    "Virginia has been nicknamed the \"Mother of States\" because of the number of states that were \"born\" in the Virginia territory. West Virginia, Ohio, Kentucky, Illinois, Indiana, Wisconsin and, even a part of Minnesota were all a part of the original Virginia territory and formed using sections of the state",
    "Select some George Washington merchandise for your collection:19. Beware of the Virginian Law",
    "Show you love for Virginia with these cool Virginia Merchandise. Click Belo"
  ],
  "George": [
    "George Clooney is an Oscar-winning American actor, filmmaker, and activist. He's well known for playing Dr. Doug Ross on TV's 'ER' and Danny Ocean in the 'Ocean's Eleven' films. Here are some interesting facts about George Clooney you may find fascinatin",
    "During his struggling days, George lived in a friend's closet and rode a bicycle to get to auditions",
    "Clooney prefers letters instead of email to maintain confidentiality. George also hand writes scripts because, he says, \"I like paper."
  ],
  "Istanbul": [
    "You will find a mosque in every corner of Istanbul. It has a total of 3 thousands mosques, maximum in Turkey",
    "Despite being the capital of many great ancient empires - Byzantine, Roman, Ottoman, Istanbul is not the modern day capital of Turkey. The capital of Turkey is Ankara",
    "Istanbul was called Byzantium by Megarian colonists in 660 BC. After that, when Roman Emperor Constantine the Great made it the capital of the Eastern Roman Empire, it took the name of Constantinople. In 1930, it was officially renamed Istanbul, but as the people continued to call it Constantinople, the Turkish post office didn't deliver any mail addressed to Constantinople for many years just to ensure that people use the new name"
  ],
  "Pattaya": [
    "The name Pattaya is only some years old. It was previously called Tappaya. it is believed this area is where the troop of Phraya Tak (King Taksin) rested when marched to Chantaburi almost 300 years ago. The name later became \"Pattaya\" which is less tongue twist.",
    "East Pattaya is nicknamed \"Darkside\". Traces dates back to the days when the eastern side of the Pattaya would fall into darkness at the certain time and eastern side of the Pattaya is quieter than central Pattaya."
  ],
  "Agra": [
    "Agra fort, as the name implies, is a UNESCO World Heritage Site located in Agra, Uttar Pradesh. It is about 2.5 kilometre distant to Taj Mahal, one of the seven wonders of the world. The present-day structure was made by the Mughals, though it is said that it has stood here by the name of \"Badalgarh\" since the 11th century. Have a look at more interesting history facts"
  ],
  "Petra": [
    "Constructed around 312 BC as the capital of the Nabataeans, Petra truly reflects the heritage of Jordan. This wonder of the world is half-built and half-carved into the rock. It is a small desert valley covered by towering sandstone cliffs on the edges of the Wadi Araba desert. Here are some interesting facts about Petra, Jorda",
    "Petra got its name from a feminine Greek word \"Petros\" which means \"rocks.\" Its other name is Al-Batra in Arabic; however, it's famous as \"Petra.",
    "Petra is often called 'Rose City' because of the rose-red colored sandstone hills. It is well surrounded by the red-tinged mountains, which makes a reddish appearance",
    "Johann Ludwig Burckhardt, a Swiss explorer, discovered Petra in 1812. As it was an unknown entity for about 5 centuries, it is also called the 'Lost City.",
    "Petra is an enormous city of tombs, monuments and sacred structures carved into stone cliffs. It has around 800 carved tombs, and because of this, Petra is also denoted as \"Royal Tombs.",
    "Indiana Jones and the Last Crusade, a famous American adventure film of 1989 was filmed here. The fictional Canyon of the Crescent Moon was filmed on the eastern entrance of the Petra",
    "Petra was the city of traders and hence was commercially vibrant and was once the house of many treasures. But due to its structural weakening, its treasures were stolen over the years",
    "The most of the Petra was made in 3 different periods- the Edomites (18th-2nd century BC), the Nabateans (2nd century BC- 106 BC) and the Romans from (106 - 395 BC) but the remains left are mainly of the Nabateans period"
  ]
}