{
  "banana bread": [],
  "Cream cheese": [],
  "Mozzarella": [],
  "Candy": [],
  "Ice cream": [],
  "Caramel": [
    "Many candies and desserts are made with caramel. Some of these are caramel apples, pralines, nougats, brittles, crème caramel, and crème brûlée."
  ],
  "Cheesecake": [],
  "Chocolate chip cookie": [],
  "Cupcake": [],
  "Cannoli": [],
  "Creme-Brulee": [],
  "Doughnut": [],
  "Danish": [],
  "Fudge": [],
  "Gingerbread": [],
  "Jell-O": [
    "Fresh pineapple, papaya, kiwifruit, and ginger root cannot be used because they contain enzymes that prevent gelatin from \"setting\"."
  ],
  "Molten chocolate cake": [],
  "Oreo": [],
  "Pudding": [],
  "Pancake": [],
  "Rice pudding": [],
  "Tiramisu": [],
  "Waffle": [],
  "Apple pie": [
    "An apple pie is a pie in which the principal filling ingredient is apple.",
    "It is often served with whipped cream, ice cream (\"apple pie à la mode\"), or cheddar cheese.",
    "English apple pie recipes go back to the time of Chaucer. The 1381 recipe is the earliest known apple pie recipe in the world, and lists the ingredients as good apples, good spices, figs, raisins and pears.",
    "It wasn't until the 15th century that Dutch bakers transformed the crust-less apple pie into the lattice-style pastry we commonly see today.",
    "The apple pie had to wait for the planting of European varieties, brought across the Atlantic, to become fruit-bearing apple trees, to be selected for their cooking qualities as there were no native apples except crabapples, which yield very small and sour fruit. That happened during the 17th and 18th centuries when the British, Dutch, and Swedes brought some apple varieties good for pies.",
    "There are American apple pie recipes, both manuscript and printed, from the 18th century, and it has since become a very popular dessert.",
    "America's first cookbook, American Cookery, includes two recipes for apple pie, neither claiming the roots of the recipe.",
    "Today, apple pie is the most popular flavor in America, followed by pumpkin, chocolate, lemon meringue and cherry – according to the American Pie Council.",
    "The saying \"as American as apple pie\" describes things that represent the best of American culture. People use this expression when talking about things like blue jeans, baseball and rock-n-roll music.",
    "The primary origins of \"as American as apple pie\" are difficult to pinpoint, but it was used as early as 1928 to describe the home-making abilities of Lou Henry Hoover (President Herbert Hoover's wife). The next result we could dig up, a Times article in which the phrase is enlisted to describe lynchings, comes nearly a decade later. It is fair to assert that though the phrase was floating around in the early 20th century, it was seldomly used.",
    "It wasn't until the 1940s, when the United States entered World War II, that \"as American as apple pie\" truly took off. When journalists at the time asked soldiers why they were willing to fight in the war, the typical response was \"for mom and apple pie.\" By the 1960s, the phrase transformed into \"American as apple pie.\""
  ],
  "Hot dog": [],
  "Buffalo Wings": [],
  "pizza": [],
  "Bacon": [],
  "Bagel": [],
  "burrito": [],
  "sausage": [],
  "Eggs": [],
  "muffin": [
    "The apple muffin is the official state muffin of New York."
  ],
  "French toast": [],
  "Fruit": [],
  "Ham": [],
  "Omelette": [],
  "Orange": [],
  "Poached egg": [],
  "Sausage": [],
  "Smoothie": [],
  "Toast": [],
  "Tart": [
    "Norman tart is a shortcrust pastry-based variant of the apple tart made in Normandy filled with apples, sliced almonds and sugar, topped with creamy egg custard and baked until the topping is slightly caramelised. It is also known in French as the Tarte Normande."
  ],
  "Yogurt": [],
  "Butter": [],
  "Compote": [
    "The fruit can be cooked whole or cut into pieces and almost anything can be used – apples, pears, apricots, peaches, plums, figs, and berries.",
    "In modern French, the term refers to usually unsweetened fruit purée without fruit chunks, such as applesauce."
  ],
  "Honey": [],
  "Jam": [
    "Pectin is a naturally occurring substance found in berries, apples and other fruit. When heated together with sugar, it causes a thickening that is characteristic of jams.",
    "Recipes without added pectin use the natural pectin in the fruit to set. Tart apples, sour blackberries, cranberries, redcurrants, blackcurrant, gooseberries, grapes, plums, and quinces work well in recipes without added pectin.",
    "Meanwhile, Louis XIV was so passionate about it that he insisted that every meal be finished with jams served in special ornate silver dishes. All of his was made from the fruit gardens at Versailles – and as they included tropical varieties like pineapple there must have been some interesting flavours indeed.",
    "Although the immigrants to the US brought their own recipes with them, the first book on making jam appeared in this country in the 17th century. Early settlers in New England used other ways of making jam, using molasses, honey and maple sugar to give it the sweet taste. They used pectin obtained from boiling apple peel to use as the thickening agent."
  ],
  "Jelly": [],
  "Maple syrup": [],
  "Margarine": [],
  "Nutella": [],
  "Peanut butter": [],
  "Chocolate milk": [],
  "Coffee": [],
  "Hot chocolate": [],
  "Milk": [],
  "Tea": [],
  "Artichokes": [],
  "Arugula": [],
  "Asparagus": [],
  "Avocados": [
    "Once picked, avocados ripen in one to two weeks (depending on the variety) at room temperature (faster if stored with other fruits such as apples or bananas, because of the influence of ethylene gas)."
  ],
  "Basil": [],
  "Beets": [],
  "Broccoli": [],
  "Carrots": [],
  "Cauliflower": [],
  "Corn": [],
  "Cucumber": [],
  "Eggplant": [
    "When first introduced in Italy, people believed that anyone who ate the \"mad apple\" was sure to go insane."
  ],
  "Fennel": [],
  "Garlic": [],
  "Figs": [],
  "Kohlrabi": [],
  "Kumquats": [],
  "Mushrooms": [],
  "Nectarines": [],
  "Lettuce": [],
  "Parsley": [],
  "Passion-Fruit": [],
  "Peaches": [
    "The Ancient Romans referred to the peach as malum persicum \"Persian apple\", later becoming French pêche, hence the English \"peach\"."
  ],
  "Plums": [],
  "Potatoes": [],
  "Radish": [],
  "Raspberries": [],
  "Spinach": [],
  "Strawberries": [],
  "Tomatoes": [
    "The first tomatoes in Europe may originally have been yellow. They were first referred to in writing as ‘pomo d'oro', meaning ‘golden apple'."
  ],
  "Turnips": [],
  "Apples": [
    "The apple tree originated in Central Asia. They have been grown for thousands of years in Asia and Europe, and were brought to North America by European colonists.",
    "There are more than 8 thousands varieties of apples – the largest variety of fruit to exist.",
    "The apple tree generally standing 1.8 to 4.6 meters (6 to 15 feet) tall in cultivation and up to 12 meters (39 ft) in the wild.",
    "Life expectancy for apple tree is about 100 years.",
    "China is by far the largest apple producer.",
    "Most of the anti-oxidants in apples, including Quercetin, are found in the skin.",
    "A medium sized apple contains 80 calories.",
    "The soluble fiber contained in apples is called pectin, and can help lower cholesterol levels.",
    "To produce one apple, it takes energy from 50 leaves.",
    "Pomology is the science of apple-growing.",
    "The apple genome was decoded in 2010.",
    "The most expensive apple in the world is Sekai Ichi apple it cost $21.00 each. Sekai ichi means \"world's number one\" in Japanese.",
    "The largest apple ever weighed 1.849 kg (4 lb 1 oz) and was grown and picked by Chisato Iwasaki at his apple farm in Hirosaki City, Japan October 24 2005.",
    "In Norse mythology, the goddess of youth, Idun was believed to grow magic apples that kept the gods youthful.",
    "In the Chinese culture, the word for apples is pronounced as ‘ping' which also stands for peace. This is why apples are a popular gift to give when visiting someone in China.",
    "There is a classic story that Sir Isaac Newton came up with his law of gravity when an apple fell on his head.",
    "The most famous saying involving apples is, \"An apple a day keeps the doctor away.\"",
    "The fear of apples is known as Malusdomesticaphobia."
  ],
  "Apricots": [],
  "Blackberries": [
    "The soft fruit is popular for use in desserts, jams, seedless jelly, and sometimes wine. It is often mixed with apples for pies and crumbles. Blackberries are also used to produce candy."
  ],
  "Blueberries": [],
  "Cabbage": [],
  "Eggplants": [
    "When first introduced in Italy, people believed that anyone who ate the \"mad apple\" was sure to go insane."
  ],
  "Grapes": [],
  "Kale": [],
  "Lemons": [],
  "Melons": [],
  "Mustard": [],
  "Peppers": [],
  "Persimmons": [
    "Persimmons are eaten fresh, dried, raw, or cooked. When eaten fresh, they are usually eaten whole like an apple in bite-size slices, and may be peeled. One way to consume ripe persimmons, which may have soft texture, is to remove the top leaf with a paring knife and scoop out the flesh with a spoon."
  ],
  "Tomatillos": [],
  "Celery": [],
  "Chili Pepper": [],
  "Cranberries": [],
  "Green Beans": [],
  "Kiwi": [],
  "Leeks": [],
  "Limes": [],
  "Onions": [],
  "Oranges": [],
  "Parsnips": [],
  "Pears": [],
  "Pumpkins": [],
  "Quinces": [
    "The quince is a hard, acid pear-shaped fruit that belongs the family Rosaceae (which also contains apples and pears, among other fruits).",
    "Because apples were unknown in the ancient world, a quince might well have tempted Eve, and the golden apples of the Hesperides, given to Aphrodite by Paris of Troy, were probably quinces, too."
  ],
  "Radishes": [],
  "Sweet Potatoes": []
}