{"France": {"capital": "Paris", "sight": "the Louvre", "description": "It is the home of some of the best-known works of art, including the Mona Lisa and the Venus de Milo.", "climate": "The climate in Paris is continental and therefore mild.", "best_time": "For the warmest temperatures, October and April are the best times to visit Paris sans crowds."}, "Spain": {"capital": "Paris", "sight": "Museo Nacional del Prado", "description": "Among its extensive assortment of artworks are many masterpieces, including celebrated paintings that rival the most famous works of the Louvre Museum in Paris.", "climate": "Madrid and its metropolitan area has a Mediterranean climate.", "best_time": "The best time to visit Madrid is in the fall (September to November) or spring (March to May), when balmy temps blow through the city, making it come alive."}, "United States": {"capital": "Washington, D.C.", "sight": "United States Capitol and Capitol Hill", "description": "Recognized around the world as a symbol of the United States, the Capitol is the seat of the House of Representatives and the Senate.", "climate": "Washington has two distinct climate zones. Mild, humid, summer days west of the Cascades rarely rise above 26°C (79°F), and winter days seldom drop below 8°C (46°F) while the east of the state has warm summers and cool winters.", "best_time": "The best times to visit Washington, D.C., are from September to November and March to May."}, "China": {"capital": "Beijing", "sight": "The Palace Museum and the Forbidden City", "description": "It's China's most significant attraction and can trace its origins back to the Yuan Dynasty of the 13th century.", "climate": "In Beijing, there is a continental climate, with cold, sunny winters and hot, sultry, and rainy summers.", "best_time": "The best times to visit Beijing are from March to May and from September to October."}, "Italy": {"capital": "Rome", "sight": "Colosseum", "description": "It's the large amphitheatre that housed 65,000 spectators in Roman days.", "climate": "Rome has a Mediterranean climate with cool winters and generally hot summers.", "best_time": "The best time to visit Rome is from October to April when most of the tourist crowds have dissipated and room rates are lower."}, "Turkey": {"capital": "Ankara", "sight": "Museum of Anatolian Civilizations", "description": "It's the only place in the country where you can grasp the full scope of Anatolia's pre-Classical-era human history.", "climate": "The climate is warm and temperate in Ankara.", "best_time": "June-September is the best time to visit Ankara."}, "Mexico": {"capital": "Mexico City", "sight": "Zócalo: The Birthplace of the Constitution", "description": "Measuring some 240 meters in each direction, it's one of the world's largest squares and was laid out almost immediately after the conquest of the former Aztec city of Tenochtitlán on which it stands.", "climate": "Mexico City has a subtropical highland climate, with warm summers and mild winters, and an annual average temperature of 64°F (18°C).", "best_time": "The best time to visit Mexico is during the dry season between December and April, when there is virtually no rain."}, "Thailand": {"capital": "Bangkok", "sight": "the Grand Palace", "description": "Built in 1782, the grand palace was the royal residence for generations and is still used for important ceremonies and accommodating heads of state.", "climate": "Bangkok enjoys a tropical monsoon climate, meaning that it has 3 main seasons: hot season from March to June, rainy season from July to October, and cool season between November and February.", "best_time": "While it won't make a huge difference, late November and early December is the best time to visit Bangkok, when the city is drying out from the monsoon season and experiencing a slight cool down, and the holiday crowds have yet to arrive."}, "Germany": {"capital": "Berlin", "sight": "Reichstag", "description": "When the decision was made to move the Federal Government to Berlin, it was time to reawaken the Reichstag building from its long years of slumber on the Mauerstreifen, the military zone between the two sides of the Wall.", "climate": "It has a temperate continental climate.", "best_time": "The best time to visit Berlin is May through September, when the weather is ideal for cafe sitting, park lazing and leisurely city strolling."}, "United Kingdom": {"capital": "London", "sight": "Warner Bros. Studio", "description": "It's a place where you can see first-hand the sets, costumes and props used in all the Harry Potter films, and step inside some of the films' locations, including the Great Hall, Dumbledore's office and Hagrid's hut.", "climate": "Modern London has the equable climate of South East England, with mild winters and temperate summers.", "best_time": "The best time to visit London is March through May when the temperatures are mild and the city's parks are green and blooming."}}