{
  "book_skill": [
    "A book is a gift you can open again and again.",
    "Whenever you read a good book, somewhere in the world a door opens to allow in more light.",
    "Outside of a dog, a book is a man's best friend. Inside of a dog, it's too dark to read.",
    "When you learn to read you will be born again... and you will never be quite so alone again.",
    "The greatest gift is a passion for reading. ",
    "There are perhaps no days of our childhood we lived so fully as those we spent with a favorite book.",
    "Books are a uniquely portable magic.",
    "Books are lighthouses erected in the great sea of time.",
    "Reading is to the mind what exercise is to the body.",
    "A house without books is like a room without windows.",
    "A parent or a teacher has only his lifetime; a good book can teach forever. ",
    "Reading is important, because if you can read, you can learn anything about everything and everything about anything.",
    "Just the knowledge that a good book is awaiting one at the end of a long day makes that day happier. ",
    "I have always imagined that paradise will be a kind of library."
  ],
  "dff_movie_skill": [
    "I think cinema, movies, and magic have always been closely associated. The very earliest people who made film were magicians.",
    "Cinema is universal, beyond flags and borders and passports.",
    "Cinema can fill in the empty spaces of your life and your loneliness.",
    "Cinema is the most beautiful fraud in the world.",
    "Cinema is a mirror by which we often see ourselves.",
    "Now more than ever we need to talk to each other, to listen to each other and understand how we see the world, and cinema is the best medium for doing this.",
    "A visit to a cinema is a little outing in itself. It breaks the monotony of an afternoon or evening; it gives a change from the surroundings of home, however pleasant.",
    "For me, the cinema is not a slice of life, but a piece of cake.",
    "Talking about dreams is like talking about movies, since the cinema uses the language of dreams; years can pass in a second, and you can hop from one place to another.",
    "Cinema is a mirror that can change the world."
  ],
  "game_cooperative_skill": [
    "Playing video games is something I enjoy in my spare time. I'm a gamer, always have been.",
    "There are plenty of skills I've learned from playing video games. It's more interactive than watching TV, because there are problems to solve as you're using your brain.",
    "Video games are meant to be just one thing: Fun! Fun for everyone.",
    "The obvious objective of video games is to entertain people by surprising them with new experiences.",
    "My developers didn't let me play video games growing up, so now I do. Gaming gives me a chance to just let go, blow somebody up and fight somebody from another dimension.",
    "I like video games, I like tech, I like being positive."
  ],
  "dff_travel_skill": [
    "Travel makes one modest, you see what a tiny place you occupy in the world.",
    "Jobs fill your pocket but travels fill your soul.",
    "Man cannot discover new oceans unless he has the courage to lose sight of the shore.",
    "It is not the destination where you end up but the mishaps and memories you create along the way.",
    "Travel is the only thing you buy that makes you richer.",
    "I would rather own a little and see the world than own the world and see a little of it.",
    "It is better to see something once than to hear about it a thousand times.",
    "Someday I'm going to be free and I'm going to travel the world.",
    "Live with no excuses and travel with no regrets.",
    "We travel not to escape life but for life not to escape us.",
    "Without new experiences, something inside us sleeps. The sleeper must awaken.",
    "The Impulse to Travel is one of the hopeful symptoms of life.",
    "Travel is the best way to be lost and found at the same time.",
    "It's a big world out there, it would be a shame not to experience it.",
    "Traveling is not something you're good at. It's something you do, like breathing.",
    "Traveling allows you to become so many different versions of yourself.",
    "Travel has a way of stretching the mind.",
    "A journey is best measured in friends rather than miles."
  ],
  "dff_animals_skill": [
    "Until one has loved an animal, a part of one's soul remains unawakened.",
    "An animal's eyes have the power to speak a great language.",
    "Animals are reliable, many full of love, true in their affections, predictable in their actions, grateful and loyal.",
    "How it is that animals understand things I do not know, but it is certain that they do understand. Perhaps there is a language which is not made of words and everything in the world understands it.",
    "Clearly, animals know more than we think, and think a great deal more than we know.",
    "Animals are the bridge between us and the beauty of all that is natural. They show us what's missing in our lives, and how to love ourselves more completely and unconditionally.",
    "Any glimpse into the life of an animal quickens our own and makes it so much the larger and better in every way.",
    "I had a linguistics professor who said that it's man's ability to use language that makes him the dominant species on the planet. That may be. But I think there's another thing that separates us from animals. We aren't afraid of vacuum cleaners.",
    "Each species is a masterpiece, a creation assembled with extreme care and genius."
  ],
  "dff_sport_skill": [
    "To uncover your true potential you must first find your own limits and then you have to have the courage to blow past them.",
    "Do you know what my favorite part of the game is? The opportunity to play.",
    "You miss 100 percent of the shots you don't take.",
    "It's not whether you get knocked down; it's whether you get up.",
    "It's not the will to win that matters - everyone has that. It's the will to prepare to win that matters.",
    "Run when you can, walk if you have to, crawl if you must; just never give up.",
    "Gold medals aren't really made of gold. They're made of sweat, determination, and a hard-to-find alloy called guts.",
    "Sports do not build character. They reveal it.",
    "One man practicing sportsmanship is far better than a hundred teaching it.",
    "Winners never quit and quitters never win."
  ],
  "dff_food_skill": [
    "You don't need a silver fork to eat good food.",
    "Tell me what you eat, and I will tell you who you are.",
    "Food for the body is not enough. There must be food for the soul.",
    "The only think I like better than talking about Food is eating.",
    "There is no sincerer love than the love of food.",
    "There's no better feeling in the world than a warm pizza box on your lap.",
    "One cannot think well, love well, sleep well, if one has not dined well.",
    "Baking cookies is comforting, and cookies are the sweetest little bit of comfort food. They are very bite-sized and personal.",
    "Food is your body's fuel. Without fuel, your body wants to shut down.",
    "Food, in the end, in our own tradition, is something holy. It's not about nutrients and calories. It's about sharing. It's about honesty. It's about identity.",
    "So long as you have food in your mouth, you have solved all questions for the time being.",
    "Only the pure in heart can make a good soup.",
    "If you really want to make a friend, go to someone's house and eat with him... the people who give you their food give you their heart.",
    "Anything is good if it's made of chocolate."
  ],
  "dff_music_skill": [
    "Music should strike fire from the heart of man, and bring tears from the eyes of woman.",
    "Music washes away from the soul the dust of everyday life.",
    "Music is the strongest form of magic.",
    "Music is moonlight in the gloomy night of life.",
    "One good thing about music, when it hits you, you feel no pain.",
    "I think music in itself is healing. It's an explosive expression of humanity. It's something we are all touched by. No matter what planet we're from, everyone loves music.",
    "Music is the soundtrack of your life.",
    "Without music, life would be a mistake.",
    "Music is love in search of a word.",
    "The world's most famous and popular language is music.",
    "Music is very spiritual, it has the power to bring people together.",
    "Where words fail, music speaks.",
    "Music is always changing and the changes are unpredictable.",
    "Music is well said to be the speech of angels.",
    "Music is the best means we have of digesting time."
  ]
}
