{"Julien Leclercq": [{"title": "Ganglands", "year": 2021, "description": "To protect his family from a powerful drug lord, skilled thief Mehdi and his expert team of robbers are pulled into a violent and deadly turf war.", "duration": "1 Season"}], "Mike Flanagan": [{"title": "Midnight Mass", "year": 2021, "description": "The arrival of a charismatic young priest brings glorious miracles, ominous mysteries and renewed religious fervor to a dying town desperate to believe.", "duration": "1 Season"}], "Andy Devonshire": [{"title": "The Great British Baking Show", "year": 2021, "description": "A talented batch of amateur bakers face off in a 10-week competition, whipping up their best dishes in the hopes of being named the U.K.'s best.", "duration": "9 Seasons"}], "Kongkiat Komesiri": [{"title": "Bangkok Breaking", "year": 2021, "description": "Struggling to earn a living in Bangkok, a man joins an emergency rescue service and realizes he must unravel a citywide conspiracy.", "duration": "1 Season"}], "Olivier Megaton": [{"title": "Monsters Inside: The 24 Faces of Billy Milligan", "year": 2021, "description": "In the late 1970s, an accused serial rapist claims multiple personalities control his behavior, setting off a legal odyssey that captivates America.", "duration": "1 Season"}], "Bunmi Ajakaiye": [{"title": "The Smart Money Woman", "year": 2020, "description": "Five glamorous millennials strive for success as they juggle careers, finances, love and friendships. Based on Arese Ugwu's 2016 best-selling novel.", "duration": "1 Season"}], "Jason Hehir": [{"title": "Countdown: Inspiration4 Mission to Space", "year": 2021, "description": "From training to launch to landing, this all-access docuseries rides along with the Inspiration4 crew on the first all-civilian orbital space mission.", "duration": "1 Season"}], "Luis Alfaro, Javier Gómez Santander": [{"title": "Money Heist: From Tokyo to Berlin", "year": 2021, "description": "The filmmakers and actors behind \"Money Heist\" characters like Tokyo and the Professor talk about the emotional artistic process of filming the series.", "duration": "1 Season"}], "Gerhard Mostert": [{"title": "HQ Barbers", "year": 2020, "description": "When a family run barber shop in the heart of Lagos is threatened by real estate developers, they'll do whatever it takes to stay in business.", "duration": "1 Season"}], "Kemi Adetiba": [{"title": "King of Boys: The Return of the King", "year": 2021, "description": "Alhaja Eniola Salami starts anew and sets her sights on a different position of power, fueled by revenge, regret and ruthlessness.", "duration": "1 Season"}], "Brad Anderson": [{"title": "Clickbait", "year": 2021, "description": "When family man Nick Brewer is abducted in a crime with a sinister online twist, those closest to him race to uncover who is behind it and why.", "duration": "1 Season"}], "Mauricio Dias, Tatiana Villela": [{"title": "John of God: The Crimes of a Spiritual Healer", "year": 2021, "description": "Idolized medium João Teixeira de Faria rises to international fame before horrifying abuse is revealed by survivors, prosecutors and the press.", "duration": "1 Season"}], "Juan Carlos Medina": [{"title": "Gone for Good", "year": 2021, "description": "Ten years after losing two loved ones, a man is plunged into another dizzying mystery when his girlfriend vanishes. Based on a Harlan Coben novel.", "duration": "1 Season"}], "Inma Torrente": [{"title": "Valeria", "year": 2021, "description": "A writer in creative and marital crises finds support from three friends, who are also discovering themselves. Based on the novels by Elísabet Benavent.", "duration": "2 Seasons"}], "Sakon Tiacharoen": [{"title": "I Need Romance", "year": 2021, "description": "A workaholic who lost interest in romance reunites with an old flame and gifted music composer, who's determined to restore her belief in love.", "duration": "1 Season"}], "Bejoy Nambiar, Priyadarshan, Karthik Narain, Vasanth Sai, Karthik Subbaraj, Arvind Swamy, Rathindran R Prasad, Sarjun, Gautham Vasudev Menon": [{"title": "Navarasa", "year": 2021, "description": "From amusement to awe, the nine human emotions of Indian aesthetic theory are explored in this anthology series.", "duration": "1 Season"}], "Billy Corben": [{"title": "Cocaine Cowboys: The Kings of Miami", "year": 2021, "description": "Two childhood friends go from high school dropouts to the most powerful drug kingpins in Miami in this true story of a crime saga that spanned decades.", "duration": "1 Season"}], "Hsu Fu-chun": [{"title": "Office Girls", "year": 2011, "description": "A department store mogul has his son work incognito in a menial job to prove his worthiness, while female co-workers teach him how normal people live.", "duration": "1 Season"}, {"title": "The Rational Life", "year": 2021, "description": "A career-driven 30-something must contend with a cutthroat workplace, a love triangle and her nagging mom.", "duration": "1 Season"}], "Glen Winter": [{"title": "The Flash", "year": 2021, "description": "A forensics expert who wakes from a coma with amazing new powers squares off against forces threatening the city in this live-action superhero romp.", "duration": "7 Seasons"}], "Royale Watkins, Rich Schlansker": [{"title": "Plastic Cup Boyz: Laughing My Mask Off!", "year": 2021, "description": "Comedy collective The Plastic Cup Boyz pour out the punchlines in Atlanta during a trio of raw and lively stand-up specials.", "duration": "1 Season"}], "Garrett Bradley": [{"title": "Naomi Osaka", "year": 2021, "description": "This intimate series follows Naomi Osaka as she explores her cultural roots and navigates her multifaceted identity as a tennis champ and rising leader.", "duration": "1 Season"}], "Jan Holoubek": [{"title": "The Mire", "year": 2021, "description": "In an early-'80s Polish town, a prostitute and a youth leader are found killed, but the police's handling of the case makes two journalists suspicious.", "duration": "2 Seasons"}], "Malik Nejer": [{"title": "Masameer County", "year": 2021, "description": "A humorous view on a changing Saudi, this season includes stories about a global media war, a long-standing tribal feud and a health craze gone too far.", "duration": "1 Season"}], "Sidharta Tata, Aco Tenriyagelli, Dian Sastrowardoyo, Ifa Isfansyah, Jason Iskandar": [{"title": "Quarantine Tales", "year": 2020, "description": "Traversing genres, five separate stories offer unique, whimsical and thought-provoking takes on life during the pandemic in 2020.", "duration": "1 Season"}], "Shen Leping": [{"title": "Legend of Exorcism", "year": 2020, "description": "After leaving Yaojin Palace, Kong Hongjun arrives in Chang'an to battle demons and forms a bond with exorcism squad chief Li Jinglong.", "duration": "1 Season"}], "John Dower": [{"title": "Sophie: A Murder in West Cork", "year": 2021, "description": "A shocking murder in rural Ireland sets off an increasingly convoluted quest for justice that spans decades and cuts across national borders.", "duration": "1 Season"}], "Srijit Mukherji, Vasan Bala, Abhishek Chaubey": [{"title": "Ray", "year": 2021, "description": "From a satire to a psychological thriller, four short stories from celebrated auteur and writer Satyajit Ray are adapted for the screen in this series.", "duration": "1 Season"}], "Fernando Moro": [{"title": "Cleo & Cuquin", "year": 2020, "description": "Spirited sister-brother duo Cleo and Cuquín try on different professions each day to help their other siblings solve problems and enjoy new adventures.", "duration": "2 Seasons"}], "Ivan Andrew Payawal": [{"title": "Gameboys Level-Up Edition", "year": 2020, "description": "In this recut of the popular web series, live-stream gamer Cairo calls for a rematch after losing to newcomer Gavreel — and an online romance blooms.", "duration": "1 Season"}], "Rob Seidenglanz": [{"title": "Riverdale", "year": 2019, "description": "While navigating the troubled waters of sex, romance, school and family, teen Archie and his gang become entangled in a dark Riverdale mystery.", "duration": "4 Seasons"}, {"title": "DC's Legends of Tomorrow", "year": 2020, "description": "A mysterious \"time master\" from the future unites an unlikely group of superheroes and villains to save the world from a powerful evil.", "duration": "5 Seasons"}], "Simon Frederick": [{"title": "They've Gotta Have Us", "year": 2018, "description": "Powered by candid recollections from esteemed African-American entertainers, this docuseries traces the history of black cinema.", "duration": "1 Season"}], "Sarawut Wichiensarn": [{"title": "Let's Eat", "year": 2021, "description": "A food-blogging insurance agent encounters a friend from elementary school with a vendetta against him — but soon becomes her sidekick.", "duration": "1 Season"}], "Michael Simon": [{"title": "The American Bible Challenge", "year": 2014, "description": "Join host Jeff Foxworthy as contestants test their knowledge of all things biblical, competing to win money for the charities of their choice.", "duration": "1 Season"}], "Joe Berlinger, Bruce Sinofsky": [{"title": "Metallica: Some Kind of Monster", "year": 2014, "description": "This collection includes the acclaimed rock documentary about Metallica, plus a film checking in with the still-thriving group 10 years later.", "duration": "1 Season"}], "Jay Oliva": [{"title": "Trese", "year": 2021, "description": "In Manila, where dark supernatural forces pervade the criminal underworld, it’s up to Alexandra Trese to keep the peace — but there’s a storm brewing.", "duration": "1 Season"}], "Ally Pankiw": [{"title": "Feel Good", "year": 2021, "description": "Stand-up comic Mae Martin navigates a passionate, messy new relationship with her girlfriend, George, while dealing with the challenges of sobriety.", "duration": "2 Seasons"}], "Chiaki Kon": [{"title": "Pretty Guardian Sailor Moon Eternal The Movie", "year": 2021, "description": "When a dark power enshrouds the Earth after a total solar eclipse, the scattered Sailor Guardians must reunite to bring light back into the world.", "duration": "1 Season"}], "Takuya Igarashi": [{"title": "Ouran High School Host Club", "year": 2006, "description": "New student Haruhi stumbles on the Ouran High School Host Club, an all-male group that makes money by entertaining the girls of the school.", "duration": "1 Season"}], "José Larraza, Marc Pons": [{"title": "The Least Expected Day: Inside the Movistar Team 2019", "year": 2021, "description": "Pro cycling’s Movistar Team sets their sights on victory while on the road as they face challenges, controversy and internal conflict.", "duration": "2 Seasons"}], "Gary Sing": [{"title": "Word of Honor", "year": 2021, "description": "A disillusioned royal magistrate sets out for the martial arts world, where he encounters a bosom friend and becomes entangled in a conspiracy.", "duration": "1 Season"}], "Daniel Minahan": [{"title": "Halston", "year": 2021, "description": "His name built an empire. His style defined an era. American fashion designer Halston skyrockets to fame before his life starts to spin out of control.", "duration": "1 Season"}], "Uzodinma Okpechi": [{"title": "The Mystic River", "year": 2020, "description": "As pregnant women vanish in a remote Nigerian village over decades, a doctor with child finds herself extremely close to uncovering dangerous secrets.", "duration": "1 Season"}], "Cai Cong": [{"title": "Use For My Talent", "year": 2021, "description": "When the germophobic owner of a cleaning company encounters a slovenly employee, a romance blossoms as they help one another heal from their pasts.", "duration": "1 Season"}], "Vijay Roche": [{"title": "Sab Jholmaal Hai", "year": 2017, "description": "In this madcap comedy, two mischievous cats, a talking parrot and a high-strung dog keep getting into trouble while their human is away.", "duration": "2 Seasons"}], "Joshua Zeman": [{"title": "The Sons of Sam: A Descent into Darkness", "year": 2021, "description": "The Son of Sam case grew into a lifelong obsession for journalist Maury Terry, who became convinced that the murders were linked to a satanic cult.", "duration": "1 Season"}], "Oriol Paulo": [{"title": "The Innocent", "year": 2021, "description": "An accidental killing leads a man down a dark hole of intrigue and murder. Just as he finds love and freedom, one phone call brings back the nightmare.", "duration": "1 Season"}], "Kongkiat Khomsiri": [{"title": "Let's Fight Ghost", "year": 2021, "description": "A med student with a supernatural gift tries to cash in on his abilities by facing off against ghosts, till a wandering spirit brings romance instead.", "duration": "1 Season"}], "Glenn Weiss": [{"title": "Garth Brooks: The Road I’m On", "year": 2019, "description": "Revealing interviews and archive footage tell the story of Garth Brooks' humble beginnings, rise to fame and unprecedented impact on country music.", "duration": "1 Season"}], "Pass Patthanakumjon": [{"title": "The Underclass", "year": 2020, "description": "After getting dropped from an elite program, a student gets tangled in the affairs of a high school gang while trying to find her own identity.", "duration": "1 Season"}], "Moyoung Jin, Caroline Sá, Deepti Kakkar, Fahad Mustafa, Hikaru Toda, Chico Pereira, Elaine McMillion Sheldon": [{"title": "My Love: Six Stories of True Love", "year": 2021, "description": "Six longtime couples in different parts of the world share their decades-long love in these tender portraits filmed over the course of one year.", "duration": "1 Season"}], "Adrián García Bogliano": [{"title": "Haunted: Latin America", "year": 2021, "description": "Real people's terrifying tales of the chilling, unexplained and paranormal come to life with dramatic reenactments in this reality series.", "duration": "1 Season"}], "Jung-ah Im": [{"title": "Men on a Mission", "year": 2021, "description": "Male celebs play make-believe as high schoolers, welcoming star transfer students every week and engaging in battles of witty humor and slapstick.", "duration": "6 Seasons"}], "Alain Brunard": [{"title": "Under Suspicion: Uncovering the Wesphael Case", "year": 2021, "description": "This docuseries follows the high-profile case of Belgian politician Bernard Wesphael, who was accused of murdering his wife in 2013.", "duration": "1 Season"}], "Ange Basterga, Nicolas Lopez": [{"title": "Dealer", "year": 2021, "description": "Tensions erupt when two filmmakers infiltrate an area ruled by gangs to shoot a music video for a rapper in this gritty found-footage series.", "duration": "1 Season"}], "Maribel Sánchez-Maroto": [{"title": "Nevenka: Breaking the Silence", "year": 2021, "description": "Nevenka Fernández, the plaintiff in Spain's first successful lawsuit against a politician for sexual harassment, breaks her silence after 20 years.", "duration": "1 Season"}], "Jared Hess, Tyler Measom": [{"title": "Murder Among the Mormons", "year": 2021, "description": "High-stakes exploits turn deadly — and shake a global church to its core — in this extraordinary true crime story.", "duration": "1 Season"}], "Sunny Lau": [{"title": "A Perfect Day For Arsenide", "year": 2019, "description": "An eclectic group of people encounters zany situations in this anthology of surreal, offbeat tales from Hong Kong. Based on Mr. Pizza's hit novel.", "duration": "1 Season"}], "Tharun Bhascker Dhaassyam, B. V. Nandini Reddy, Nag Ashwin, Sankalp Reddy": [{"title": "Pitta Kathalu", "year": 2021, "description": "From secrets and lies to jealousy and control, four stories in this anthology film explore the darker, deceptive sides of love.", "duration": "1 Season"}], "Joe Berlinger": [{"title": "Crime Scene: The Vanishing at the Cecil Hotel", "year": 2021, "description": "The notorious Cecil Hotel grows in infamy when guest Elisa Lam vanishes. From the creator of \"The Ted Bundy Tapes,\" a dive into crime's darkest places.", "duration": "1 Season"}], "Richard Arellano": [{"title": "The House Arrest of Us", "year": 2020, "description": "A couple decides to make their engagement official by honoring tradition when a pandemic forces them and their families to quarantine under one roof.", "duration": "1 Season"}], "Tiller Russell": [{"title": "Night Stalker: The Hunt for a Serial Killer", "year": 2021, "description": "Beneath the sunlit glamour of 1985 LA lurks a relentlessly evil serial killer. In this true-crime story, two detectives won't rest until they catch him.", "duration": "1 Season"}], "Juliet May": [{"title": "Last Tango in Halifax", "year": 2020, "description": "Two widowed childhood sweethearts fall for each other all over again when they are reunited over the Internet after nearly 60 years.", "duration": "4 Seasons"}], "Maite Ruiz De Austri": [{"title": "The Idhun Chronicles", "year": 2021, "description": "A boy suddenly orphaned fights his parents' killer to save a planet, and discovers a new world of danger — and wonder.", "duration": "2 Seasons"}], "Tony Collingwood": [{"title": "The Cat in the Hat Knows a Lot About That!", "year": 2014, "description": "The Cat in the Hat is back – and this time, he's teaching Sally and her brother, Nick, some awfully nifty things to think about!", "duration": "1 Season"}], "Cosima Spender": [{"title": "SanPa: Sins of the Savior", "year": 2020, "description": "Amidst a heroin crisis, Vincenzo Muccioli cared for the addicted, earning him fierce public devotion — even as charges of violence began to mount.", "duration": "1 Season"}], "Sudha Kongara, Vignesh Shivan, Gautham Vasudev Menon, Vetri Maaran": [{"title": "Paava Kadhaigal", "year": 2020, "description": "At times dark, at times disturbing, four short films explore stories of those who dare to dream and desire — and those determined to stand in their way.", "duration": "1 Season"}], "Alexx Media": [{"title": "Schulz Saves America", "year": 2020, "description": "Comedian Andrew Schulz takes on the year's most divisive topics in this fearlessly unfiltered and irreverent four-part special.", "duration": "1 Season"}], "Andrucha Waddington, Pedro Waddington": [{"title": "Anitta: Made In Honório", "year": 2020, "description": "In this intimate documentary, Brazilian pop queen Anitta opens up about fame, family and her fierce work ethic, revealing the woman behind the hits.", "duration": "1 Season"}], "Picky Talarico": [{"title": "BREAK IT ALL: The History of Rock in Latin America", "year": 2020, "description": "Soda Stereo, Café Tacvba, Aterciopelados and others figure in this 50-year history of Latin American rock through dictatorships, disasters and dissent.", "duration": "1 Season"}], "Ellena Wood, Jesse Vile": [{"title": "The Ripper", "year": 2020, "description": "In the late 1970s, British police struggle to identify — let alone capture — the serial killer known throughout the world as the Yorkshire Ripper.", "duration": "1 Season"}], "Lai Chun-yu": [{"title": "Futmalls.com", "year": 2020, "description": "Strange occurrences afflict a group of people after they purchase items on a shopping website from the future.", "duration": "1 Season"}], "Jalil Lespert": [{"title": "Room 2806: The Accusation", "year": 2020, "description": "This docuseries follows the 2011 sexual assault case involving French politician Dominique Strauss-Kahn at the height of his career.", "duration": "1 Season"}], "Su I-Hsuan, Chuang Shiang-an, Liu Yi": [{"title": "Detention", "year": 2020, "description": "A tormented student uncovers unsettling secrets at her remote high school as betrayal and a paranormal encounter upend her life.", "duration": "1 Season"}], "BB Sasore": [{"title": "Before 30", "year": 2015, "description": "Four female friends in the fast-paced city of Lagos, Nigeria endure public and private pressures to walk down the aisle by the age of 30.", "duration": "1 Season"}], "Mateo Gil": [{"title": "The Minions of Midas", "year": 2020, "description": "A millionaire publisher gets a blackmail note — his decision can mean life or death. Inspired by a Jack London story but set in contemporary Madrid.", "duration": "1 Season"}], "Carla Barros": [{"title": "A Queen Is Born", "year": 2020, "description": "Gloria Groove and Alexia Twister make drag dreams come true as they help six artists find the confidence to own the stage in this makeover show.", "duration": "1 Season"}], "Steven Bognar, Julia Reichert": [{"title": "A Lion in the House", "year": 2006, "description": "Five kids and their resilient families navigate the treatments and traumas of pediatric cancer in this documentary filmed over the course of six years.", "duration": "1 Season"}], "Alejandro Hartmann": [{"title": "Carmel: Who Killed Maria Marta?", "year": 2020, "description": "A woman is found dead in her bathtub, with a puddle of blood nearby. Her husband theorizes she had an accident. But an autopsy tells a different story.", "duration": "1 Season"}], "Juliana Vicente": [{"title": "Afronta! Facing It!", "year": 2017, "description": "This docuseries spotlights Afro-Brazilian thinkers sharing their individual journeys and discussing representation, entrepreneurship and community.", "duration": "1 Season"}], "Chang Chin-jung, Chen Rong-hui": [{"title": "The Devil Punisher", "year": 2020, "description": "A baker by day and demon fighter by night, a reincarnated deity must jog his amnesiac lover's memory of their millennium-long romance.", "duration": "1 Season"}], "Thierry Demaizière, Alban Teurlai": [{"title": "Move", "year": 2020, "description": "Discover the brilliant dancers and choreographers who are shaping the art of movement around the world in this documentary series.", "duration": "1 Season"}], "Manolo Caro": [{"title": "Someone Has to Die", "year": 2020, "description": "In conservative 1950s Spain, the alleged relationship between a young man and a Mexican ballerino creates an uproar of harrowing consequences.", "duration": "1 Season"}], "Pavel Kostomarov": [{"title": "To the Lake", "year": 2020, "description": "Facing the end of civilization when a terrifying plague strikes, a group risks their lives, loves — and humanity — in a brutal struggle to survive.", "duration": "1 Season"}], "Philippa Lowthorpe": [{"title": "Call the Midwife", "year": 2020, "description": "This period drama set in impoverished East London in the 1950s follows a newly qualified midwife and her colleagues at a nursing convent.", "duration": "9 Seasons"}], "Kenny Ortega": [{"title": "Julie and the Phantoms", "year": 2020, "description": "Julie lost her passion for music when she lost her mom. But when three ghostly guys appear and lift her spirits, they decide to start a band together!", "duration": "1 Season"}], "Pepe Mora": [{"title": "La Línea: Shadow of Narco", "year": 2020, "description": "A stone's throw from Africa, the Spanish beach town of La Línea is a drug smuggling hot spot. But the police and mayor are determined to change that.", "duration": "1 Season"}], "Greg Tiernan": [{"title": "Thomas and Friends", "year": 2020, "description": "This animated children's series follows the adventures of Thomas, a cheerful blue tank engine who lives on the island of Sodor.", "duration": "2 Seasons"}], "Hong Won-ki": [{"title": "Goedam", "year": 2020, "description": "When night falls on the city, shadows and spirits come alive in this horror anthology series centered on urban legends.", "duration": "1 Season"}], "Nopparoj Chotmunkongsit": [{"title": "Unlucky Ploy", "year": 2020, "description": "In this remake of the Korean series, a man becomes mired in the lives of two women who happen to share the same name.", "duration": "1 Season"}], "Alex Gibney": [{"title": "Sinatra: All or Nothing at All", "year": 2015, "description": "Legendary crooner Frank Sinatra's life and talent are captured in this documentary series featuring fond memories from friends, family and colleagues.", "duration": "1 Season"}], "Cassia Dian": [{"title": "Dating Around: Brazil", "year": 2020, "description": "In this reality show, six singles meet five different blind dates at trendy urban hot spots in Brazil. Who will they choose for a second outing?", "duration": "1 Season"}], "Wouter Bouvijn": [{"title": "The Twelve", "year": 2019, "description": "Twelve jurors — ordinary people with struggles of their own — must decide the case of a woman accused of killing her best friend and her own daughter.", "duration": "1 Season"}], "Rachit Kusonkoonsiri": [{"title": "Hook", "year": 2020, "description": "Despite their fathers' rivalry, two university students form a friendship at a boxing gym as they tackle family drama, romance and personal crises.", "duration": "1 Season"}], "Kyran Kelly": [{"title": "Abby Hatcher", "year": 2019, "description": "A big-hearted girl helps her Fuzzly friends who live in her family's hotel with exploring feelings, fixing mishaps and embracing their special quirks.", "duration": "1 Season"}], "Phil Sgriccia": [{"title": "Supernatural", "year": 2019, "description": "Siblings Dean and Sam crisscross the country, investigating paranormal activity and picking fights with demons, ghosts and monsters.", "duration": "15 Seasons"}], "Jesse Warn": [{"title": "Supergirl", "year": 2019, "description": "To avert a disaster, Kara Danvers reveals her powers and true identity: She is Superman's cousin, now known as Supergirl, protector of National City.", "duration": "5 Seasons"}], "Norm Hiscock, Gary Howsam, Mike Smith, John Paul Tremblay, Robb Wells": [{"title": "Trailer Park Boys: The Animated Series", "year": 2020, "description": "Nova Scotia’s favorite miscreants have always been super sketchy. Now, carrying on from the Season 12 finale, the boys have become complete cartoons.", "duration": "2 Seasons"}], "Marcus Raboy": [{"title": "Patton Oswalt: I Love Everything", "year": 2020, "description": "Turning 50. Finding love again. Buying a house. Experiencing existential dread at Denny's. Life comes at Patton Oswalt fast in this stand-up special.", "duration": "1 Season"}], "Ziad Doueiri": [{"title": "Inhuman Resources", "year": 2020, "description": "Alain Delambre, unemployed and 57, is lured by an attractive job opening. But things get ugly when he realizes he’s a pawn in a cruel corporate game.", "duration": "1 Season"}], "Sivaroj Kongsakul": [{"title": "Sleepless Society: Two Pillows & A Lost Soul", "year": 2020, "description": "A motivational speaker about to divorce her abusive husband wakes up from a wild party one morning to find a dead body.", "duration": "1 Season"}], "Damien Chazelle, Houda Benyamina, Laïla Marrakchi, Alan Poul": [{"title": "The Eddy", "year": 2020, "description": "The owner of a Paris jazz club gets tangled up with dangerous criminals as he fights to protect his business, his band and his teenage daughter.", "duration": "1 Season"}], "He Xiaofeng": [{"title": "Scissor Seven", "year": 2020, "description": "Seeking to recover his memory, a scissor-wielding, hairdressing, bungling quasi-assassin stumbles into a struggle for power among feuding factions.", "duration": "2 Seasons"}], "Hernán Guerschuny": [{"title": "Almost Happy", "year": 2020, "description": "Sebastián is a radio show host of modest fame, trying to find a way in the world as he deals with his ex-wife (whom he still loves) and two kids.", "duration": "1 Season"}], "Sion Sono": [{"title": "The Forest of Love: Deep Cut", "year": 2020, "description": "Nothing's as it seems when a charismatic conman and an aspiring film crew delve into the lives of two emotionally scarred women.", "duration": "1 Season"}], "David Chuang, Chen Kuan-chung": [{"title": "The Victims' Game", "year": 2020, "description": "After discovering his estranged daughter's link to mysterious murders, a forensic detective with Asperger's syndrome risks everything to solve the case.", "duration": "1 Season"}], "Ryan Polito": [{"title": "Middleditch & Schwartz", "year": 2020, "description": "Comedy duo Thomas Middleditch and Ben Schwartz turn small ideas into epically funny stories in this series of completely improvised comedy specials.", "duration": "1 Season"}], "Adrien Lagier, Ousmane Ly": [{"title": "Fary : Hexagone", "year": 2020, "description": "French comedy phenom Fary puts a playful spin on questions of identity, culture and more in the first half of an epic two-part stand-up special.", "duration": "2 Seasons"}], "Stefano Lodovichi": [{"title": "The Trial", "year": 2019, "description": "The murder of a teen girl impacts a public prosecutor linked to the victim, a lawyer seeking a career-making case and a suspect who says she's innocent.", "duration": "1 Season"}], "Vijay S. Bhanushali": [{"title": "Bal Ganesh", "year": 2019, "description": "Watch Ganesh destroy demons, disarm invaders and defeat dacoits in this series based on the mythological Hindu elephant god’s childhood.", "duration": "1 Season"}], "Eric Goode, Rebecca Chaiklin": [{"title": "Tiger King: Murder, Mayhem and Madness", "year": 2020, "description": "A zoo owner spirals out of control amid a cast of eccentric characters in this true murder-for-hire story from the underworld of big cat breeding.", "duration": "1 Season"}], "Lynn Novick": [{"title": "Ken Burns Presents: College Behind Bars: A Film by Lynn Novick and Produced by Sarah Botstein", "year": 2019, "description": "This docuseries follows several incarcerated people as they pursue a college degree through the Bard Prison Initiative, a rigorous education program.", "duration": "1 Season"}], "Kim Seong-hun": [{"title": "Kingdom", "year": 2020, "description": "While strange rumors about their ill king grip a kingdom, the crown prince becomes their only hope against a mysterious plague overtaking the land.", "duration": "2 Seasons"}], "Carlos Sedes": [{"title": "Velvet", "year": 2016, "description": "In 1950s Spain, the heir to a fashion house romances a beautiful seamstress who works for the company, despite the objections of his family.", "duration": "4 Seasons"}], "Ali Kalthami, Meshal Aljaser, Faris Godus, Mohamed al Salman, Faisal al Amer": [{"title": "Six Windows in the Desert", "year": 2020, "description": "From a theatre play to the aftermath of a plane crash, this collection of shorts from Saudi filmmakers depicts the nuances of Saudi Arabian culture.", "duration": "1 Season"}], "Mick Grogan": [{"title": "Unabomber - In His Own Words", "year": 2018, "description": "The CIA attempts to turn Ted Kaczynski, aka the Unabomber, into a super agent — a plan that backfires. Based on real events.", "duration": "1 Season"}], "Tosin Coker": [{"title": "On the Real", "year": 2017, "description": "A group of reality stars transitions into their newly achieved fame while dealing with the demands of an obnoxious TV executive and their regular lives.", "duration": "1 Season"}], "Pantham Thongsang, Cheewatan Pusitsuksa": [{"title": "Sleepless Society: Insomnia", "year": 2019, "description": "Haunted by recurring visions, a young woman with insomnia visits an old home to solve a mystery and put her nightmares to an end.", "duration": "1 Season"}], "James Bamford": [{"title": "Arrow", "year": 2019, "description": "Based on DC Comics' Green Arrow, an affluent playboy becomes a vengeful superhero, saving the city from villains armed with just a bow and arrows.", "duration": "8 Seasons"}], "Julia Willoughby Nason, Jenner Furst": [{"title": "The Pharmacist", "year": 2020, "description": "After his son's tragic death, a Louisiana pharmacist goes to extremes to expose the rampant corruption behind the opioid addiction crisis.", "duration": "1 Season"}], "Thomas Astruc": [{"title": "Miraculous: Tales of Ladybug & Cat Noir", "year": 2019, "description": "When Paris is in peril, Marinette becomes Ladybug. Little does she know, her school crush Adrien is actually Cat Noir, another city-saving superhero.", "duration": "5 Seasons"}], "Quek Shio-chuan": [{"title": "The Ghost Bride", "year": 2020, "description": "In 1890s Malacca, Li Lan finds herself in the afterlife and becomes mired in a mystery linked to the sinister, deceased son of a wealthy family.", "duration": "1 Season"}], "Soumendra Padhi": [{"title": "Jamtara - Sabka Number Ayega", "year": 2020, "description": "A group of small-town young men run a lucrative phishing operation, until a corrupt politician wants in on their scheme – and a cop wants to fight it.", "duration": "1 Season"}], "Justin Webster": [{"title": "Nisman: The Prosecutor, the President, and the Spy", "year": 2020, "description": "This docuseries details the suspicious death of Alberto Nisman, investigator of the 1994 bombing of the Argentine Israelite Mutual Association building.", "duration": "1 Season"}], "Lee Toland Krieger": [{"title": "You", "year": 2019, "description": "Obsessed with an aspiring writer, a charming bookstore manager goes to extreme measures to insert himself into her life.", "duration": "2 Seasons"}], "Mark Lewis": [{"title": "Don't F**k with Cats: Hunting an Internet Killer", "year": 2019, "description": "A twisted criminal's gruesome videos drive a group of amateur online sleuths to launch a risky manhunt that pulls them into a dark underworld.", "duration": "1 Season"}], "Obi Emelonye": [{"title": "Crazy, Lovely, Cool", "year": 2018, "description": "For a group of charismatic undergraduates, the jolting revelations from a campus blog turn surviving university life into a serious matter.", "duration": "1 Season"}], "Tsutomu Mizushima": [{"title": "Girls und Panzer", "year": 2012, "description": "Miho Nishizumi tries to escape her family's tradition of tankery by enrolling at a new high school. Instead she gets back into the sport with friends.", "duration": "1 Season"}], "Michel Tikhomiroff": [{"title": "The Chosen One", "year": 2019, "description": "Determined to bring a Zika vaccine to the remote Pantanal, three doctors clash with a faith healer and are pulled deeper into the mysteries of his cult.", "duration": "2 Seasons"}], "Robert Kenner, Taki Oldham": [{"title": "The Confession Killer", "year": 2019, "description": "Henry Lee Lucas rose to infamy when he confessed to hundreds of unsolved murders. This docuseries examines the truth – and horrifying consequences.", "duration": "1 Season"}], "DJ Chen": [{"title": "Nowhere Man", "year": 2019, "description": "Two nefarious schemes taking place 10 years apart entangle a dauntless triad member, who must break out of prison to rescue a loved one.", "duration": "1 Season"}], "Park Joon-hwa": [{"title": "Bring It On, Ghost", "year": 2016, "description": "A college student with psychic abilities takes in an amnesiac ghost as his roommate – who ends up helping him hunt down spooky spirits.", "duration": "1 Season"}], "Ahmet Katıksız": [{"title": "Black Money Love", "year": 2014, "description": "After a cop's fiancée and a jewelry designer's father are found dead together, the two bereaved ones face a perilous aftermath of a theft gone wrong.", "duration": "1 Season"}], "Lee Yoon-jung": [{"title": "Cheese in the Trap", "year": 2016, "description": "In this adaptation of a popular webtoon, a poor student trying to navigate college life gains the attention of a wealthy upperclassman with a dark side.", "duration": "1 Season"}], "Danny Cannon": [{"title": "Gotham", "year": 2019, "description": "Long before he was commissioner, rookie cop James Gordon takes on Gotham City crime and corruption to avenge the murder of Bruce Wayne's parents.", "duration": "5 Seasons"}], "Mariano Barroso": [{"title": "Criminal: Spain", "year": 2019, "description": "Psychological games abound between detectives and suspects in a tense interrogation room, where the search for answers sometimes comes at a moral cost.", "duration": "1 Season"}], "Kiko Cruz Claverol, Patricia Font": [{"title": "The Hockey Girls", "year": 2019, "description": "The passionate members of a girls' roller hockey team chase down victories in the rink while striving to make time for school, family and romance.", "duration": "1 Season"}], "Hayato Date": [{"title": "Naruto", "year": 2006, "description": "Guided by the spirit demon within him, orphaned Naruto learns to harness his powers as a ninja in this anime adventure series.", "duration": "9 Seasons"}], "Vikramaditya Motwane, Anurag Kashyap": [{"title": "Sacred Games", "year": 2019, "description": "A link in their pasts leads an honest cop to a fugitive gang boss, whose cryptic warning spurs the officer on a quest to save Mumbai from cataclysm.", "duration": "2 Seasons"}], "Cho Li, Chen Hung-yi, Weica Wang, Liu Bang-yao, Lin Guan-fu, Shen Chi, YC Tom Lee": [{"title": "Til Death Do Us Part", "year": 2019, "description": "Based on the speculative short stories of MirrorFiction, this sci-fi thriller anthology plunges headlong into our deepest desires – and darkest fears.", "duration": "1 Season"}], "Jesse Moss": [{"title": "The Family", "year": 2019, "description": "An enigmatic conservative Christian group known as the Family wields enormous influence in Washington, D.C., in pursuit of its global ambitions.", "duration": "1 Season"}], "Shin Won-ho": [{"title": "Reply 1994", "year": 2014, "description": "All hailing from various parts of Korea, a group of college students go from being complete strangers to a big happy family at a Seoul boarding house.", "duration": "1 Season"}, {"title": "Reply 1997", "year": 2012, "description": "As a teen, Shi Won was obsessed with a boy band. Now 33 years old, Shi Won and her friends are reviving their memories as their school reunion nears.", "duration": "1 Season"}], "Jerry Seinfeld": [{"title": "Comedians in Cars Getting Coffee", "year": 2019, "description": "Jerry Seinfeld's roving talk show combines coffee, laughs and vintage cars into quirky, caffeine-fueled adventures with the sharpest minds in comedy.", "duration": "6 Seasons"}], "Luis Alberto Restrepo, Andrés Beltrán, Jaime Rayo": [{"title": "Bolívar", "year": 2019, "description": "This dramatization depicts the life – and loves – of Venezuelan Gen. Simón Bolívar, who helped liberate several Latin American countries from Spain.", "duration": "1 Season"}], "Elías León": [{"title": "The Alcàsser Murders", "year": 2019, "description": "New interviews and an up-to-date analysis of evidence shed light on the 1992 murders of three girls in Spain and their profound impact on the nation.", "duration": "1 Season"}], "Diego Enrique Osorno": [{"title": "1994", "year": 2019, "description": "Archival video and new interviews examine Mexican politics in 1994, a year marked by the rise of the EZLN and the assassination of Luis Donaldo Colosio.", "duration": "1 Season"}], "Felipe Cano": [{"title": "Crime Diaries: Night Out", "year": 2019, "description": "After going to a Halloween party, college student Luis Andrés Colmenares is found dead. Was it an accident or murder? Inspired by true events.", "duration": "1 Season"}], "Quentin Tarantino": [{"title": "The Hateful Eight: Extended Version", "year": 2015, "description": "Trapped at a stagecoach stop as a storm rages outside, two bounty hunters and an outlaw face a gallery of rogues. Features never-before-seen footage.", "duration": "1 Season"}], "Lee Kyoungmi, Yim Pilsung, Jeon Go-woon, Kim Jong-kwan": [{"title": "Persona", "year": 2019, "description": "An exploration of different personas in an eclectic collection of four works by critically acclaimed Korean directors.", "duration": "1 Season"}], "Lars Kaalund": [{"title": "Hjørdis", "year": 2015, "description": "This miniseries spinoff of \"Rita\" follows teacher Hjørdis as she plans a school play on bullying featuring a cast of socially awkward students.", "duration": "1 Season"}], "Seren Yüce": [{"title": "Innocent", "year": 2017, "description": "In a peaceful, rustic town, a retired officer and his family are mired in a murder mystery riddled with shocking, buried secrets.", "duration": "1 Season"}], "Noam Murro": [{"title": "Watership Down", "year": 2018, "description": "A warren of rabbits battles many threats on their daring journey to find a new home in this adaptation of the classic novel by Richard Adams.", "duration": "1 Season"}], "Joel Gallen, Tig Notaro": [{"title": "Ellen DeGeneres: Relatable", "year": 2018, "description": "In her first special since 2003, Ellen revisits her road to stardom and details the heartfelt – and hilarious – lessons she's learned along the way.", "duration": "1 Season"}], "Mat King": [{"title": "Pine Gap", "year": 2018, "description": "At top-secret U.S.-Australian joint defense facility Pine Gap, fissures appear in the critical alliance as spies work with, and against, each other.", "duration": "1 Season"}], "Padraic McKinley": [{"title": "FIGHTWORLD", "year": 2018, "description": "Actor and fight enthusiast Frank Grillo travels the world, immersing himself in different fight cultures to understand their traditions and motivations.", "duration": "1 Season"}], "Peter Ho": [{"title": "Age of Rebellion", "year": 2018, "description": "At their high school, a group of unruly teens wreak havoc, face bullies and navigate turbulent lives beyond school grounds.", "duration": "1 Season"}], "Patrick Graham": [{"title": "GHOUL", "year": 2018, "description": "When a new prisoner at a military detention center exhibits eerie behavior, a young interrogator’s search for the truth becomes a battle for survival.", "duration": "1 Season"}], "Han Qing": [{"title": "Take My Brother Away", "year": 2018, "description": "Bickering siblings Shi Miao and Shi Fen tackle friendship matters, school drama and the pitfalls of growing up with little parental supervision.", "duration": "1 Season"}], "Lee Eung-bok": [{"title": "Mr. Sunshine", "year": 2018, "description": "A young boy who ends up in the U.S. after the 1871 Shinmiyangyo incident returns to Korea at a historical turning point and falls for a noblewoman.", "duration": "1 Season"}], "Trey Borzillieri, Barbara Schroeder": [{"title": "Evil Genius", "year": 2018, "description": "This baffling true crime story starts with the grisly death of a pizza man who robs a bank with a bomb around his neck – and gets weirder from there.", "duration": "1 Season"}], "Dawn Porter": [{"title": "Bobby Kennedy for President", "year": 2018, "description": "Historic footage and leading voices of the era examine the \"Bobby Phenomenon\" of the 1960s and the legacy of the man who helped redefine the country.", "duration": "1 Season"}], "Dan Lucchesi": [{"title": "James Acaster: Repertoire", "year": 2018, "description": "Offbeat comic James Acaster covers the strange, the mundane and everything in between in this collection of four wide-ranging stand-up specials.", "duration": "1 Season"}], "Kazuya Murata": [{"title": "A.I.C.O.", "year": 2018, "description": "Everything Aiko knew was a lie. Now she's joining a team of Divers to reach the place where the Burst began to stop it for good and save her family.", "duration": "1 Season"}], "Dan Forrer": [{"title": "Under Arrest", "year": 2016, "description": "Cameras follow police officers as they solve crimes, assist the public and arrest lawbreakers in this reality series.", "duration": "8 Seasons"}], "Kobun Shizuno, Hiroyuki Seshita": [{"title": "Godzilla", "year": 2017, "description": "A desperate group of refugees attempts to recolonize Earth 20,000 years after Godzilla took over. But one young man wants revenge above all else.", "duration": "1 Season"}], "Masaaki Yuasa": [{"title": "Devilman Crybaby", "year": 2018, "description": "With demons reawakened and humanity in turmoil, a sensitive demon-boy is led into a brutal, degenerate war against evil by his mysterious friend, Ryo.", "duration": "1 Season"}], "Yasuhiro Irie": [{"title": "Fullmetal Alchemist: Brotherhood", "year": 2010, "description": "After both suffer physical damage – brothers Edward and Alphonse battle nefarious forces to try to reclaim their bodies in this supernatural anime.", "duration": "5 Seasons"}], "Stan Lathan": [{"title": "Dave Chappelle: Equanimity & The Bird Revelation", "year": 2017, "description": "Comedy titan Dave Chappelle caps a wild year with two stand-up specials packed with scorching new material, self-reflection and tough love.", "duration": "1 Season"}, {"title": "Dave Chappelle", "year": 2017, "description": "Comedy icon Dave Chappelle makes his triumphant return to the screen with a pair of blistering, fresh stand-up specials.", "duration": "1 Season"}], "Daniel Kontur": [{"title": "Myths & Monsters", "year": 2017, "description": "This documentary series takes us to the mythic landscapes of Europe to explore some of most enduring legends produced by European culture.", "duration": "1 Season"}], "Olivier Jean-Marie": [{"title": "Oggy and the Cockroaches", "year": 2017, "description": "Wimpy blue cat Oggy would like nothing more than to snooze, but he's constantly bothered by the three ugly cockroaches who have invaded his home.", "duration": "1 Season"}], "David Ayer": [{"title": "Bright: The Music Videos", "year": 2017, "description": "Explore the hit songs from the Will Smith film \"Bright\" in these music videos from Machine Gun Kelly, Bastille, Logic, Migos and friends.", "duration": "1 Season"}], "Go Koga": [{"title": "Glitter Force Doki Doki", "year": 2017, "description": "Four girls summon their inner superheroes to defend Earth and the magical kingdom of Splendorius from King Mercenare and his minions.", "duration": "2 Seasons"}], "Pali Yahya": [{"title": "Akulah Balqis", "year": 2015, "description": "A little girl must enter an orphanage after her parents are arrested, but her life takes a dramatic turn when she escapes and meets a model.", "duration": "1 Season"}], "Vanessa Roth": [{"title": "Daughters of Destiny", "year": 2017, "description": "Five girls from India's most impoverished families attend a boarding school designed to create opportunities as they strive for a brighter future.", "duration": "1 Season"}], "Eric Abrams": [{"title": "Ari Shaffir: Double Negative", "year": 2017, "description": "Wry yet thoughtful, comedian Ari Shaffir brings his edgy humor to two fast-paced stand-up specials about children and adulthood.", "duration": "1 Season"}], "Stefan Brogren": [{"title": "Degrassi: Next Class", "year": 2017, "description": "Degrassi's next generation of high-tech newbies and returning students navigates real-world high school drama. If you're a teen, this is your life.", "duration": "4 Seasons"}], "Serdar Akar": [{"title": "46", "year": 2016, "description": "A genetics professor experiments with a treatment for his comatose sister that blends medical and shamanic cures, but unlocks a shocking side effect.", "duration": "1 Season"}], "Iginio Straffi": [{"title": "World of Winx", "year": 2017, "description": "The reality show \"WOW!\" engages the Winx in their mission, starting an undercover, worldly journey in order to make talented kids' dreams come true.", "duration": "2 Seasons"}, {"title": "Maggie & Bianca: Fashion Friends", "year": 2017, "description": "Originally polar opposites, an American fashion student and the daughter of an industry mogul form an everlasting bond and start a rock band in Milan.", "duration": "1 Season"}], "Chang-Min Lee": [{"title": "Man to Man", "year": 2017, "description": "Disguised as a bodyguard, a special agent must complete his national secret tasks while pandering to the whims of his ill-tempered world star.", "duration": "1 Season"}], "Jill Bauer, Ronna Gradus, Rashida Jones": [{"title": "Hot Girls Wanted: Turned On", "year": 2017, "description": "Personal stories reveal how the intersection of sex, technology and intimate relationships is rewiring us in fundamental ways.", "duration": "1 Season"}], "Laurent Bouzereau": [{"title": "Five Came Back", "year": 2017, "description": "Five acclaimed contemporary directors tell the story of five legendary Hollywood filmmakers who enlisted in the armed forces to document World War II.", "duration": "1 Season"}], "Gordon Anderson": [{"title": "Hoff the Record", "year": 2016, "description": "TV star David Hasselhoff hopes to reboot his career in the U.K., but both his comeback plans and his personal life keep going off the rails.", "duration": "2 Seasons"}], "James Hawes": [{"title": "Merlin", "year": 2012, "description": "This family-oriented retelling of the King Arthur legend finds Merlin arriving in Camelot, where he hones his magic skills with the help of his uncle.", "duration": "5 Seasons"}], "David Schalko": [{"title": "Old Money", "year": 2015, "description": "Backstabbing, blackmail and revenge consume the dysfunctional family of a wealthy patriarch as they compete to find him a new liver at all costs.", "duration": "1 Season"}], "Tensai Okamura": [{"title": "Kuromukuro", "year": 2016, "description": "When mecha attack a research center, its students, pilots, and researchers must fight back with the help of mysterious artifacts and a young samurai.", "duration": "2 Seasons"}], "Eli Roth": [{"title": "Hemlock Grove", "year": 2015, "description": "Secrets are just a part of daily life in the small Pennsylvania town of Hemlock Grove, where the darkest evils hide in plain sight.", "duration": "3 Seasons"}], "Nizar Shafi": [{"title": "7 (Seven)", "year": 2019, "description": "Multiple women report their husbands as missing but when it appears they are looking for the same man, a police officer traces their cryptic connection.", "duration": "1 Season"}], "Jung-ah Im, Seung-uk Jo": [{"title": "Abnormal Summit", "year": 2017, "description": "Led by a trio of Korean celebs, a multinational panel of men engage in – usually – lighthearted debates on issues that surround Korea and beyond.", "duration": "2 Seasons"}], "Sharon Grimberg": [{"title": "American Experience: The Circus", "year": 2018, "description": "An exploration of the American circus, as the spectacle evolved from a one-ring show to a cultural event and eventually, a dying breed.", "duration": "1 Season"}], "Miguel Conde": [{"title": "Bitter Daisies", "year": 2018, "description": "While investigating the disappearance of a teen girl in a tight-knit Galician town, a Civil Guard officer uncovers secrets linked to a loss of her own.", "duration": "1 Season"}], "Cecilia Peck": [{"title": "Brave Miss World", "year": 2013, "description": "Weeks before being named Miss World, Linor Abargil was raped. She tells the world her inspiring true story in this Emmy-nominated documentary.", "duration": "1 Season"}], "Carlos Bolado": [{"title": "Camelia la Texana", "year": 2014, "description": "Inspired by the famous song \"Contrabando y Traición,\" Camelia, a beautiful girl from San Antonio, kills her lover and becomes a legendary drug runner.", "duration": "1 Season"}], "James Lee": [{"title": "Exclusive Edition", "year": 2008, "description": "Young journalists working for a magazine juggle careers, romance and other challenges while reporting on social issues and news stories in Malaysia.", "duration": "1 Season"}], "Ian Barber": [{"title": "Father Brown", "year": 2017, "description": "A modest, compassionate priest doubles as an effective crime solver in this series based on the short stories by G.K. Chesterton.", "duration": "6 Seasons"}], "Alastair Fothergill": [{"title": "Frozen Planet", "year": 2011, "description": "Go on a journey through the Arctic and Antarctic with this visually stunning program that explores these wildernesses and their inhabitants.", "duration": "1 Season"}, {"title": "Planet Earth: The Complete Collection", "year": 2006, "description": "This landmark series transports nature lovers from the Himalayan Mountains to the depths of the ocean and everywhere in between.", "duration": "1 Season"}, {"title": "The Blue Planet: A Natural History of the Oceans", "year": 2001, "description": "David Attenborough narrates this definitive exploration of the marine world, from the familiar to the unknown, revealing the sea and its communities.", "duration": "1 Season"}], "Guy Vasilovich": [{"title": "Geronimo Stilton", "year": 2011, "description": "With the help of brainy and adventurous sidekicks, New Mouse City's favorite journalist investigates mysteries that take him around the world,", "duration": "1 Season"}], "Neslihan Yesilyurt": [{"title": "Gonul", "year": 2015, "description": "A nurse escapes from her surgeon fiancé after his ex reveals his dark secrets. She later finds love again, but a car accident changes everything.", "duration": "1 Season"}], "Ah Loong": [{"title": "Harry & Bunnie", "year": 2017, "description": "A young wannabe magician and his mischievous stage rabbit battle and sabotage each other while putting on shows.", "duration": "1 Season"}], "Stuart Orme": [{"title": "Jack Taylor", "year": 2016, "description": "Ken Bruen's bestselling crime novels leap to life in this series of TV movies featuring Irish cop-turned-private-investigator Jack Taylor.", "duration": "1 Season"}], "Toby Haynes": [{"title": "Jonathan Strange & Mr Norrell", "year": 2015, "description": "In 1806, ambitious magician Norrell leads a revival of practical magic in England and ignites a fierce rivalry with bold young conjurer Strange.", "duration": "1 Season"}], "Ken Burns": [{"title": "Ken Burns: The Civil War", "year": 1990, "description": "Ken Burns's documentary depicts the action of famous Civil War battles, and relates the stories of soldiers, generals and a beleaguered president.", "duration": "1 Season"}, {"title": "Ken Burns: The Roosevelts: An Intimate History", "year": 2014, "description": "Award-winning documentarian Burns profiles three members of one of America's premier political families: Theodore, Franklin and Eleanor Roosevelt.", "duration": "1 Season"}], "Steve Greenwood": [{"title": "Kingdoms of the Sky", "year": 2018, "description": "Meet the astonishing animals and adventurous people living on some of the most spectacular – and formidable – mountain ranges in the world.", "duration": "1 Season"}], "Alejandro Lozano": [{"title": "La Viuda Negra", "year": 2016, "description": "Beautiful and ruthless Griselda Blanco, known as the queen of cocaine, becomes Pablo Escobar's boss and governs a world of deceit and death.", "duration": "1 Season"}], "Andrew Tan, Stephen Murray": [{"title": "Lego Friends: Girls on a Mission", "year": 2018, "description": "Five best friends put their teamwork, wits and courage to the test when they take on a mission to protect Heartlake City from bad people.", "duration": "1 Season"}], "Onur Ünlü": [{"title": "Leyla and Mecnun", "year": 2014, "description": "Destiny brings Mecnun and Leyla together as newborns, and again years later. Despite unexpected turns in Mecnun's zany life, Leyla remains a constant.", "duration": "3 Seasons"}], "Jakob Verbruggen": [{"title": "London Spy", "year": 2015, "description": "When his reclusive-banker lover disappears, a hard-partying young British hedonist plunges into the dangerous world of espionage to find the truth.", "duration": "1 Season"}], "Alessandro Angulo": [{"title": "Los tiempos de Pablo Escobar", "year": 2012, "description": "Featuring never-before-seen images, personal testimonies and more, this is the story of one of the most notorious drug smugglers of all time.", "duration": "1 Season"}], "Everardo Gout": [{"title": "Mars", "year": 2018, "description": "Fact meets fiction in this docudrama chronicling the journey of a spacecraft crew as it embarks in 2033 on a mission to colonize the red planet.", "duration": "2 Seasons"}], "Rachel Bell": [{"title": "Monty Don's French Gardens", "year": 2013, "description": "TV personality Monty Don visits France’s most famous gardens to dig up the influence of power, culture and passion on their conceptions and designs.", "duration": "1 Season"}], "Oliver Stone": [{"title": "Oliver Stone's Untold History of the United States", "year": 2013, "description": "This documentary series offers an alternative take on modern American history, focusing on underreported events that shaped the nation's character.", "duration": "1 Season"}], "Peter McDonnell": [{"title": "Origins Collection", "year": 2018, "description": "This documentary series explores the stories behind history's most fascinating innovations, including games, technology, sports, medicine and more.", "duration": "3 Seasons"}], "Oscar Micheaux, Spencer Williams, Richard E. Norman, Richard Maurice": [{"title": "Pioneers of African-American Cinema", "year": 1946, "description": "This newly preserved collection features more than 20 films made by groundbreaking African American directors for black audiences from 1915 to 1946.", "duration": "1 Season"}], "Bhavik Thakore": [{"title": "Prince Jai Aur Dumdaar Viru", "year": 2017, "description": "A prince and a commoner who are best friends keep having to thwart the plots of the prince's scheming, ambitious minister.", "duration": "1 Season"}], "Jani Lachauer, Jakob Schuh": [{"title": "Revolting Rhymes", "year": 2017, "description": "Popular fairy tales take on a darkly comic edge in these short animated films based on a book by Roald Dahl and illustrator Quentin Blake.", "duration": "1 Season"}], "Jay Chandrasekhar": [{"title": "Royal Pains", "year": 2016, "description": "Dr. Hank Lawson unexpectedly gets a career upgrade as a freelance physician treating New York's aristocratic upper crust in their posh Hamptons homes.", "duration": "8 Seasons"}], "Ehtesham Uddin": [{"title": "Sadqay Tumhare", "year": 2014, "description": "An arranged engagement between a village girl and her city cousin shows signs of true love, but an indiscretion decades ago could doom their romance.", "duration": "1 Season"}], "Dheeraj Berry": [{"title": "Th Eena Meena Deeka Chase Comedy Show", "year": 2015, "description": "A hungry fox and three resourceful, surprisingly formidable birds turn the animal kingdom on its head in this lively animated series.", "duration": "1 Season"}], "Estela Renner": [{"title": "The Beginning of Life: The Series", "year": 2016, "description": "Using breakthroughs in technology and neuroscience, this series examines how environment affects infants – and how infants can affect our future.", "duration": "1 Season"}], "Bumpy": [{"title": "The Calling", "year": 2018, "description": "Food-crazed travel junkies journey across India, completing bucket list challenges for a chance to win a once-in-a-lifetime scholarship.", "duration": "1 Season"}], "Michael Samuels": [{"title": "The Fear", "year": 2012, "description": "Richie Beckett is an aging Brighton crime boss who's struggling with the onset of dementia, just as a rival gang is trying to take over his territory.", "duration": "1 Season"}], "Mark Tonderai": [{"title": "The Five", "year": 2016, "description": "Twenty years after 5-year-old Jesse disappears near his home, his DNA turns up at the scene of a woman's murder, baffling his family and the police.", "duration": "1 Season"}], "Ken Burns, Lynn Novick": [{"title": "The Vietnam War: A Film by Ken Burns and Lynn Novick", "year": 2017, "description": "Ken Burns presents an epic 10-part, 18-hour chronicle of the Vietnam War, featuring the soldiers, protesters, politicians and families that lived it.", "duration": "1 Season"}], "Michael Cumming": [{"title": "Toast of London", "year": 2015, "description": "After a divorce and fatal career move, a classically trained British stage actor navigates single life with his odd roommate and takes on horrid jobs.", "duration": "3 Seasons"}]}