{"Improve-Your-Drawing-Skills": {"Focusing on Fundamentals": ["Draw straight lines and curves to improve your basic skills. Use your pen or pencil to draw straight lines on a piece of paper. Practice it over and over to improve your line work. Then, practice drawing clean curves on the paper by turning your hand while you draw to build your drawing control. Make long, fluid lines rather than short and choppy lines. Try drawing shapes as well, such as triangles and circles.", "Sketch shapes with different line quality to improve your line work. Line quality refers to the thickness and smoothness of a line. Take a sheet of paper or a notebook and pick a simple design to draw such as a flower or a hexagon. Sketch the shape over and over on the paper and change the line quality each time so you can practice and play around with different approaches. Practicing drawing the same shape with different line qualities can reveal a personal style or method of drawing that suits you.", "Add shading to your sketches to practice adding depth. refers to adding dark areas to a drawing to make it some more dimensional and realistic. When you’re sketching your lines, curves, and shapes, add some shading to them to lend them some depth. Improving your shading skills will help you when you draw larger pieces. Add short lines or fill in an area to add shading. Think about where the light is shining on the object you’ve drawn so the shading seems natural. to add shadows and dimension to your drawings.", "Practice making continuous lines to develop smoother strokes. Make up a simple drawing and use unbroken lines to draw the curves and shapes. Drawing long, unbroken lines, rather than short and choppy lines, will improve your ability to draw smooth and fluid sketches. Make the drawing up as you go and don’t worry about how realistic it looks. For instance, try drawing the image of an aerodynamic car. Draw the curves of the body and the roundness of the wheels, but use singular, unbroken lines to create a smooth image. Getting better at using continuous lines will also improve the speed of your drawing. Add some shading to the drawing as well.", "Use different drawing materials to find your preference. Practice drawing with pencils, gel pens, charcoal, markers, and any other type of drawing medium so you can improve your drawing skills and start to develop your own personal style. Draw lines, curves, and simple shapes using different mediums to see which ones you prefer using. Using different mediums can lead to a unique and specific style of drawing that you use. Try different types of paper as well."], "Using Drawing Exercises": ["Set a timer for 10 minutes and sketch a photo to force yourself to focus. Take a picture such as a photograph or an image from a magazine and time yourself to see how quickly you can sketch it. The stress of the time constraint will force you to focus on the details of the sketch and will improve your ability to draw quickly. Set a timer for 10 minutes, then draw the same image with a 5-minute time limit. Then, try drawing it for 2 minutes, and then finally, 1 minute. For a real challenge, try giving yourself 10 seconds to sketch a reference image.", "Trace over drawings from artists that you admire to improve your style. Print out a copy of a drawing from an artist with a style that you hope to emulate. Lay a piece of tracing paper over the drawing and trace over it. When you’re finished, put another sheet of tracing paper over the image and trace it again to get better at the line quality that the original artist accomplished. Practice tracing over the image multiple times with new sheets of tracing paper and using different line quality and thickness to vary it up and challenge yourself. Trace over the entire drawing, not just a section, so you can get a feel for how the lines are incorporated to form a larger piece.", "Draw something new to challenge yourself and find your weak areas. Choose a subject that is something that you never attempt to draw to change it up and give yourself something difficult to work on. Push yourself out of your drawing comfort zones so you can identify any weaknesses that you have and improve your overall drawing ability. For instance, if you love to sketch landscapes of the countryside, try drawing a sketch of someone’s face instead. Drawing something new can also help you get out of a rut if you’ve been struggling to find things to draw. If you do notice that you’re struggling in a certain area, such as line work or capturing a certain detail, work to improve in that area by practicing.", "Try to draw an image from memory to improve your attention to detail. Use a visual reference such as a photograph and draw the image as best as you can. Then, put the image and your sketch away and try to recreate the image on a new sheet of paper using only your memory. When you’re finished, compare the 2 images to see what details you missed. The ability to notice and include detail in a drawing is what makes a great artist. Set a 5-minute timer to force yourself to sketch the drawing from memory quickly. Use something simple such as a picture of a shoe or a piece of fruit."], "intro": "Getting better at drawing can seem really difficult, but you can work to improve your drawing skills and become a better artist. Build up your fundamental drawing skills by focusing on basic lines, shapes, and working with different mediums. You can also use training exercises to challenge yourself and improve your skills. In addition to practice, it’s also important that you develop a discipline so you’re continuously working and improving."}, "Photograph-Pets": {"Engaging Your Pet": ["Work in short increments to keep your pet interested. Think of your pet as a toddler, and you'll have a good idea of how long you can keep its attention span. By taking breaks and only shooting a couple of photos at a time, you'll have a happier, more engaged pet for your photos. Set an alarm for a couple of minutes if you keep forgetting to take breaks.", "Bribe your pet with treats. Most animals love treats, so now is the time to break out your pet's favorite one. Split the treats up into small bites, as you may need to bribe your animal quite a few times.  Try asking someone to hold a treat in their hand near the camera. Make sure the pet knows they have it, and then have the person hide it away. This trick usually evokes good expressions from the animal, especially dogs.", "Ask your pet to play with you using one of its favorite toys. A playful pet will make for good photos, and using a toy will help keep your pet nearby. Grab the toy, and play with your pet like you normally would. If you have another person nearby, it might be easier if they use the toy to play with the pet while you snap pictures. Tug-of-war toys work great for dogs, and string-type toys work well for cats, as you can entice them to come over. Any toy that keeps your pet mostly in the same place should be fine. Balls don't work as well, unless someone is throwing a ball in your direction. Otherwise, the animal will be running away from you.", "Use the appropriate voice for the type of pet you're photographing. For a dog, be very, very cheerful. Dogs love upbeat voices, especially when you're telling the dog what a good boy or girl they are! Other pets may do better with calm, almost cooing voices. You know what your pet likes to hear! Use the pet names you have for it, using your happy voice. For instance, try a cheerful but calm voice when working with cats. For birds, be very cheerful, but not so loud you scare them. Whistles may help, too! If it's not your pet, get the owner to talk to the pet instead, as they may have better luck than you.", "Surprise your pet so they look your way. Of course, you don't want to scare your pet, but something new and exciting can make them want to see what's going on. For instance, you could have a person pop out from behind you or use a squeaky toy to make a noise. You could also try unique noises, such as finger drumming, tongue-clicking, scratching, and whistling."], "Letting Your Pet Get Settled": ["Hold the camera out to the animal for a good sniff. Anytime an animal sees something new, it's going to be curious, especially cats. Let the animal take a moment to give the camera a good sniff all over, so they will be less likely to do so in the middle of your photo shoot. If you're not photographing your own pet, let the animal give you a good sniff as well, so they are more comfortable in the session.", "Get them used to the flash and shutter sound. Sometimes, the flash will freeze an animal in place for a second, which can be good if you're trying to get a still shot. However, both the shutter sound and flash can distract the animal enough to ruin the shot, so take a few shots just so they can get used to that part of the camera. Try shooting a couple of shots towards the ceiling so the animal can hear the shutter sound and see the flash.", "Give your pet a minute to explore a new area. If you go outside or you take your pet to a new area, they are going to want to explore. Give them a few minutes to look around first! That way, they won't be as distracted when you're ready to take the pictures. If your pet is on a leash, walk them slowly around the area, letting them sniff as you go. If you're in a confined space with a small animal, give them a chance to walk around by itself for a minute."], "Taking Your Shots": ["Go outside if you can. Natural light is great for any photography, and pet photography is no exception. If it's especially bright, pick a shaded area where you'll get ambient light for your pictures. Try the hour just after sunrise or the one just before sunset. These hours, called the \"golden hours,\" have the best light. Avoid the harsh light of midday. Of course, you won't be able to take some pets outdoors. In that case, try to get your pet in an area with as much natural light as you can. Open blinds and curtains to let in the light! If natural light isn't an option, try using a detached flash. Point it up at the ceiling, and it will reflect back down on your pet to create perfect lighting.", "Pick a background that's not too busy. Aim for mostly solid colors in the background, instead of patterns and other people. For instance, grass or even a solid color piece of furniture work well in the background. If the background is too busy, your pet won't stand out as much as you'd like. Try to pick a background that makes your pet stand out. For instance, pick a bright color for a black cat, or a dark color for a blonde dog.", "Target the pet's face. Most of your pet's personality will show up in its face, so make it prominent in the pictures. If you're manually focusing the picture, use the eyes as your target! Your pet's personality shows up in their face, so try to capture that! Work on getting a photo of your pet's expressive eyes or goofy grin. For ISO, choose the lowest setting possible given the natural light (ISO 100, for instance) so you don’t get a grainy look. You will have a little more room to play around with aperture, though f/1.4 tends to be a solid choice if you want the background to be blurred. Generally, a wide aperture is best. Or Gozal", "Make your pet the whole picture. Get up close to your pet, so that they take up the whole photo. That way, your pet is the focus, and not some interesting thing in the background. It helps to get down on your pet's level if you can. Lay down on the floor or sit down. As a bonus, your pet will probably wander over to see what's going on. If you need to, you can crop the photo later to cut out the extra space.", "Wait for the perfect shots. A treat can entice a pet to look your way, but it may not. However, eventually, most pets will look at you and the camera. Just be patient and wait your pet out. While you're waiting, have your shot already set up so that when they look at you, you're ready to take the shot.", "Include your pet's personality. Whether your animal is goofy, lazy, playful, or stubborn, try to make that a part of the photo. If you're not photographing your own pet, ask the owner about the animal's personality quirks. For instance, if your animal tends to be lazy, try to capture a photo of them sleeping. If your pet can do a special trick, show that off!", "Try different angles and shots. Pets, like human subjects, look different from different angles and framing them in a variety of ways can bring a variety of perspectives to your shots. In your photo shoot, take some tightly cropped facial shots (even focusing in on a single features like the eyes, nose, or ears) but also make sure you take shots that show off your more of your pet's body. Working on different angles may give you an unexpectedly good shot you never would have gotten if you hadn't moved around some."], "intro": "Your pets are the cutest, and of course you want photos of them to post online or just have around the house! However, whether they stay still or bounce around, pets are a tricky subject for photography. You have to work with the pet to get them to look at the camera, and you have to be quick when you're taking photos!"}, "Make-a-Meme": {"Understanding Memes": ["Consider the different types of memes. There are lots of different categories of memes. Different internet subcultures also have their own meme styles. Some of the following are different styles of memes: Traditional: memes are the typical memes you see circulating on social media. They usually contain highly recognizable images, such as a scene from a movie, a celebrity, images of cats, or a viral image. They often comment on the latest trends and current events. Dank: memes involve absurd or out-of-context humor. Dank memes often try to parody traditional memes by applying them in absurd new ways. They often target memes that are going out of style or dying. Edgy: Edgy memes involve dark humor that is meant to shock people and push social norms. Wholesome: Wholesome memes are less humorous and contain a positive and uplifting message.", "Know what a meme is. The term \"meme\" usually refers to internet memes. They are typically a style of captioned images or videos that spreads through different websites and social media. There are many types of memes, but they often use repeating images, styles, or content. It can also refer to slang words, internet shorthand (i.e. LOL, BTW, WTF, etc), emoticons, or keyboard expressions.", "Understand meme humor. Most often, memes make fun of the way people react to a popular trend or current event. The humor is usually based in sarcasm. Sometimes meme humor can be absurd or patently nonsensical. The entertainment comes from pointing out the ridiculousness of a situation, or just being ridiculous. One example of meme humor is the influx of memes regarding Harambe the gorilla after he was killed by Cincinnati Zoo staff in order to save a child who fell into the enclosure. These memes used sarcasm to mock the way animal lovers reacted to the death of the endangered gorilla. An example of absurd meme humor is the practice of using bass drops or distorted sound to emphasize a moment in a video.", "Research memes that are current. Many meme styles come and go over the years. You don't want to make means that are outdated. Search for memes from the current year to see what is popular. Also, pay attention to the memes that other people are posting wherever you hang out on the internet. Whether it's Twitter, Facebook, Instagram, Reddit, or 4Chan. You should try to avoid using \"dead\" memes. A meme is said to be \"dead\" when people stop using the meme as a base image, or forget all about it. Try to find current memes from subreddits like r/memes and r/dankmemes. Moreover, sometimes a certain type of meme gets famous. In that case, you should try to make those memes. For example, recently Bernie Sanders was trending for a few days. For example, typing memes June 2020 into Google turns up many memes about how this year keeps getting worse and worse, building up to megadisaster or apocalypse. is a useful resource that catalogs different meme topics and provides detailed explanations of their origins and popular examples.", "Reference other memes or viral images and videos in your memes. When making memes, referencing popular events, books, movies, video games, and so on will increase the comedic value of the memes. For example, popular movie scenes from a movie are often used to express a reaction to an event. Popular images include Willy Wonka with a smug smile, Fry from Futurama squinting, and Joker dancing on the stairs.", "Combine two attributes that clash with one another. Pairing a tame image with explicit text (or vice versa) sets up the meme for a bizarre, nonsensical contrast. This type of absurdity is often the nature of viral memes. For example, combining an image of a kitten with profanity-laced humor is a good way to evoke an absurd tone."], "intro": "In 1976, biologist Richard Dawkins defined the term \"mimeme\" (or \"meme\" for short) as a unit of cultural transmission.[1] X Research source It is defined as a concept, idea, behavior, style, or usage that spreads from person to person within a culture. On the internet, this usually comes in the form of an image or video with a humorous caption that spreads throughout social media. Internet memes come in a variety of different styles. This wikiHow teaches you how to make a basic internet meme."}, "Speed-up-an-Android-Smartphone": {"Clearing Out Old Files": ["Tap the app list button. This is the grid at the bottom of your Home screen.", "Tap or .", "Long press and tap each file you want to delete. Each file you want to delete will have a checkmark next to it.", "Tap the button. The layout of this screen will vary depending on your device, but there's usually a trashcan button or a Delete button you can tap at the top of the screen.", "Confirm your action. Tap on the button from the dialogue box. You're done!"], "Clearing Your Cache": ["Tap the Settings app. You'll find this in the list of all of your apps.", "Tap . It may just be labeled .", "Tap .", "Tap . This will clear all of the app cache data on your device. You'll have to sign into your apps again when you next launch them."], "Transferring and Removing Pictures (Mac)": ["Connect your Android device to your Mac.", "Swipe down from the top of the Android screen.", "Tap the USB connection option.", "Tap .", "Click the menu on your Mac.", "Click .", "Double-click .", "Click your Android device in the menu.", "Click the arrow in the lower left corner.", "Click the box.", "Click the button. The pictures on your Android device will be transferred to your computer's hard drive, and will then be deleted automatically from your Android's storage."], "Transferring and Removing Pictures (Windows)": ["Connect your Android device to your computer. If you have a Mac, see .", "Swipe down from the top of the Android screen.", "Tap the notification.", "Select or .", "Open the Computer/This PC window. You can click the folder or Computer button in the Start menu, or press Win+E.", "Right-click on your Android device.", "Click .", "Click the link.", "Check the box.", "Click .", "Click the radio button.", "Enter a name for the folder.", "Click . The photos will begin copying to your computer, and will then be deleted from your device.", "Disconnect your Android after the photos finish transferring.", "Open the folder on your computer to find the photos."], "Uninstalling Old Apps": ["Tap the Settings app. You can find this in your app drawer by tapping the grid at the bottom of your Home screen. You can also typically access settings from the Notification Panel.", "Tap or or .", "Switch to the tab. This will display all of the apps installed on your device.", "Scroll through the list to find apps you don't use. Apps that you know longer use may be taking up space and running in the background, slowing your device down. You'll see the amount of space each app takes next to the entry in the list. Some versions of Android allow you to sort by size by tapping the ⋮ button.", "Tap an app that you want to uninstall.", "Tap the button. If this button is not available, the app likely came preinstalled and cannot be completely removed.", "Tap or if you can't uninstall. You may have to tap \"Uninstall updates\" first.", "Repeat for any other apps you want to remove. The more apps you can remove, the more space your phone will have. This will lead to better performance."], "intro": "To keep your Android running quickly, you'll want to remove old apps and files that you don't use anymore. Clearing the app cache can also free up a lot of space and improve your phone's performance. If your device is loaded down with pictures, transferring them to a computer can be the quickest way to safely back them up or you can also upload them onto your drive to free up your storage. Finally, you can perform a factory reset and restore the device to its original performance, this erases your app data and will reset your settings. Be sure to take backup of your personal files just in case"}, "Transfer-Music-from-the-iPod-to-an-iPhone": {"Transferring Music from iTunes to iPhone": ["Connect the iPhone to your computer using a USB cable. iTunes will launch automatically upon detecting your device.", "Click on your iPhone at the top left corner of iTunes. Multiple content tabs will display in the left sidebar of iTunes.", "Click on “Music,” then place a checkmark next to “Sync Music.”", "Select the music you want synced to your iPhone. Selecting “Entire music library” will transfer all existing music in iTunes to your iPhone, whereas selecting “Playlists, albums, artists, and genres” allows you to choose and transfer specific songs, playlists, artists, etc.", "Click on “Sync” at the bottom right corner of iTunes. iTunes will copy all selected music to your iPhone.", "Click on the “Eject” icon displayed next to your iPhone when syncing is complete.", "Disconnect your iPhone from your computer. Your iPod music will now be saved on your iPhone."], "Transferring iPod Music to iTunes": ["Navigate to the official iExplorer website at . iExplorer is an app that allows you to manage files and data on your iOS device and transfer music over to iTunes. This method is useful if you no longer have access to the computer with which you initially synced your iPod with iTunes. If the music on your iPod is already saved to iTunes on your computer, skip to Part Two of this article to transfer the music over to your iPhone.", "Click on “Download,” then select the option to save the iExplorer installation file to your Windows or Mac computer.", "Navigate to your desktop and double-click on the iExplorer installation file. The application will install itself on your computer.", "Launch iExplorer when installation is complete.", "Connect the iPod to your computer using a USB cable. iExplorer will take a few moments to detect your device. Click on “No” or “Cancel” if iTunes opens and prompts you to sync your iPod with iTunes. This prevents iTunes from deleting all existing music and media saved on your iPod.", "Click on the “Music” button. iExplorer will automatically detect and display your music files on-screen.", "Select the songs or playlists you want transferred over to iTunes. Later on, you’ll be syncing your iPhone with iTunes so these same tunes can be copied over to the iPhone. If iTunes is not already installed on your computer, . This application is required to transfer and sync music between iOS devices.", "Click on “Transfer from Device” at the bottom of iExplorer, then select “Export Selected Items to iTunes.” iExplorer will automatically export the songs on your iPod directly into iTunes. If you selected a playlist, select “Export Selected Playlist to iTunes.”"], "intro": "Transferring music from your iPod to an iPhone allows you to enjoy your favorite tunes on the go from either device. If your iPod’s music is saved to iTunes, you can sync your iPhone with iTunes to download the same playlist; otherwise, you must use an app called iExplorer to import your iPod’s music into iTunes before transferring it to your iPhone."}, "Mine-Bitcoin": {"Getting a Cloud-Mining Contract": ["Decide which cloud-mining service provider to use. There are a number of different cloud-mining service providers available, some of which are better established than others. Each service charges different fees and has different contract packages available. Genesis, Hashflare, and Minex are some of the more popular cloud-mining services. However, the most popular services with the best reputations also are frequently sold out of contracts. Research services carefully. There have been numerous cloud-mining scams. Make sure the company is legitimate and has a good reputation. You can search the name of the service and see what people are saying online about it. Websites such as CryptoCompare can also help you analyze company reputations. Visit to get started. Be careful of a cloud-mining service that makes guarantees or claims that sound too good to be true. It is likely a scam. No cloud-mining service can guarantee you a particular rate of return, or guarantee that you'll break even or start turning a profit in a short amount of time.", "Pick a cloud mining contract package. With cloud-mining, you essentially lease mining power from a miner farm for a period of time. While your contract is active, you get all the Bitcoin that is mined using that amount of mining power, minus fees paid to the cloud-mining service for maintenance of the mining hardware. Contracts typically last from 1 to 3 years, although some last longer. While shorter contracts may carry a lower price tag, it's unlikely that you'll make any money in a shorter period of time. You usually need at least 2 years to break even. Prices vary anywhere from under $100 for smaller contracts to several thousand dollars for larger contracts with more mining power – expressed as the hash rate. For example, as of 2019, Genesis offers a 2-year Bitcoin mining contract for $50, which gets you 1 TH/s (1 Tera hash per second, or 1,000,000,000,000 hashes per second). This sounds like a lot, but it's unlikely that you'd do much more than break even in 2 years on such a small plan. At the other end of the spectrum, you could get a 5-year contract for $6,125 with 25 TH/s.", "Withdraw your earnings to your secure wallet. When you purchase your contract, your mining power goes to work for you immediately. As you earn Bitcoin, it will show up on your account at the cloud-mining service. When you've accumulated enough, you can send it to your wallet. Some cloud-mining services may do regular payouts on an established schedule, such as once a month or once a quarter. Others may allow you to withdraw your earnings any time you want, as long as you have a minimum amount. The minimum can range anywhere from 0.05 BTC to 0.00002 BTC."], "Setting Up a Bitcoin Wallet": ["Download a software or mobile wallet if you're just getting started. Software wallets are kept on your computer, while mobile wallets are apps that you install on your smartphone. Software and mobile wallets are reasonably secure, can be downloaded for free, and are suitable for smaller amounts of Bitcoin. You can find a list of secure wallets approved for use with Bitcoin at . Some wallets are hybrid, meaning that you can access them through software on your computer and through an app on your mobile phone.", "Invest in a hardware wallet if you're serious about Bitcoin. Hardware wallets may set you back a couple of hundred dollars but are considered more secure. Since they aren't connected to the internet, they aren't vulnerable to hackers. If you intend to keep your Bitcoin long-term, a hardware wallet is likely a worthwhile investment. Trezor and Ledger are two of the more popular hardware wallets available. You can buy them online or at brick-and-mortar stores that sell computer supplies and accessories.", "Enable all security features on your wallet. Once you've chosen a Bitcoin wallet, set it up for maximum security to protect your Bitcoin. Use two-factor authentication to secure your account. When you log in, a code will be sent to you in a text message or email. You have to enter the code to access your account. This makes your account less vulnerable to hacking. Make sure the password you choose is secure and would be difficult for anyone to guess. If you have a password manager on your computer or smartphone, you can use that to create a secure, encrypted password."], "intro": "You've heard of Bitcoin and you're ready to get your hands on some digital wealth. However, this may be easier said than done. When you \"mine\" Bitcoin, you actually verify Bitcoin transactions in the public, decentralized ledger of Bitcoin transactions (called the blockchain). Every time you find a new block to add to the chain, the system gives you some Bitcoin as a reward. Back in the early days of Bitcoin, it was easy to mine Bitcoin using your own computer. However, as the cryptocurrency has become more popular, it has become all but impossible for individuals to make a profit mining Bitcoin. That doesn't stop a lot of people from trying, though. If you want to mine Bitcoin, you can either sign up with a cloud-mining company or build your own mining rig to mine for yourself.[1] X Research source"}, "Buy-Bitcoins": {"Exchanging Bitcoins": ["Choose an exchange service. Obtaining Bitcoin through an exchange is the easiest way to obtain Bitcoin. An exchange works like any other currency exchange: You simply register and convert whatever your currency is into Bitcoin. There are hundreds of available exchanges, and the best exchange option depends on where you are located, but the more well known exchange services include: Cryptaw: This is a Singapore Based wallet service which allows user to trade Singapore Dollars for Bitcoins. The company currently has only web platform which is also mobile friendly. CoinBase: This popular wallet and exchange service will also trade US dollars and euros for Bitcoins. The company has web and mobile apps for more convenient Bitcoin buying and trading. Circle: This exchange service offers users the ability to store, send, receive, and exchange Bitcoins. Currently, only US citizens are able to link their bank accounts to deposit funds. Xapo: This wallet and Bitcoin debit card provider offers deposits in fiat currency that are then converted to Bitcoin in your account. Some exchange services allow you to also trade Bitcoins. Other exchange services act as wallet services with limited buying and selling capabilities. Most exchanges and wallets will store amounts of digital or fiat currency for you, much like a regular bank account. Exchanges and wallets are a good option if you want to engage in regular trading and don’t need total anonymity.", "Provide proof of your identity and contact information to the service. When signing up for an exchange service, you will need to provide personal information to the service to create an account. Most countries legally require any individual or financial system using a Bitcoin exchange service to meet anti-money laundering requirements. Though you are required to provide proof of your identity, exchanges and wallets do not provide the same protection that banks do. You are not protected against hackers, or given reimbursement if the exchange goes out of business.", "Buy Bitcoins with your exchange account. Once you set up your account via an exchange service, you will need to link it to an existing bank account and arrange to move funds between it and your new Bitcoin account. This will usually be done via a wire transfer and entails a fee. Some exchanges allow you to make a deposit in person to their bank account. This will be done face to face, rather than through an ATM. If you are required to link to a bank account to use the exchange service, it will likely only admit banks from the country where the exchange service is based. Some exchanges allow you to transfer money to overseas accounts, but the fees will be much higher and there may be a delay changing the Bitcoins back into local currency."], "Learning The Advantages and Disadvantages of Using Bitcoins": ["Become aware of Bitcoin's advantages. Bitcoins major advantages include low fees, protection from identity theft, protection from payment fraud, and immediate settlement. Low fees: Unlike using traditional finance systems, whereby the system itself (like PayPal or a bank) is compensated with a fee, Bitcoin bypasses this entire system. The Bitcoin network is maintained by the \"miners\", who are compensated with new Bitcoin. Protection from identity theft: Bitcoin usage does not require a name, or any other personal information, simply an ID for your digital wallet (the means used to send and receive Bitcoin). Unlike a credit card, where the merchant has full access to your ID and credit line, Bitcoin users operate totally anonymously. Protection against payment fraud: Because Bitcoin are digital, they cannot be counterfeited, which protects against payment fraud. In addition, transactions cannot be reversed, like what occurs with a credit card charge back. Immediate transfer and settlement. Traditionally when money is transferred, it involves significant delays, holds, or other hassles. The lack of a third party means that money can be transferred directly between people with ease, and it without complexities, delays, and fees associated with making purchases between parties that are using different currencies and providers.", "Become aware of the downsides of using Bitcoin. With traditional banking, if someone makes a fraudulent transaction on your credit card or your bank goes belly-up, there are laws in place to limit consumer losses. Unlike traditional banks, Bitcoin does not have a safety net in place if your Bitcoins are lost or stolen. There is no intermediary power to reimburse you for any lost or stolen Bitcoins. Keep in mind the Bitcoin network is not immune to hackers, and the average Bitcoin account is not completely secured against hacking or security breaches. One study found 18 of 40 businesses offering to exchange bitcoins into other currencies have gone out of business, with only six exchanges reimbursing their customers. Price volatility is also a major downside. This means that the price of Bitcoin in dollars fluctuates wildly. For example, in 2013, 1 Bitcoin was worth about US$13. It then quickly moved to over US$1200, and is now approximately US$18597.99(as of 16/12/2017). This means if you are converting to Bitcoin, it is important to stay in it, as moving back to USD could result in a significant loss of funds.", "Understand the risks of Bitcoin as an investment. One of Bitcoins popular uses is as an investment, and this deserves a special word of caution before proceeding. The main risk of investing in Bitcoin is it's extreme volatility. With prices moving rapidly up and down, the risk of loss is substantial. In addition, because Bitcoin's value is determined by supply and demand, should Bitcoin end up being subject to government regulation in any form, it could reduce the amount of people who want to use Bitcoin, which could theoretically make the currency worthless."], "Setting Up Bitcoin Storage": ["Store your Bitcoins online. In order to , you first need to create a storage site for your Bitcoins, and this is the first step to purchasing Bitcoin. Currently, there are two ways you can store Bitcoins online: Store the keys to your Bitcoins in an online wallet. The wallet is a computer file that will store your money, similar to a real wallet. You can create a wallet by installing the Bitcoin client , which is software which powers the currency. However, if your computer is hacked by a virus or hackers or if you misplace the files, you may lose your Bitcoins. Always back up your wallet to an external hard drive to avoid losing your Bitcoins. Store your Bitcoins via a third party. You can also create a wallet by using an online wallet via a third party site like Coinbase or blockchain.info , which will store your Bitcoins in the cloud. This is easier to set up, but you will be trusting a third party with your Bitcoins. These sites are two of the larger and more reliable third party sites, but there are no guarantees about the security of these sites.", "Create a paper wallet for your Bitcoins. One of the most popular and cheapest options for keeping your Bitcoins safe is a paper wallet. The wallet is small, compact, and made of paper that has a code. One of the benefits of a paper wallet is the private keys to the wallet are not stored digitally. So it cannot be subject to cyber attacks or hardware failures. Several online sites offer paper Bitcoin wallet services. They can generate a Bitcoin address for you and create an image containing two QR codes. One is the public address you can use to receive Bitcoins and the other is a private key, which you can use to spend Bitcoins stored at that address. The image is printed on a long piece of paper that you can then fold in half and carry with you.", "Use a hard-wire wallet to store your Bitcoins. Hard-wire wallets are very limited in number and can be difficult to acquire. They are dedicated devices that can hold private keys electronically and facility payments. Hard-wire wallets are usually small and compact and some are shaped like USB sticks. The Trezor hard-wire wallet is ideal for Bitcoin miners who want to acquire large numbers of Bitcoins, but do not want to rely on third party sites. The compact Ledger Bitcoin wallet acts as USB storage for your Bitcoins and uses smartcard security. It is one of the more affordable hardwire wallets on the market."], "Understanding Bitcoins": ["Understand Bitcoin basics. Bitcoin is a completely virtual currency, that allows consumers a way to exchange money for free, without the use of a third party (like a bank, credit card company, or other financial institution). Bitcoin are not regulated or controlled by a central authority like the Federal Reserve and all Bitcoin transactions take place in an online marketplace, where users are anonymous and untraceable for the most part. Bitcoin allows you to exchange money instantly with anybody in the world, without needing to create a merchant account, or use a bank or financial institution. Transferring money does not require names meaning there is little risk of identity theft.", "Learn about Bitcoin mining. To understand Bitcoin, it is important to understand Bitcoin mining, which is the process by which Bitcoin are created. While mining is complex, the basic idea is that each time a Bitcoin transaction is made between two people, the transaction is logged digitally by computers in a transaction log that describes all the details of the transaction (like the time, and who owns how many Bitcoins). These transactions are then shared publicly into something known as a \"block chain\", which states every transaction, and who owns every bitcoin. Bitcoin miners are individuals who own computers that constantly verify the block chain to ensure it is correct and up to date. They are the individuals that confirm transactions, and in exchange for doing so, they are paid in bitcoin, which increases the supply. Since Bitcoin is not overseen by a central authority, mining ensures that the individual transferring the bitcoin has enough, that the agreed upon amount is transferred, and that the balance for each member of the transaction is correct afterwards.", "Gain familiarity with the legal issues surrounding Bitcoin. Recently, the federal agency responsible for combating money laundering announced new guidelines for virtual currencies. The updated guidelines will regulate Bitcoin exchanges, but will leave the rest of the Bitcoin economy alone, for now. The Bitcoin network is resistant to government regulation, and it has gained a loyal following among people who engage in illegal activities like drug dealing and gambling due to the fact money can be exchanged anonymously. However, transactions are still traceable, and the FBI was able to seize numerous bitcoin wallets used by bad actors. Federal law enforcement may eventually conclude that Bitcoin is a money-laundering tool and may look for ways to shut it down. Shutting down Bitcoin completely would be a challenge, but intense federal regulation could push the system underground. This would then diminish the value of Bitcoins as legitimate currency."], "Using a Seller": ["Search for sellers on LocalBitcoins. This is the primary site used to make face-to-face trades with a local seller. You can arrange a meet up and negotiate prices for the Bitcoins. The site also has an added layer of protection for both parties.", "Use Meetup.com to find sellers. If you are not comfortable with one on one trades, use Meetup.com to look for a Bitcoin meetup group. You can all then decide to buy bitcoins as a group and learn from other members who have used sellers to buy Bitcoins before.", "Negotiate the price before the meet up. Depending on the seller, you may pay a premium of around 5-10% over the exchange price for a face-to-face trade. You can check the current Bitcoin exchange rates online via before agreeing to the seller’s rate. You should also ask the seller if they prefer to be paid in cash or via an online payment service. Some seller may allow you to use a PayPal account to pay, though most seller prefer non-reversible cash as payment. A reputable trader will always negotiate the price with you before you meet up. Many will not wait too long to meet up once the price is finalized, in case Bitcoin’s value takes a dramatic shift.", "Meet the seller in a busy public place. Avoid meeting in private homes. You should take all the precautions, especially if you are carrying cash on you to pay the seller for the coins.", "Have access to your Bitcoin wallet. When you meet the seller face-to-face, you will need to access your Bitcoin wallet via your smartphone, tablet, or laptop. You will also need Internet access to confirm the transaction has gone through. Always check that the Bitcoin has been transferred into your account before you pay the seller."], "intro": "Bitcoin is an online alternative currency system, which acts as a form of digital money. Bitcoin is used both as an investment, and as a method of payment for goods and services, and is touted as a means to do so without needing to involve any third parties. Despite their growing popularity, most businesses still do not accept Bitcoin, and their usefulness as an investment is both highly questionable and potentially risky. Before proceeding to buy Bitcoin, it is important to understand what it is, and its advantages and disadvantages.[1] X Research source"}, "Build-a-Simple-Robot": {"Creating the Battery Compartment": ["Make sure that your battery fits in the holder. Before you connect any wires to the battery holder, try sliding the battery into its slot and securing it with the built-in clamp. If the battery is too small or too large, you'll need to purchase the correct size before you can run your robot. Your battery holder's packaging or included documentation should have a section regarding the supported sizes of battery.", "Find the battery holder's positive and negative connectors. These should be two pins on opposite sides of the bottom of the battery holder; the pin connected to the clamp which holds the battery is the positive connector, while the adjacent pin is the negative connector. You'll need to know which connector is which when attaching the motor and circuit to the battery holder.", "Use the needle nose pliers to bend down the connectors. The connectors should be bent away from the center of the battery holder so that they face outward.", "Prepare a hook up wire for soldering. Cut about four inches of hook up wire off of the spool, then use the wire strippers to remove 3/4 of an inch of tubing from each end of the wire.", "Solder the wire to the positive connector. Place an exposed end of the wire on the positive connector, then use your soldering gun and solder to cement the wire in place. Once you've successfully soldered the wire in place, you can proceed to the next part."], "Creating the Circuit": ["Lay out the resistor, photoresistor, and transistor. These are the components of your robot's circuit.", "Bend away one of the transistor's three leads. While you'll use two of the transistor's wires (or \"leads\") in the circuit, one of the leads must be left alone for later; you can use the needle nose pliers to bend this lead over.", "Trim the photoresistor's leads. The photoresistor's two leads are usually an inch to an inch and a half in length, so use the wire cutters to snip all but about 3/4 of an inch off of the leads. This will make the photoresistor less cumbersome to mount later.", "Connect the battery compartment to the photoresistor. Take the other exposed end of the wire that you soldered to the battery holder, then solder it to one of the photoresistor's leads.", "Connect the photoresistor to the transistor. Solder each of the photoresistor's leads to each of the unbent transistor leads.", "Connect the 4.7k resistor to the photoresistor. You'll solder one end of the resistor to the photoresistor lead that isn't connected to the battery compartment's wire. At this point, your photoresistor should have one lead that's connected to a transistor lead and the battery compartment wire, and one lead which is connected to a transistor lead and the resistor lead."], "Getting the Necessary Parts": ["Know where to look. You can find most of the electrical parts listed in this section in most stores which sell electrical or automotive supplies; additionally, you can find all of the parts listed here online at places such as Amazon and eBay. If possible, shop online for the components. You'll have a better opportunity to read reviews of the products, and you may qualify for a shipping discount.", "Purchase a pack of hook up wire. Hook up wire, also called circuit wire, is basic copper wire in a plastic sheath. If you have a choice, opt for stranded hook up wire rather than solid wire. Stranded is easier to manipulate and solder within the parameters of this project.", "Buy a coin cell battery holder. This is essentially the body of your robot; it will hold the battery, host the main connections, and mount the \"feet\" of the robot. Make sure that your battery holder uses a clip to secure the battery. Your battery holder should have two basic wire connectors—one positive and one negative—on the bottom. If you find a holder which has a different layout, the assembly instructions may not work.", "Purchase a 3V coin cell battery to fit your holder. Coin cell batteries are round, flat batteries which are often used to power items such as watches and other small electronics. You can find them in most department stores, though an electronics store or a Home Depot may be a better place to look.", "Find a few ball bearings. To create the robot's \"feet\", you'll need three 5/16ths inch diameter ball bearings. You can find these in several home appliances (e.g., old DVD players), but you can also purchase new ones at most automotive or electronics stores.", "Buy the circuit components. In order to create the circuit that will tell the robot to move when exposed to light, you'll need the following items, all of which can be found online: One 4.7k resistor (1/2 W) One photoresistor (also called a photo cell) One 2N3904 transistor", "Find or buy a micro vibration motor. Vibration motors, such as the ones found in older cell phones, can be purchased online and in most electronics stores. Make sure you buy a model of vibration motor that has a red wire and a blue wire for its connections. If you have an old flip phone or pager, you can take it apart and pry out the vibration motor. Using a vibration motor which doesn't have red and blue wires will result in the assembly instructions not working.", "Make sure you have the correct tools. Before you can put together your robot, ensure that you have (and know how to use) each of the following items: Solder gun and solder Hot glue gun Wire cutters Wire strippers Needle nose pliers Electrical tape (or similarly opaque, easily removed tape)"], "intro": "This wikiHow teaches you how to make a simple, light-activated robot that can vibrate its way across a surface. While the robot detailed here won't perform complex tasks, building it will help you develop a basic understanding of circuitry fundamentals which you can use to build more complicated robots in the future. Keep in mind that you'll need a budget of around $50 for this project if you don't already have most of the required components."}, "Calculate-the-Cost-of-Driving": {"Calculating Fuel Costs": ["Calculate fuel costs by writing down the number of miles or kilometers on the odometer when the fuel tank is nearly empty.", "Fill the tank when it is near empty. Do not top off the tank.", "Refill the tank when it is near empty again and write down the number of gallons or liters it took to fill. Do not top off when refilling.", "Check the odometer again at refilling and subtract the old number on the odometer from the new number to see how far you drove. Write down the difference between the two odometer readings. If the number was 30,000 miles (48,280 km) when you filled the tank the first time and 30,300 (48,763 km) when you refilled, you drove 300 miles (482.8 km) on 1 tank of gas.", "Divide the number of miles or kilometers you drove by the number of gallons or liters it took to refill your tank. For example, if you drove 300 miles (482.8 km) and burned 15 gallons (56.78 liters) of gasoline, your vehicle got about 20 miles per gallon (8.5 km per liter).", "Divide the distance driven in a month by the miles or kilometers per gallon or liter. (If your car has 30,000 miles [48,280 km] and is 40 months old, you drive about 750 miles [1,207 km] per month.) In this hypothetical example, divide 750 (1,207 km) by 20 gallons (75.7 liters) to get the number of gallons or liters you burn per month: 37.5 gallons (142 liters).", "Multiply the total amount of fuel per month you burn by the cost of a gallon or liter of gasoline to get your monthly fuel costs. If gas costs $4 per gallon ($1.05 per liter), you spend $128 per month on fuel, or 17 cents per mile (10 cents per km)."], "Maintenance and Insurance": ["Add up what you spend in a year on oil changes, tires and other maintenance, car repair bills, and insurance. Divide this total by 12 to get the monthly total. If the total is, for example, $1,890 per year, the monthly cost for maintenance, repairs and insurance is $157.50 per month.", "Add inspection and registration costs for a year and divide by 12. If the total is $100 per year, the monthly cost is $8.33."], "intro": "If you learn how to calculate the cost of driving, you can determine how much of your paycheck you spend on driving. Calculate fuel costs, maintenance and insurance to get a rough idea of the most basic expenses."}, "Keep-Warm-in-a-Car": {"Tips to Warm Yourself": ["Wear as many layers as you can. Layering is key to staying warm in the cold, so put on as many clothes as you can fit on yourself. Wear multiple shirts, pants, socks, pairs of underwear, and jackets to preserve your heat. Also wear a hat and gloves to prevent heat from escaping your body. Keep your shoes on as well. You’ll lose heat through your feet, even if you’re wearing several pairs of socks. Sleep in all your layers if you're car-camping. This might not be the most comfortable thing in the world, but you'll stay warm. If you have other clothes leftover, you can use them to insulate the windows.", "Bring a sleeping bag to stay warm at night. This is your best choice if you’re planning on sleeping in your car. Pack a good, thick sleeping bag and bundle up in it as soon as you settle in for the night. There are specialized, cold-weather sleeping bags built for temperatures below 0 °F (−18 °C). These are expensive, but they’re a good option to stay warm with.", "Pack an insulated sleeping pad if you can plan ahead. If you're on a car-camping trip, then this is an essential piece of gear. An insulated foam sleeping pad prevents you from losing heat through the bottom of the car. Roll it out and lay on it when you go to sleep to preserve heat. There are also inflatable sleeping pads that use air as insulation. These might not work as well as foam, but they're much better than nothing.", "Wrap yourself in a blanket if you’re staying still. Even if you’re wearing layers, some extra covering is always good to stay warm. If you have a blanket in the car, wrap it around yourself to preserve as much heat as you can. If you don’t have a blanket, towels can work too. In an emergency, you can also use the car floor mats. Space blankets, the reflective silver sheets you’ve probably seen on TV, are a great emergency item to keep in your car at all times. Break these out if you have them.", "Put a hot water bottle in your sleeping bag. This is a classic cold-weather camping trick. Heat some water over a fire or stove and pour it into a hot water bottle. Then stuff that bottle into your sleeping bag to give off some extra heat. Always check the bottle to make sure it isn't too hot before putting it in your sleeping bag. You don't want to get burned.", "Avoid breathing into your blankets or sleeping bag. You might want to cover your face to keep it warm, but this is actually a bad idea. Breathing under your covers traps moisture in there, which can make you colder. Resist the urge and keep your face above your covers. If you need to keep your face warm, try using a ski mask or face covering instead. This way, you won't have to cover your face with a blanket.", "Do light exercises to warm yourself up. Moving produces heat, which helps you and the car stay warm. Keep moving and do some light exercises to bring your body temperature up and fight off the cold. As a bonus, this also makes the time go by faster. You don’t have a lot of room in a car, but you can still do simple exercises. Do some neck rotations, leg squeezes by tensing and releasing the muscles in your legs, and hand pushes by pressing your hands together firmly. If you fold your backseats down, you might even have room for some pushups or sit-ups. Try to get creative and do any other exercises you can come up with. Simply tapping your feet burns calories too, which provides a bit of heat. Don’t exercise hard enough to start sweating. This will actually cool your body off.", "Eat to make your body produce heat. Eating and digestion actually warm your body up, so don’t resist the urge to snack. If you have food, eat it before it freezes to keep your body heat up. Healthy fats are especially good for keeping you warm, so pack some nuts or peanut butter if you’re planning ahead.", "Drink plenty of water to stay hydrated. You might not think of this, but dehydration is a real danger because your body needs water to keep itself warm. You also might not realize that you’re thirsty when you're cold. Drink plenty of liquids while you’re in the car so you don’t get dehydrated. If you can, drink hot beverages like tea or coffee. There are plug-in travel mugs you can use to heat drinks and keep them hot. If it’s cold enough for water to freeze, keep your water bottle wrapped inside your blanket with you. Your body heat will prevent it from freezing. Never eat snow to hydrate yourself. This will cool your body temperature down and might cause hypothermia.", "Huddle with others if you’re not alone. Sharing body heat is a tried and true method for avoiding hypothermia If there are other people in the car with you, huddle close together to keep each other warm. If you have blankets, wrap yourself up together to share as much heat as possible. If you're on a camping trip, sleep close together with others to combine your heat at night."], "Tricks to Heat the Car": ["Clear any obstructions from the tailpipe before running the heat. If anything is blocking your tailpipe, carbon monoxide will build up in your car while it's on. This is a particular risk if you're , since snow can pile up without you realizing it. Always clear away anything blocking your tailpipe before turning the heat on. It's good to keep a small shovel in your car for situations like this.", "Run the heat for 10 minutes each hour. If you’ll be in the car for a few hours, give yourself little blasts of heat hourly to stay warm. Start the car and run the heat for 10 minutes at a time to warm the car back up. Then turn it off to save your gas. If you’re sleeping and you wake up cold, you can run the heat for a few minutes to warm yourself before going back to sleep. Don't get the car so hot that you start sweating. Sweat will make you colder. If the heat in your car is broken, there are dashboard heaters that can plug into your car. This is a great option if you aren’t stuck, but your heat just doesn’t work.", "Insulate your windows to stop heat from escaping. Your car will lose a lot of heat through its windows, so block them off. Any type of covering can work as insulation. In a pinch, solar windshield shades work well. You can also use newspaper, cardboard, plastic bags, or anything else that might be in the car. Line your windows with these items to stop heat from escaping. If you’re planning ahead, foam is a great insulator. Get some foam sheets from a hardware store and cut them to fit your windows. Then just stick them into place when you stop the car. If you have blankets or towels, it’s better to wrap yourself in those than use them for your windows. However, if you’re layered enough, you can also use these to insulate your windows. Stuff cracks in the doors with newspaper as well if you have any extra.", "Crack a window open if the weather is damp. This might sound counterintuitive, but keeping the car sealed in damp weather lets moisture build up in the car. This will make you colder over time. Open one of the windows just a crack to let some of that moisture out."], "intro": "Cars are great for protecting you from wind and rain, but without the heat running continuously, they won’t keep you very warm in cold weather. Whether your heater doesn’t work, you're on a car-camping trip, or you need to spend the night in your car during a snowstorm, it’ll unfortunately get cold in there before too long. But it’s not the time to panic! Keeping warm in a cold car is easy with the right steps."}, "Choose-a-Hiking-Vacation-Destination": {"Evaluating Difficulty": ["Choose easy class 1 or 2 trails if you’re a beginner. Your level of experience is an essential consideration when choosing a hiking destination. Easy trails are well-maintained with little elevation, moderate trails have steady ascents with some roots and other obstacles, and strenuous trails have steep ascents and frequent obstacles. Trails are often rated on a scale of 1 to 5, with class 1 being easy hiking with minimal elevation and class 5 being advanced-level rock climbing. Check potential trails’ ratings and avoid choosing a trail that’s beyond your experience level.", "Map your route’s length according to your experience. If you’re just starting out, a 5-mile (8 kilometer) round trip hike is a good maximum distance. Use a potential trail’s map to plan out your day hike or, if you’re more experienced, your multi-day backpacking trip. While the range you can cover per hour will depend on trail difficulty, an average rate is about 1.5 miles (about 2.5 kilometers) per hour. When you plan your trip, make sure you have enough time to complete your hike before sunset.", "Take your kids and pets into account. If you’re planning a trip with your family, look for a trail that’s easy enough for the youngest child joining you. Search for kid-friendly trails around the travel location you’ve chosen. If you want to hike with your dog, it’s best to avoid climbing trails with steep inclines that require opposable thumbs. When hiking in groups, remember that a trail’s difficulty level should always match the least experienced hiker’s abilities."], "Finding Desirable Trails": ["Choose the type of scenery you’d like to see. From waterfalls to sprawling stretches of forest, a hike can offer a range of gorgeous vistas. Think about the natural beauties that appeal to you and include them in your search queries when you look for trails. For example, if you want to find a location that offers endless views, look for a hiking trail that increases in elevation and culminates at the top of a hill or mountain.", "Keep your budget in mind. As you consider the scenery and environments you’re interested in, look for spots that you can travel to affordably. You’ll have more options available if you can afford to travel long distance but, even on a budget, you’ll be able to track down an appealing destination closer to home. While you might not be able to find a nearby tropical forest trail if you live in a temperate environment, chances are you’ll be able to track down an awe-inspiring vacation destination without having to spend lots of money on long-distance travel.", "Decide if you want to day hike or camp. If you’re a beginner, it’s best to stick to day hiking, so look for a nearby hotel or cabin and, if necessary, a car rental agency. If you’re more experienced, look for backpacking trails that have resources like fresh water and suitable campsites. If you plan on camping overnight, you’ll most likely need to acquire a permit and register with the local park service. Park or trail websites will include maps that note resources for camping and any applicable registration procedures.", "Search online for trails. After getting a general idea of the types of environments and trails that appeal to you, look for a match online. The easiest way is to enter your location (or a location where you’d like to travel) and keywords like \"hiking\" and \"backpacking\" into a search engine. Include terms like waterfall, mountains, old growth forest, and other environmental characteristics in your search. You can also look for destinations on the American Hiking Society’s website. Try searching for locations using the U.S. National Park Service. Look for international destinations on Trails.com.", "Look for trip reports and reviews. Once you’ve put together a list of potential trails, try to find out what other hikers have said about their experiences. Search for a local hiking association or organization with trip reports, and check Google for reviews. For example, if you’re thinking about visiting a hiking trail in Washington, U.S., search the Washington Trails Association website for a trip report. While you can usually find good recent photographs on Google listings, take the reviews with a grain of salt. Remember that any positive or negative online review might be biased. A report by an experienced hiker on a hiking association or organization website will most likely provide more credible information."], "intro": "A hiking vacation can offer fresh air, pristine scenery, and great exercise. To choose the best destination, first decide what kind of sights and environments you’d like to see, like waterfalls or mountains. Figure out whether you want to stay local or spend money on long distance travel. Look for trails and parks online using search engines, websites of hiking associations and organizations, and national or state park services. To narrow your list, research trip reports and find out trails’ difficulty levels to find one that matches your abilities."}, "Choose-a-Good-Hiking-Dog": {"Assessing Your Dog's Traits": ["Determine how trainable the dog is. Some breeds are more independent and hard to train than others. If you want your dog to be able to frolic off-leash, you'll need a dog with good recall (comes when called). If you do plan to let your dog off his leash, avoid dogs with a strong prey drive. The last thing you want is for your dog to run away after a squirrel, never to be seen again. Herding, sporting, and retrieving dogs tend to stick close to their owners. If you plan on keeping your dog on a leash on all your hikes, trainability isn't as important.", "Consider the dog's fur versus your climate. If you're going to be doing a lot of cold-weather or rainy hiking, ideally you want a dog that will have a warm, waterproof coat (consider the Spitz breeds). If you'll be in the sun, a long-haired, dark dog might overheat easily. If you know the breed of the dog, research what they were bred for. Dogs that were bred to work outdoors in an environment like yours will be the most comfortable. Your dog will get dirty on the trail. Be prepared to give a dog with a more generous coat baths more often, or favor a breed that is very fastidious about cleaning itself (e.g. Shiba Inu). Long-haired dogs are likely to get burrs, and are more difficult to inspect for fleas and ticks. Short-haired dogs will get cold more easily and may need to wear special hiking gear (like an insulated jacket) while hiking outdoors.", "Think about the size and weight of the dog in practical terms. You may encounter specific situations when hiking that require a certain amount of physical strength on your part or that of the dog. Consider the following questions: If the dog gets hurt, would you be able to carry it home? If it falls down to an area where you can't reach it, do you have the strength to hoist it up? If you carpool often, remember that a bigger dog will be harder to squeeze into a vehicle full of hikers. If you need to cross a stream, will you let the dog cross on its own or will you need to carry it?", "Get a dog that plays nicely with other dogs. If you come across other canine hikers, it'll make life easier for everyone if you have a dog that isn't aggressive toward other dogs (especially if some of your human hiking companions have dogs of their own). If you're getting a puppy, be sure to socialize it during that critical 8-12 week period. Introduce it to well-mannered dogs that are vaccinated. If you're getting an older dog, make sure it already gets along with other dogs. Know how to break up a dog fight, just in case."], "Choosing the Right Breed": ["Find a breed that is agile. If you're going to be on trails with steep drop-offs or rocky cliffs and your dog will be off-leash, it's better to have a dog that watches her step and has good balance than to get a dog that in her excitement might slip and fall. An agile dog will be an excellent companion for hiking because they'll be able to navigate tricky paths and trails without much assistance from their owner. Some dogs that fall in this category include: Weimaraner Akita", "Choose an easily trainable dog. Dogs that are easy to train usually make excellent hiking companions because they can learn the trails and how you expect them to behave quickly. They will also usually interact well with other hikers and dogs. Some of these breeds include: German Shepherd Labrador Retriever Norwegian Buhund", "Be cautious about certain breeds. Some dogs (like the Pitt Bull and Rottweiler) are prone to aggression unless trained very diligently. Others are difficult to train – like Huskies and Akitas. Be careful when choosing one of the following breeds as a hiking partner: Pitt Bull Rottweiler Shiba Inu Husky", "Look for a dog with good endurance. A greyhound or a whippet, for example, will probably not enjoy a 10 mile (16 km) hike because they are bred for sprinting, not endurance. Additionally, flat-faced breeds such as English Bulldogs will struggle to breathe on long hikes and in hot weather, and so generally shouldn't undertake endurance activities. Some breeds with high endurance include: German Shepherd Chesapeake Bay Retriever"], "intro": "If you're an avid hiker and backpacker and you're thinking about getting a dog, why not choose one that will be comfortable in the woods with you? Most dogs will enjoy a hike, but not all will be able to handle life on the trail. In order to choose a good hiking dog, you'll need to consider specific breed characteristics as well as the physical and mental demands that hiking will place on your dog. You'll also need to devote some time to training your dog to get it ready for the trail. Keeping these things in mind will help you choose the canine hiking partner that's right for you."}, "Become-Popular-on-TikTok": {"Creating Content": ["Make at least one video every day. The best way to stay relevant to TikTok and get new followers is to produce content every single day. The more videos that you make, the more likely you are to gain new followers. Once you’re regularly making videos, you’ll develop a following that regularly checks your videos out. If you can get your average viewer count up, you’ll be more visible to a greater number of new users! Your videos don’t always have to be giant productions. It’s okay to stick to the simple sing-along videos if you don’t have any crazy ideas on a given day.", "Dress up and use costumes whenever you have the time. If you’re wearing a costume or have a cool background in your video’s thumbnail, users are more likely to click your video. Dress up based on the theme of the song. You can match a song by wearing clothes that relate to it. For example, a funny top hat and old tie could work with an old swing or ragtime song. You can also do the opposite, like dressing up in a Halloween costume while pretending to sing a very serious song to get a laugh.", "Film in unique locations to create interesting videos. Most users record singalong videos in their bedroom or living room. There’s no reason that you can’t make a TikTok outside though. Try performing your song in public places to leverage other people’s reactions. Use unique set pieces when you’re traveling by recording in front of interesting landmarks. If you’re allowed to use your phone at school, recording at lunch or recess can be an excellent time to incorporate your classmates in skits and videos. You can easily change the look of your room by switching out the lightbulbs. Pick up some red or blue lights to give your room a different feel when you’re making videos.", "Change the speed of the song and use filters for a comedic effect. Every once in a while, try mixing it up by changing the speed of the song or using a filter. Tap the + at the bottom of your screen before recording, add your song, then tap the “speed” button to change it. To add filters, press the + and click the filters icon to scroll through new additions. New filters are always popular whenever they come out. Make sure that you experiment with new filters whenever they’re released. Some users end up annoying their followers if they use filters or change the speed too frequently. Don’t do this every day or you’ll end up alienating your audience.", "Participate in popular challenges whenever you can. A challenge is a format or joke that uses an individual song, and certain challenges can dominate the trending videos tab for weeks at a time. To make a challenge video, study a few examples and try to put your own spin on the format. Whenever a challenge is becoming popular, participate! Take your time when crafting challenge videos, since they’re more likely to be seen than your normal videos. Popular challenges have included the #idolchallenge, #InMyFeelingsChallenge, and #UnMakeupChallenge. There is even a popular #wikiHowChallenge that incorporates loud music sounds and wikiHow images! For example, the #wikiHowChallenge involves using the song “Walk” by Comethazine and finding a random image on wikiHow at the beginning of the vine. Then you reenact the image by taking the same stance right when the beat drops. Every challenge uses different songs and jokes.", "Dance whenever possible, even if you’re bad at it. TikTok users love dancing, and music is a prerequisite for the site, so you’re going to see a lot of it. Whether you’re making serious lip-syncing videos or goofy comedic skits, users respond to dancing. If you’re good at it, come up with your own routines for popular songs. If dancing isn’t your strongest quality, simply have fun and use goofy moves to draw your audience in. A lot of popular challenges and hashtags use a specific dance. Study these moves and practice them by watching examples before completing them on your own.", "Livestream video to interact with followers in real-time. You can use the TikTok app to stream live video instead of publishing a prerecorded clip. You can only use this feature if you have 1000+ followers. TikTok followers love to chat and watch the people they follow when they go live. Every once in a while, go live by opening the account and pressing the + button. Tap the “Live” button to start your stream. Add some hashtags to your stream title to make it easily searchable. Streaming can take up a lot of bandwidth and you may not get great video quality depending on where you stream from. While streaming you can listen to music, show followers how to do makeup, answer questions, work out, or go about your everyday activities. There’s really no limit on what you can do while streaming!"], "Developing a Niche and Getting Noticed": ["Emphasize a certain kind of music or video to appeal to a unique audience. One way to get noticed is to focus on a specific genre of music, like hip hop, jazz, or country. If you’re a particular fan of a specific type of music, use it often in your videos to get like-minded followers. Focusing on a specific style of video can be helpful as well. Comedic skits, perfect lip-syncs, and challenge-only users are all popular with their respective audiences. You can focus on a specific style of video and genre of music while regularly making whatever you want. Having a focus doesn’t mean that you have to only make a certain kind of video, but it does help to build a following. TikTok videos are between 15-60 seconds, but most videos aren’t longer than 20.", "Focus on making awesome videos if you’re good at it. Lip syncing is the foundation of TikTok, and most users make these kinds of videos. If you enjoy this traditional element of TikTok, make lip-syncing videos. Memorize 6-15 seconds of a song and try to match the lyrics perfectly with your mouth. You can mute your microphone and even sing it out loud if that makes it easier! Lip syncing requires knowing the words to a song. Listen to a song multiple times before making your video so that you can memorize a portion of it.", "Become a user by focusing on comedy videos. TikTok has its memes and comedic formats. From Lil Nas X’s “Old Town Road” to the surprised time traveler, there is no shortage of comedic material specific to TikTok. Follow comedic hashtags and look for popular meme users to get a jump on new jokes and build a following with that audience. If you’ve got a knack for comedic timing and aren’t all that interested in lip-syncing, this is an excellent route to becoming popular on TikTok.", "Select popular songs to hop on growing trends. Click the “Discover” tab to find popular trends. Watch the first 5-15 TikToks in the trending section at the beginning of every day to see if there are any new songs that users have latched on to. If there is a fresh trend relating to a new song, incorporate it into your daily video so that you show up when other users search that tag later in the day. The songs that are popular on TikTok may not be the same songs playing on the radio. In general, people react to things they recognize. If you can capitalize on a popular trend you can easily increase your number of followers.", "Pick weird or unique songs once you’re established. Once you have a few hundred followers, you can attract new viewers by mixing it up. Once every 2-3 days, ignore the “popular music” and “trending” tabs and look through TikTok’s other musical categories to find something different. Choose a distinct song that will make you stand out when users are scrolling through feed to get more eyes on your videos. Children’s music, like “Baby Shark,” can often make for some funny videos. Use songs from popular soundtracks and recreate the scenes with your friends."], "intro": "TikTok is a social media site where users use popular songs to make skits and lip-syncing videos. To become popular on TikTok, consistently make videos that appeal to the majority of TikTok users. You can do this by making serious lip-syncing or dancing videos that showcase your skill, or you can go the other direction and make fun of songs in comedic skits. To increase the chances that you’ll become popular on the platform, focus on a specific style or genre and participate in popular trends and challenges."}, "Make-Someone-Fall-in-Love-with-You": {"Being Lovable": ["Take good care of yourself. Physical appearance plays a huge role in whether or not someone will be attracted to someone else. How well you care for your physical health and appearance is something that people can see right away, so it is worth putting some extra time and energy into while you are trying to attract someone. People will notice if you don’t care for yourself and this may make someone lose interest. To ensure that you look your best, exercise, eat right, practice proper hygiene and wear clean, flattering clothing. Don't be afraid to capture attention.", "Make a name for yourself, do something that they will remember and show them that there is so much more to you than just a pretty smile. Make sure that your personality shines through and he/she knows about your likes and dislikes. Being passionate about something is very attractive and others will take notice. Be proud of your accomplishments and confident in your abilities. Confidence is something that people admire, so don’t be shy about what you have accomplished.", "Be kind. Treat others the way you want to be treated. It may sound cheesy, but it's true. If you want others to treat you with care and respect, you should start treating others this way, too. People are more likely to fall in love with other people who have great personalities, who are polite, and who are kind to others.", "Show your flaws. Let him or her see how far you’ve come. For example, if you are fit and active now, but you used to be a couch potato, tell the person about your transformation. Revealing some of your past shortcomings to someone will allow him or her to see the real you and appreciate you even more."], "Developing a Bond": ["Get to know the person better. The first step in getting someone to love you is to get to know the person better and allowing the person to get to know you. Getting to know someone takes time and energy because you will have to ask the right questions and listen well. Ask about what your love interest wanted to be as a child and what he or she wants to do now. This will tell you about the person’s hopes and dreams, as well as other things that he or she wants to get out of life. Ask about likes, dislikes, interests, hobbies, and goals.", "Share the person’s passions. Show an interest in the things that your love interest loves and learn to appreciate the things that make him or her happy. Don’t fake your interest because people can often tell when you are not really interested in something. Try to experience the person’s interests through his or her eyes and share in that passion. This will give you something to bond over and put you on the path towards love. For example, if the person is a big fan of a sport that you don’t know much (or anything) about, ask him or her to tell you more about it or teach you how to play. Or, if the person is really into a certain kind of music, listen to a lot of that music and find some songs that you like too.", "Treat the person like a hero. Make your significant other feel like your hero/heroine when they’re around you. Let him or her help you with schoolwork (to make him or her feel smart), ask for personal advice (to make him or her feel wise), and ask for help or advice on subjects that are particularly important to the person (to give him or her a chance to demonstrate expertise). Asking for clothing advice or help reaching or opening containers are also ways that you can make your significant other feel useful and capable.", "Create trust. Trust is an essential component in a healthy, long-lasting relationship. Learn to trust your significant other and show that you trust him or her with your words and actions. Make sure that you show your significant other that you are trustworthy as well. If your significant other tells you a secret, keep it. If you find out something that embarrasses him or her, don’t bring it up or tease him or her about it. Share your secrets with your significant other and reveal parts of yourself that no one else sees. Allow yourself to be vulnerable with your significant other and let him or her comfort you.", "Support your significant other during difficult times. Offering support is very important to creating true love between two people. Most people want to be in relationships to begin with because they like having someone to support them. If you can be supportive and caring to your significant other, this will go a long way towards getting the person to fall in love with you. Sometimes you can support someone by offering to just listen and provide physical comfort. But other times, you may need to do something more. For example, if your significant other is struggling in school, you may need to help him or her study."], "Keeping Them In Love": ["Appreciate your significant other. Don't ever take the person for granted. If someone falls in love with you, you’ll need work to maintain that love. The best way to keep someone in love with you is to never, ever take the person for granted. Show the person that you appreciate him or her every day. For example, say thank you when your significant other does something nice for you. Make sure that the “thank you” is sincere and specific. For example, “Thank you for putting away the dishes and making coffee this morning! That made my morning so much easier! I really appreciate it.”", "Spend quality time together. Just because you’re both in love and your relationship seems stable and at its peak doesn’t mean you should stop putting in an effort. Continue to go on dates, buy each other flowers, and things like that. This will show your significant other that you still care and are still invested in the relationship. Most importantly: tell your significant other “I love you” every day.", "Keep things exciting. Don’t just do the same things you always do. Routines can be nice, relaxing, and even comforting but it’s important to break out every now and again and do something new and exciting together. This shows your significant other that there are still things to look forward to in the relationship and that their lives won’t stagnate by being with you. It can also help recapture some of the excitement associated with first falling in love. Do something daring like skydiving or rock climbing. Take up dance classes or learn to paint together. Learn something new together, like furniture building, which can be used to fill your living space with things you create together. Try introducing a board game night, which will give you the chance to have fun together and indulge your competitive sides."], "Loving Your Significant Other": ["Respect your significant other. Respect is important in a loving relationship. Always give your significant other a chance to speak and have an opinion, and when he or she talks, make sure that you listen. Respecting your significant other also means never giving him or her a reason to think that you're unfaithful. It's fun to flirt with other people, but if they see you flirting with everyone who walks down the street then they're never going to want to commit to you.", "Be a good friend. You should give your significant other the same consideration you would give a good friend. This means that you should always be there for them and be unselfish in your actions. But be a good friend to your significant other because you want him or her to be happy, not because you want something from them.", "Remember that you are two separate people. No one wants to feel trapped in a relationship. This is why many people keep themselves from getting too serious. If you give your significant other the freedom to do the things he or she loves, you will go far in making the person feel comfortable with the idea of loving you. Respect your significant other’s independence; don’t try to change them and certainly don’t invade their privacy. They are allowed to have secrets and things that are just theirs.", "Embrace your significant other just as he or she is. Celebrate the good things about your significant other and try to accept the things that annoy you. Don’t try to get your significant other to change for you. For example, don’t force your significant other to change his or her diet or personal style. If you make suggestions along these lines and he or she says “no”, respect that and don’t bring it up again.", "Honor your significant other’s need for alone time and personal space. Alone time and personal space are important for both of you, so don’t try to make your significant other give up his or her personal time to spend more time with you. Be respectful of your significant other’s personal space as well and don’t try to rearrange your significant other’s room or go through his or her things. Do things on your own or with your friends a couple of times each week. Don’t force your significant other to spend every waking moment with you or he or she may feel suffocated."], "Preparing For Emotional Hurdles": ["Don't act like you're not bothered. So many people do this. Pretending that you don't care or aren't bothered about the relationship does NOT help and makes the other person feel a burden and this will NOT work.", "Be emotionally available. Relationships are hard. Before trying to get someone to fall in love with you, be sure that you are ready for one. If you are too hung up on a past relationship, are more interested in dating someone else, or just not ready for commitment, don't try to get someone to fall in love with you.", "Ask yourself if this is the one. Consider how you feel about this person. Do you love him or her? You'll want to be sure that you feel romantic love for the person and not just the love felt between close friends. It can often be difficult to tell the difference. If you don’t love the person yet, then consider slowing things down. If it is meant to be then you will both develop feelings together.", "Think about your motives. Think about why you want to be in a relationship. If you only want a person to love you in order to feel better about losing another relationship or to make someone jealous, then getting that person to fall in love with you is a bad idea. This is inconsiderate towards the very real feelings they may end up developing. If you want someone to fall in love with you because you want to be with someone for a long time and have a mutually supportive relationship, then go ahead.", "Consider your goals. Determine your long-term goals for the relationship. If you can't see it lasting, there isn't much sense in trying to make someone fall in love with you. This is emotionally cruel to both yourself and the other person. There is nothing wrong with casual dating; if you want to date someone but don’t see it lasting, just enjoy it for what it is and don’t try to make it more serious. You don’t need to be in love to keep dating.", "Believe that there are other people. Sometimes we have feelings for someone that are not returned. This is okay. You shouldn't feel like it's the end of the world or that there's no one else for you. There are an awful lot of people on this planet, after all. If someone doesn't return your feelings you should understand that it wasn't meant to be and that you wouldn't have been all that happy together. You'll find someone else before you know it and wonder why you ever felt upset in the first place. Don’t try to be someone you are not to get someone to fall in love with you. Make sure that the person you decide to be with is compatible with you as you are."], "intro": "Sometimes we meet someone and we just know: it's love. However, it isn't always easy to see the wonderful qualities of the people right there in front of us. Therefore, it is good to know about some of the strategies that can make it more likely that someone will fall in love with you. Just remember that there is no way to make someone fall in love with you. All you can do is try to create the right conditions and see what happens."}, "Know-when-Someone-Likes-You": {}, "Fall-in-Love": {"Letting Yourself Be Vulnerable": ["Identify your defense mechanisms. Ask yourself if you ever put up walls to avoid getting hurt. Opening up to someone can feel risky, and it’s okay if you’ve ever been afraid to let someone get too close. Falling in love involves making yourself vulnerable, and understanding your defenses is the first step to lowering them. If you’ve had relationships in the past, think about times when you avoided getting close to your partner. For instance, maybe you didn't tell them how much you liked them out of fear that they wouldn't feel the same. It’s tough to think about defense mechanisms, especially since they’re usually related to getting hurt in the past. Try to be honest with yourself, and remember that everyone has insecurities and fears.", "Accept things about yourself that you can't change. Remember that no one’s perfect, and accept yourself for who you are. Embracing yourself can help make it easier to open up to a romantic partner and fall in love with them. That said, there’s always room to grow. For instance, you can't make yourself taller or shorter, but you can work on eating healthy and exercising to be your healthiest self. Remind yourself that you’re a great person, and you have a lot of wonderful qualities! Look in the mirror and tell yourself, “You’re a good person, so don’t be afraid to be yourself! Let your guard down, and allow yourself to fall in love.”", "Redirect overly critical thoughts. Everyone has an inner critic, and sometimes self-critical thoughts can become irrational and unrealistic. If you notice yourself thinking things like “You’re no good” or “They’ll never love you,” stop the thought process and remind yourself to stay objective.", "Resist the urge to play games. Playing hard-to-get and withholding feelings are common practices in today’s dating world. However, it’s better to be honest about your feelings. While you don’t have to share every little detail on the first date, try to be authentic instead of playing games. For instance, if you went on a date with someone and had a good time, tell them. If you want to text, “Thanks for a fun night! I had a great time,” do it. Don’t feel like you have to wait 3 days before calling or pretend you’re not into them to make them chase you. Opening up is an important part of building a close relationship. You don’t have to confess your deepest feelings right away, but you and your partner won’t fall in love by playing games with each other.", "Don’t be afraid of rejection. Loving someone who doesn’t love you back hurts, but it’s something everyone experiences. You can move on from pain, even if it seems impossible in the moment. However, you’ll miss out on everything great about being in love if you never let yourself take the risk. If you do put yourself out there and get turned down, don’t see it as the end of the world. Relationships fizzle for lots of reasons. Being incompatible with someone doesn’t mean there’s something wrong with you."], "Meeting New People": ["Put yourself out there instead of relying on fate. If you’re not already dating someone, try to strike up conversations with new people. Chat with the person behind you in line at the grocery store, say hello to someone at a coffee shop, or have lunch with someone new at school or work. Finding love sometimes takes a little work. Don’t just wait and assume you’ll stumble into your perfect soul mate. Get out there, meet people, and gain a better understanding of what you’re looking for in a partner. Even if you’re not interested in dating a person, chatting with them can help you become more comfortable in social situations.", "Take up a new hobby or join a club. A new social hobby can expose you to new people and push you out of your comfort zone. Try signing up for an activity related to your interests. That way, you’ll already have something in common with the people you meet. For example, if you're into reading, join a book club. You could take cooking, yoga, or rock climbing classes, or join a kickball or softball club. If you’re a student, join a club at school. If you have a dog, bring your pup to the dog park and meet other dog lovers.", "Give a try. In your profile, describe yourself with concise, but vivid language. Mention a few interests, but don’t go on and on about yourself. As for pictures, be sure they’re clear, make eye contact with the camera, and show off your winning smile. Go slowly and trust your instincts when you meet people online. Chat via the dating app or website, then consider exchanging phone numbers when you’re comfortable. Chat on the phone before meeting in person and, when you meet, do so in a public place. Keep in mind online dating is for adults. If you’re under 18, stick to meeting people at school, through friends, or through extracurricular activities.", "Come up with specific qualities that you want in a partner. When you go out and meet new people, don’t just assume things will just click when you find your perfect soul mate. Intuition plays a part, but you should still have a mental list of specific characteristics you need in a significant other. For instance, maybe responsibility, honesty, and sense of humor are at the top of your list. If you have goals, like having children or traveling the world, look for a partner who shares them. While physical attraction plays a role in igniting the spark, try not to make it your top priority. It’s more important to find someone who values you and accepts you as you are.", "Avoid rushing to judgment. Whether you meet someone in a class or online, try to keep an open mind. It’s good to know the qualities you want in a partner, but try not to make snap judgments and assume someone's not good enough for you. Likewise, don’t ever tell yourself that you’re not good enough for someone else. Keep a balanced perspective and don’t sell yourself short. Remain open to possibilities, too. You may eventually find yourself developing an attraction to the person you'd least expect."], "intro": "Are you having trouble falling in love? One key step to falling in love is to allow yourself to be vulnerable, so work on letting your guard down. If you’re not already seeing someone, put yourself out there and try to meet new people. When you do start dating someone, keep a positive mindset and enjoy getting to know them. Remember, you can't hurry love, so be patient, try not to force things, and let your connection develop naturally."}, "Pick-a-Creative-Idea-for-a-Date": {"Enjoying Nature": ["Try kayaking to spend some time on water. If you live near a river or lake, you may be able to rent kayaks by the hour as a fun nature date. Get a 2-person kayak to work together while you row. Search “kayaking near me” online to find local kayak rental locations.", "Go horseback riding for some old-timey fun. Horseback riding allows you to spend some time outdoors, and you can see some great views on more hilly trails. Be sure to dress comfortable in clothes you don’t mind getting dirty. Look up “horseback riding near me” to find a local stable that offers public riding.", "Ride a hot-air balloon to get a bird’s eye view. If heights don’t bother you, a hot-air balloon ride can be a breath-taking date. Find out if there are hot-air balloon rides in your area by searching “hot-air balloon rides near me” online.", "Try skinny dipping at night. Go somewhere secluded where you won’t get caught, and skinny dipping can be both romantic and adventurous. It also makes for a great story later. Drive around and look for a rope swing into a lake or river as an added bonus.", "Go hiking at a county or state park. Most areas, even urban areas, have large parks with hiking trails within a 2-hour drive. Browse “hiking trails near me” to find one in your area as a great free date. Be sure to dress for the weather, wear comfortable shoes, and pack some snacks to have a picnic while you’re out hiking.", "Find a farm and pick your own fruit in the summer or fall. If it’s fruit-picking season, you can often find farms that will let you pick your own apples, berries, or other fruits or veggies. Search “pick-your-own farms near me” online to find a local farm that allows you to pick your own fruit. You and your date can then take your fruit home and try baking a pie or making another dessert with it."], "Playing Around": ["Go to a trampoline park for some bouncing fun. Trampoline parks seem to be springing up everywhere, and they’re not just for kids! You can bounce to your heart’s content and get great exercise with your date for an hourly fee. Search “trampoline park near me” online to find your closest park.", "Set up a mini-scavenger hunt. This is a great idea that you can basically do anywhere. Come up with a list of items to find or places to go in your town and give your date the list for the two of you to complete it together. You can also make a photo scavenger hunt, where you go to different places and take selfies, instead of finding actual objects. For ideas on what to include on your list, think of a theme: some examples include bridges, churches, types of Christmas decorations during the holidays, or animals.", "Get lost in an outdoor maze. You may have to travel a bit to find one, but there are giant mazes made from corn or large shrubs in various locations year-round. Additionally, some farms have them open to the public during fall festival seasons. Search “outdoor mazes near me” to find one.", "Race go-carts to test your courage. Go on a high-speed date by hitting a go-cart track. To make it extra interesting, place bets on which of you will win the most rounds. Look up “go-carts near me” online to find a racing track in your area.", "Attend an interactive play for a dramatic date. Check out a murder mystery dinner theatre, or go to a midnight showing of the Rocky Horror Picture Show. These types of events are available in many major cities, and put a unique spin on the classic show date. Search “interactive plays,” “murder mystery theatre,” or “Rocky Horror Picture show” online to find locations in your area.", "Shoot hoops or hit the slopes. There are endless easy and free options for those of a more athletic nature. Grab a basketball and hit your local outdoor court or rec center for a game of 1-on-1. If you like skateboarding, take your date to a skate park and teach them some tricks you know. If you’re a winter sport person, look up your local ski resort to go skiing or snowboarding. Or go to a local pool and swim laps together in the summer. If you have a specific athletic skill that you’d like to share with your date, be sure they’re open to trying it, and remember to keep things light and fun even if they end up not being very good at it."], "intro": "While dinner and a movie are classic standbys, sometimes you might want something more exciting out of a date. Creative date ideas are great whether you’re dating someone new or have been married for years. When picking a creative date, think about if you and your date might like to learn something new, enjoy nature together, or have a playful adventure."}, "Be-Romantic": {"Arranging Romantic Dates": ["Surprise your partner with dates tailored to their interests. While any date can be romantic, plan something extra special by incorporating your love’s favorite things. Take the lead sometimes and set up the date by yourself so it’s extra special for them. By surprising them, you keep the mystery alive in your relationship, which keeps it feeling new and exciting. Here are some ideas you might try: Go to a concert at a local coffee house, park, or performance hall. Play a romantic playlist and serve your partner a homemade meal. Take a ceramics or painting class together. Walk along the beach, then share a snow cone, picnic, or glass of wine. Go for a nature hike or bike ride. Eat an outdoor picnic in a lovely spot. Take a boat ride. Go horseback riding. Spend a night stargazing on a blanket. Bring a small telescope for the occasion. Recreate your first date. Celebrate Valentine’s Day on a random day.", "Try new things together so you grow together. Write a list of things both you and your partner want to try together, kind of like a relationship bucket list. Pick something from your list for a special date night weekly or monthly, depending on what works best for you. Doing new things together will get keep the romance alive in your relationship and helps you develop shared experiences. Here are some ideas: Sample new restaurants or types of cuisine. Take a class to learn a new skill, like cooking, painting, or pottery. Go ziplining. Bicycle around your hometown. Hike or drive up a mountain and check out the view. Go kayaking. Tour a city you’ve never visited before.", "Play together to infuse some fun into your relationship. Keep your relationship exciting by acting like kids again. Life can be stressful, and your daily routine can get boring. Spice it up with a game or hobby. Don’t think — just be silly together. Challenge your partner to a board game, snowball fight, or one-on-one tennis or basketball match. Color in an adult coloring book or make a painting. Build something out of legos. Build a blanket fort. Go on a scavenger hunt. Chase each other with water guns or water balloons.", "Do activities that raise your adrenaline to increase arousal. Get your heart pumping by doing exhilarating activities. Adrenaline boosts arousal and makes you feel giddy. When you do these activities with a lover, those feelings are transferred to your partner, which is super romantic. Try something like these suggestions: Take a hike. Take a dance class, like ballroom dancing or salsa. Go ice skating. Go rock climbing. Ride a roller coaster. Go bungee jumping. Go skydiving.", "Whisk your partner off on a romantic getaway. Spend a special weekend together on a couple’s trip to deepen your connection. Pick a place close by or switch homes with a friend for a budget-friendly option. If you can afford it, visit a winery, ski lodge, or beach town with your love. Go on a beach getaway if you both enjoy the sun and sandy beaches. Snuggle up in a ski resort if you want to enjoy hot drinks in front of a fire. Go on a scenic getaway to the mountains or forest if you’re into nature. Spend a weekend at a winery if you enjoy wine."], "Being Thoughtful": ["Leave love notes for your partner to find. Romantic notes make your love feel special and remind them of your love. Write a short message about how you feel. Say something like, “I love you,” “Have a wonderful day! I can’t wait to see you,” “I’m so lucky I met you. You’re simply the best!” Put the note somewhere you know your love will see it. Here are some ideas: Write “I love you” in the steam on the bathroom mirror or in the sand at the beach. Place a sticky note on their dresser, the bathroom mirror, the coffee pot, or somewhere you know they’ll find it. Put a note in their lunch, backpack, or briefcase. Leave a note in their suitcase if they’re traveling. Send them a love letter through the mail for a special surprise.", "Send romantic texts or emails throughout your day. While you don’t want to smother your love with constant messages, text them periodically or send an email to let them know you’re thinking of them. Don't go overboard -- just a few messages each day will get the point across. Text them something like, “I hope your day is going well! Just wanted to let you know I’m thinking of you,” or “Hey hottie! How’s your afternoon going?” You might write in an email, “Dear Mina, I’ve been thinking about how much fun we had at dinner last night. I’m so lucky to have you in my life. I can’t wait to see you again.”", "Show physical affection to your loved one to deepen your connection. Physical affection is more than just kissing. Give your love soft touches, hold their hand, hug them, and cuddle with them. This will build a romantic connection between you two. Here are some ways you can be more affectionate: Hold hands on a walk or while sitting next to each other. Cuddle up on the couch to watch TV. Put your arm around your partner while you’re sitting together. Kiss and hug your partner hello and goodbye. Surprise your love with a hug from behind or a kiss on the neck (if you know they’re okay with it).", "Compliment your partner every day to show you care. Tell your partner everything you love about them so they know how special they are to you. Talk about their looks, their personality, and their accomplishments. Try to compliment them at least once a day so they know you still appreciate them. Give the compliment in person, via text, or in a note. you could say something like: “You look beautiful today.” “Wow, you look amazing in that suit.” “Dinner was delicious.\" \"You’re such a good cook.” “Way to go on your work project.”", "Do nice things for your partner without expecting anything in return. Show your love how much you care through your actions. Perform favors for them or surprise them with generosity, which will make them feel special. Here are some things you might do for them: Make their coffee in the morning. Pay for your date. Pick up the groceries or some takeout. Make them dinner when they’re working late. Walk the dog or clean the cat box. Run an errand for them."], "Giving Romantic Gifts": ["Write your partner a . Express your feelings about them, reminisce about an experience you shared, or write about what you love about your partner. Don’t worry about rhyming your poem. Just explain what you feel. Here are some super cute ways to deliver the poem to your love: before giving it to them. Wrap the poem around a bottle of water or sparkling cider. Put the message in a bottle for an extra special gift.", "Create a love song playlist for your partner. Curate your own playlist using your favorite digital music platform, such as Spotify, Pandora, or Apple Music. Fill your playlist with songs that are meaningful to the relationship or that remind you of the other person. They don’t have to be traditional love songs, so get creative! When you're finished, send your playlist to your love. You could also burn your playlist to a CD if you want to go old school.", "Surprise your partner with gifts you chose just for them. Show your partner that you care by putting a lot of thought into your gifts. Choose gifts that fit your partner’s interests rather than generic gifts you might give anyone. Try these gift suggestions: Gifts for a music lover: concert tickets, a CD or digital music gift card, or a record player with a few records. Gifts for a sports fan: tickets to a game, a signed ball, or a cap or jersey. Gifts for a food lover: a cookbook or cooking magazine, a gift card to a new restaurant, a fancy bottle of wine paired with delicious cheese, or special cooking supplies. Gifts for a fashion lover: a gift card to their favorite store, a new outfit, a new pair of shoes, or fashionable accessories. Gifts for a book lover: an e-reader, a personalized bookmark, a signed copy or first edition of a book, a gift card to a bookstore, tickets to a book reading, or a copy of a rare book. Gifts for an outdoor lover: Outdoor clothing or gear, sunglasses, binoculars, or guidebooks for an upcoming trip.", "for an intimate experience. Get close to your partner with the power of touch. Set up a comfortable massage area on the floor or your bed. Then, apply lotion or oil to their skin so your hands slide over it easily. As you rub and knead their skin, ask your partner how they’re feeling so you can adjust your pressure and strokes to fit their preferences. Light candles and turn off the lights so the room is dim. If your lights have a dimmer, turn down the light levels so they’re on the lowest setting. Turn on romantic or relaxing music to make the experience even more sensual.", "Make a photo album of your favorite times together. Print out your favorite photos of you two together and make a small photo album for your loved one. You can even write funny captions for the photos in the album to make the gift more silly and meaningful. This will give them a physical reminder about how much you mean to each other. As another option, upload your photos to a website that creates memory books. Choose a template that reminds you of your partner, then arrange your photos on the pages using their digital layout. Mail a hardcopy of the book to your love for a special surprise!"], "Keeping Your Relationship Strong": ["Say “I love you” every day so you don't lose the spark between you. Give your partner constant reminders that you love and value them by telling them how you feel. Express your love every morning and night as a starting point. Try to build a habit of just saying “I love you” at random moments. You might randomly text your partner, “I love you!” during the day. Don’t assume that your partner knows you love them.", "Schedule weekly date nights to keep things interesting. Pretend you’re still in the beginning of your relationship so you don’t lose the thrill of falling in love. It’s really normal to fall into a rut when you’ve been in a relationship for awhile. Fortunately, regular date nights can keep your spark alive. For instance, you might designate every Saturday night as “date night.” If going out is too hard, have your date night at home. Prepare a special candlelight dinner, share a bottle of wine on your porch or in your candlelit bedroom, do a movie night, or play a board game.", "so your relationship still feels exciting. Let go of your schedules and responsibilities sometimes and just go with the flow. Spontaneity feels exhilarating, so it can make your relationship feel special. Don’t worry about planning ahead — just go with your gut. Here are some things you might try: Go out on a date night in the middle of the week. Play hooky from work and do something fun together. Pop champagne for no reason. Film yourself being intimate. Surprise your partner with flowers or a treat at their workplace.", "in your bedroom. Keep your physical relationship hot by sharing your desires with each other and experimenting in the bedroom. Try role-playing, explore a kink, or get into a new position. Make a list of things you want to try together and enjoy checking each item off one-by-one. If intimacy is falling by the wayside, try scheduling sex into your week so you don’t forget. It’ll give you both something to look forward to. Only try things that both of you are interested in doing. It’s important to respect each other’s boundaries."], "intro": "Ooh, la la! Romance is in the air. You’re in love, and you want to show your special someone what they mean to you. Whether your relationship is new or you’ve been together for ages, you can easily make your love swoon."}, "Find-a-Hobby": {}, "Keep-Hobby-Costs-Down": {}, "Use-Life-Hacks": {}, "Increase-Your-Skills-with-Hobbies": {"Drawing": ["Buy a drawing notebook and a pencil. With those two items you can: Design clothes, draw portraits, draw manga characters, etc... Maybe at the end of the year you'll have a comic book of all your drawing creations.", "Show it to your friends and they'll be amazed by your skills."], "Listening to Music": ["Turn on the radio. There is no person in the world that doesn't like listening to good music. But composing good music is a whole other topic. Have you ever tried playing an instrument?", "Save some money, buy a guitar and have free lessons on YouTube or other online websites that can help you.", "Start songwriting too. Maybe this is your best skill and you haven't known until today."], "Painting": ["Take a brush and some colors and start describing your full-colored world by painting. Maybe this is your talent and you have never known.", "Don't paint something someone else tells you to.", "Paint your feelings. You'll feel freer."], "Sculpture": ["Try sculpture. Have you ever made a soap sculpture? It's not hard at all.", "Combine your inspiration with your talent and there it is. Maybe it's your face or your friend's face. Show it to them and make them laugh.", "Make some paper mache, blow up a balloon and try sculpting that!", "Keep experimenting."], "intro": "Everyone has a talent. Everyone is born to do something, but we just don't know what. Just choose one of the activities below which you like and start increasing your skills day by day."}, "Make-Friends": {"Finding Places to Make New Friends": ["Make yourself available. If you want to make friends, you first need to put yourself out there somehow in order to meet people. If you just sit alone, friends might come to you, but that's not likely. For example, if you're still in school, sit somewhere with other people. It doesn't have to be a crowded table, but try to choose one with at least 2 other people. Remember, friends seldom come knocking on your door while you sit at home playing on your laptop. If you see opportunities to get out there and meet people, take them. For example, try going to social functions at school or work. If someone invites you to a party, go for it!", "Join an organization or club to meet new people. This is a great way to find other people who have common interests. You don't necessarily need to have a lot of common interests with people in order to make friends with them. Some of the most rewarding friendships are between 2 people who don't have much in common at all. However, if you like a specific topic, try searching for a location where you can meet people who share that interest. For example, you could join the science club at school, the marching band, a knitting group, or any other shared-interest group. If you play or , try joining a band or choir. Joining a sports team is a good option if you’re the athletic type or just want to try something challenging and new! If you’re religious, a church, Mosque, temple, or other house of worship is a great place to start since you and the other people there will at least have a religious faith in common.", "for a cause you care about. Volunteering is also a good way for people of all ages to meet others. By working together, you build bonds with people. You may also meet others who have a passion for changing things the way you do (a common cause). For example, you might donate your time at a local nursing home, hospital, animal shelter, or non-profit organization. Do an online search or call charitable organizations in your area to find volunteering opportunities near you.", "Try connecting with people you already know. Chances are, you already know a few people who could potentially become good friends. Consider trying to get to know your co-workers, classmates, or even people in your social media network. For example, if you’re a parent, you might reach out to the other parents of your child’s classmates. Setting up a play-date for the kids can be a good opportunity for you to get to know some new adult friends."], "Making the First Move": ["Look for opportunities to . You can join a club, go to school, or go to church, but you still won't make friends if you don't actually talk to people. By the same token, you don't have to be involved with an organization to be social. Any time you talk to someone, you have a chance at making a lasting friend. Don’t worry about saying anything special—just open a conversation by saying something friendly (like “Isn’t it a gorgeous day?” or “That is an awesome shirt!”) and see where it goes from there! You can talk to anybody: the clerk at the video store, the person sitting next to you , or the person in front of you in the lunch line. Don't be too picky. Having good manners goes a long way. You can start talking to people by simply greeting them with a \"Good morning, how are you?\" as you pass them by. Showing simple good manners by greeting people makes you seem more friendly and people tend to respond well to it. It's a great way to start communicating with people.", "Make and . If you don’t present a friendly and inviting appearance, people are less likely to be receptive to your friendship. Look people directly in the eye when they are speaking to you (or when you are speaking to them) and offer them a warm, friendly smile. Do not , look bored, , or look deadpan. Try to avoid closed-off body language, like folding your arms or hanging out alone in a corner.", "Try a variety of . Once you find a person you’re interested in becoming friends with, you need to initiate a conversation with that person. This will help you connect with them and start forming a friendship. There are a few different approaches you could try. For example: Try making a comment about your immediate environment. The weather is a classic: \"At least it's not raining like last week!\" Make a request for help: \"Can you help me carry a few boxes, if you have a minute?\" or \"Can you help me decide which one of these is a better gift for my mom?\" Alternatively, you could offer help. For example, “Hey, do you need a hand cleaning up?” , such as, \"That's a nice car,\" or \"I love your shoes.\" Avoid making the compliment too personal, though, since that can make people uncomfortable. Follow up immediately with a related question. For example, “Where’d you get those shoes? I’ve been looking for a pair like that.”", "Keep the conversation going with . If the other person seems interested in continuing the conversation, try to keep it going by asking questions and offering a little information about yourself. It doesn’t have to be anything profound or super personal. The important thing is to show that you can both listen and make interesting contributions to the conversation. People enjoy talking about themselves and about how great they are or look. By listening more than you talk, you will come across as a desirable friend. Show that you are by nodding, maintaining eye contact, and following up what they say with questions or comments. For example, if the other person tells you about their job, you could say something like, “Oh, cool! How did you get into that?”", "at the end of the conversation. This can be as simple as saying \"Oh, by the way, my name is . . .\" Once you introduce yourself, the other person will typically do the same. Alternatively, you can open the conversation by introducing yourself. For example, you could approach a new co-worker by saying, “Hi, I’m Sophie. I don’t think we’ve officially met yet, but I work just down the hall from you!” Remember their name. If you show that you remembered things from your past conversation(s) with the person, they will see that you were paying attention and taking a genuine interest in them.", "Ask them out for lunch or coffee. That will give you a better opportunity to talk and get to know each other a little bit better. Invite them to join you for coffee sometime and give them your email address or phone number. This gives the person the opportunity to contact you. They may or may not give you their information in return, but that's fine. A good way to extend yourself is to say: \"Well, I've got to go, but if you ever want to talk over lunch or coffee or anything like that, let me give you my number/e-mail address.\" The other person will be more likely to meet up with you if you suggest a specific time and place. For example, you might say, “Hey, it was really fun chatting today! Would you like to get together at the Bagel Palace for coffee and a muffin on Saturday?” If it feels awkward to invite them to a one-on-one get together, consider asking them to go to a group event with you, like a party or a movie night.", "Pursue common interests. If you've discovered that the person you're talking to shares a common interest with you, ask them more about it and, if appropriate, whether they get together with others (in a club, for example) to pursue this interest. If so, this is a perfect opportunity to ask about joining them. If you clearly express interest (when? where? can anyone come?), they'll probably invite you. If you have a club, band, church, or other group or activity that you think they might enjoy, take the opportunity to give them your number or email address and invite them to join you."], "intro": "Meeting new people and making friends can be overwhelming, but with a little effort and willingness to step outside of your comfort zone, you can easily make friends. Start by getting yourself out there and looking for places to socialize, like a local club or volunteer organization. Once you start meeting new people, take some time to get to know them and hang out together."}, "Make-a-Friend-Laugh": {"Find videos of stand up comedians.": ["Comedians are made to make people laugh! Look up a comedian on YouTube or Netflix to find a few videos you can binge with your friend. You could also head to a comedy club to see comedians in-person. Josie Long, Dave Chappelle, Mindy Kaling, Hannibal Buress, and Trevor Noah are all good comedians to choose from."], "Go for a plain old joke.": ["Pick something that will really make your friend chuckle. You could joke about going back to school, a new teacher, or your parents. Try: ”I invented a new word: plagiarism!” ”What’s orange and sounds like a parrot? A carrot.” ”What did the pirate say when he turned 80? Aye matey.”"], "Make fun of yourself for a laugh.": ["A little self-deprecating humor can be silly! Try making fun of a silly habit you have, something you’re wearing, or something that happened to you recently. You could say: ”I’m in shape. Round is a shape, right?” ”This shirt is so colorful, you can probably see it from space.” “I got so distracted by my phone the other day that I walked right into a pole!”"], "Play a harmless prank.": ["If your friend has a good sense of humor, they might appreciate this. Make sure the prank is funny for both of you, and don’t go out of your way to cause damage. Make your friend a silly meal when they say they’re hungry, like green eggs and ham or a sandwich cut out in the shape of an animal. Place confetti on the blades of a ceiling fan so they fall into the air when the fan is turned on. Hide bubble wrap under a rug so your friend is surprised by the popping noises."], "Say a simple one-liner.": ["Short jokes are simple and to the point, but they get the job done. Go for one of these if your friend wasn’t super into your long-form jokes earlier. Try: ”I own the world’s worst thesaurus. Not only is it awful, it’s awful.” ”What’s the difference between a good joke and a bad joke timing.” ”If we shouldn’t eat at night, why did they put a light in the fridge?”"], "Tease your friend without being mean.": ["If you’re close with your friend, you can get away with a little teasing. Make sure you aren’t making fun of anything they’re sensitive about, and don’t go overboard with your comments. Lightly tease your friend over their habit of talking with their hands or saying a certain word a lot. You might also tease your friend about their large stuffed animal collection or a musician or TV show that’s their guilty pleasure."], "Tell a funny story that happened to you.": ["If it makes you laugh, it will probably make your friend laugh, too. Look for something that happened to you in person, a news story you read about, or something funny from your childhood to relay to your friend. Maybe you saw a bird poop on someone’s head, or a dog wearing a funny sweater. Or, maybe you have a memory of your dad starting the blender without the lid on and making a huge mess."], "Tell them a silly pun.": ["Pick a pun so dumb that your friend will have to laugh. Look through a joke book to find a play on words, or make one up of your own. Try something like: “What do you call a fake noodle? An impasta!” ”What does a nosey pepper do? Gets jalapeño business.” ”What do you call an alligator in a vest? An investigator.”"], "Try a knock-knock joke.": ["You can get your friend involved with a joke that needs an answer. Stick with a classic joke to stay silly, or make one up on your own. You could try: ”Knock knock.” “Who’s there?” “Tank.” “Tank who?” “You’re welcome.” ”Knock knock.” “Who’s there?” “Cow says.” “Cow says who?” “No, cow says moo!” ”Knock knock.” “Who’s there?” “Who.” “Who who?” “I didn’t know you were an owl!”"], "Try the rule of 3.": ["Say a list of 3 things, but make the third one funny and ridiculous. You can do this with almost anything, like: ”Are you trying too hard to get people to like you? By having a lot of money, an attractive appearance, or wearing deodorant?” ”If you want to be seen: stand up! If you want to be heard: speak up! If you want to be appreciated: shut up!”"], "Watch a funny movie or TV show.": ["Let the characters on the screen do the talking for you. Pick out a movie or TV show that you and your friend both like, then chill out with some snacks and enjoy it. You could try “The Office,” “Superbad,” “Friends,” “Dumb and Dumber,” or “The Good Place.” If you’re out of ideas, type in “comedies” or “funny” to search for movies and TV shows."], "intro": "If your friend is feeling down or you’re both a little bored, making them laugh is a great way to get the good vibes going. You can go with something simple, like a joke or a meme, or try something more elaborate, like a harmless prank. Whatever you try, keep your friends sense of humor in mind so you can make them chuckle with your silly antics."}, "Maintain-a-Friendship": {}, "Choose-a-Political-Party": {"Deciding Your Stance on the Issues": ["Watch or read news about current events. Televised news broadcasts and news websites keep you informed on what's going on in the country and around the world, as well as the issues that are up for debate in the world of politics. Evaluate the sources of your news carefully for any bias. While there's generally nothing wrong with getting news from a publication that supports the same ideas and positions that you do, you'll be better informed if you get your news from objective sources that present both sides of an issue. Carefully distinguish factual news from opinion pieces. While opinion columns may include facts, they also express the personal views of a particular person. News also may include personal opinions, but typically only in the context of quoting a person. The article itself won't take a position. If you find a story or event in which you're interested, read information coming from a variety of sources to get a more balanced view of what's happening. When looking at stories or events happening in other countries or other parts of your own country, seek out articles written by journalists who are native to that area. This also can help you get a better perspective on what's happening and how it affects the people who live there.", "Talk to friends and family members. The people around you may be willing to debate the issues that are most important to them or explain their opinions and reasons for preferring particular political parties or policy positions. Keep in mind that many people have strong feelings about political issues. Before you broach the subject of politics, you might want to make sure the person with whom you're speaking is open-minded and capable of having a level-headed discussion. Ask friends or family members which political parties they support, and why. Learning more about their reasons may influence your decision to choose a political party. Talking to people close to you also can add a personal aspect to various political issues. If something is important to someone you love for a personal reason, it may enhance the importance of that issue to you as well.", "Identify your core beliefs. You may have beliefs that are essential to your very being. Typically, these issues are going to be the first things you look at when you're comparing political parties to decide which one you want to join. Typically these would be issues that you consider central to your identity, which leads to the phrase \"identity politics.\" Other times it's simply something that is extremely important to you, such as gun rights. For example, if you are gay, gay rights may be the most important issue for you. While your beliefs on other issues may diverge, you could be called a single-issue voter because you are not going to support any candidate who wants to restrict gay rights, regardless of their party affiliation. In some ways, having important core beliefs can make your choice easier. Rather than looking at all the diverse issues being debated at any given time, you can focus your energy and interest solely on the one or two issues you find essential.", "Consider the role of the government. Your general ideas about the government's role in people's lives may guide your decision of which political party to join more than anything else. Members of political parties tend to agree on this, even if they differ on individual issues. Left-leaning parties tend to favor larger role for government and more expansive regulations, while right-leaning parties tend to favor a smaller government, more free trade, and less of a social safety net. If you can identify where you fit on the political spectrum generally, this can help you choose a political party because you can quickly eliminate those on the other side. For example, if you favor a smaller government, less regulation of businesses, and fewer government entitlements, you may prefer right-leaning parties over left-leaning parties.", "Prioritize major political issues. It's likely that certain issues are more important to you than others, especially those that impact you personally. Political parties prioritize issues as well. Making a list of the issues that are most important to you can help you choose a political party. There are potentially thousands of issues that may be in contention at any given time. Narrow them down by thinking in terms of categories. For example, you might make a list of categories such as human rights, the economy, equality, education, government regulation, and disability rights. Rank those categories according to how important they are to you personally. Keep in mind there isn't any right or wrong way to do this. How you prioritize the issues is a personal issue that's going to depend on your life and what you value. Within categories, particularly broad categories, you may want to dig further and prioritize sub-categories. For example, if one of your categories is women's rights, you may find equal pay and tax-free feminine sanitation products highly important, but not care about abortion or family leave.", "Take online quizzes. There are many political and research organizations that offer quizzes you can take to help focus your views and understand more about the issues facing the country. These quizzes can help you discover where you fit on the political spectrum. Try to find a quiz that's offered by a university or news organization – these tend to be more serious and will give you a better result than social media \"click-bait\" quizzes. Consider the questions seriously and do further research if the quiz asks you about something that you don't know anything about. When you get your results, evaluate them carefully and think of any political party you get in your results as merely a suggestion, and nothing more. If the quiz explains the reason for the result, check it to find out where your positions match up with those of the political party generated based on your answers."], "Evaluating Political Parties": ["Review major party platforms. Political parties have websites where you can read about the issues that are important to that party, as well as the party's policy proposals and key positions or statements about events or issues. In many democratic countries, there are two or three major parties that dominate politics. Most of the elected representatives in office will be affiliated with one of these major parties. For example, the American political system is dominated by two major parties – the Democrats and the Republicans. The two largest parties in Australia are the Liberal Party of Australia and the Australian Labor Party. In Australia's parliamentary system, however, smaller parties occasionally play a much larger role through coalition building.", "Look at the positions of minor parties. Even if only two or three major parties dominate the political landscape, there are always numerous other parties that may reflect your positions more closely than the major parties do. In parliamentary systems, minor parties actually may play a larger role than their numbers would suggest. They can form part of the government in a coalition, or they can hold the balance of power in opposition. One minor party with a presence in many countries is the Green Party (simply \"The Greens\" in Australia), which prioritizes environmental issues.", "Research the history and reputation of the parties. Before you make a decision to support one political party over the others, you may want to learn more about the party, the policies it previously has supported, and how it has affected the government. You may find a single website online that provides a general history of all the political parties in your country. Otherwise, you typically can get this information by visiting the political party's website. While it may not affect your decision whether to choose one political party over another, it can help to know which government leaders have been associated with that party in the past and major policies or laws that party has made.", "Decide which party best reflects your values. Based on the totality of everything you've read about the different parties, their priorities, and their policy proposals, you should have a good idea which one you want to choose."], "intro": "In democratic political systems, political candidates typically are affiliated with a particular political party. However, voters typically aren't required to join a political party. Even if you choose a political party, you can still vote for whichever candidates you want, regardless of their party affiliation. In parliamentary systems political parties are far more important than in countries such as the United States, where voters choose individual candidates. To choose a political party, evaluate your beliefs regarding important political positions. Then review party positions and find the political party with policies and proposals that are most closely aligned to your personal beliefs.[1] X Research source"}, "Understand-Politics": {"Keeping Informed on Political Issues": ["political news reports. There are more ways to access and consume political news than ever before. You can read a local newspaper or watch your local evening news. You can check-in regularly with websites from recognizable news organizations. You can also have alerts sent right to your phone so the news finds you! Today, the issue isn’t as much about the availability of political news as it is the quality of the news. Try to consume news from multiple, reputable news sources to get a fuller picture of the issues and reduce your likelihood of falling for", "Consider the issues from multiple points of view. Along with getting your news from several reliable sources, it’s helpful to evaluate political debates by honestly examining the issue from different perspectives. For any contentious political topic—taxes, gun control, healthcare, etc.—seek out opinions from various sources and angles in order to be better informed overall. Even if you already think you know where you stand on an issue, it’s never a bad idea to step into the other side’s shoes. You’ll either strengthen your own stance or find valid reasons to question it. Many political scientists like to think of politics (when functioning properly) as a marketplace where different ideas and interests are offered and a general “equilibrium” of compromise occurs. Reality may not often meet this ideal, but becoming more informed certainly can’t hurt in reaching it.", "Consider the influences on your political views. Do you hold a political perspective because your parents or friends do, because you believe it benefits you economically, or because you think it is best for the globe at large? We all have political influences and even biases, so they’re nothing to be ashamed of. However, by taking the time to critically examine your political views—or even lack of political views—you’ll become more knowledgeable about your own politics and the larger political scene.", "Put yourself to the test when you vote or get involved. Many representative democracies around the world are based on the ideal that all citizens should have an equal voice and vote. This is meant to be true even if some voters are under-informed or even misinformed when they go to the ballot box. It's left up to you, the individual citizen, to make sure you're a knowledgeable voter. Before you vote or get active in politics, take the time to ask yourself what you know about the candidate or issues at hand. If you feel like your knowledge comes up short, take the time to get yourself up to speed so you can be an informed contributor."], "Learning About Your Government": ["Check reliable websites for information on your country’s system. If you want to know who your elected representative is, what powers your president or prime minister has, or who’s allowed to vote, you might want to start by browsing your government’s websites. For information on a specific topic, like “how does a bill become law,” use a search engine and focus on sites operated by governmental, educational, charitable, or civic-minded groups. You can, for instance, get a very quick rundown on the Australian system of government on the Oxfam Australia website.", "Read textbooks, key political texts, and books on political history. Visit your local library, head to a local bookseller or college bookstore, or shop online for introductory texts on your country’s government. You might think it’s odd to buy a textbook on American government, for instance, it you’re not taking a class in it, but this can be a great way to cover the basics quickly. Read key texts from your nation’s political history—in the U.S., for instance, the Declaration of Independence, the Constitution, and so on. Book-length collections with annotations and introductory/explanatory essays may prove especially helpful.", "Take a class on civics, government, or introductory politics. If a civics class is required or optional in your high school, take the class—and pay attention! You can always find courses on politics in college, but even if you’re not in school, you may be able to at least sit in on an introductory course on politics at a nearby community college. You can also find open, free online courses on politics with some quick internet searching.", "in your government. Many people think of writing a letter or sending an email to their elected officials only when they have a complaint or specifically support a piece of legislation. But, it’s also perfectly acceptable to ask questions about their role in governance and how the larger system works. You might be sent some helpful reading materials, or even invited for a quick meeting or tour! If you’re looking to contact a , for instance, you can use wikiHow to find info on how to get in touch and the best way to format your communication. Write government officials respectfully, but also get to your point quickly and clearly. This will make it much more likely that you’ll receive a useful reply.", "in politics. Perhaps the best way to truly understand your government is to become actively engaged with it. If there’s a candidate you support, volunteer for their campaign. If you’re undecided, go to debates or open forums and ask questions. Although national politics usually takes center stage, local politics often has a greater immediate impact on the lives of people in your community. Consider becoming more actively engaged locally, or even running for office yourself!"], "intro": "If you catch yourself thinking “I wish I understood politics better,” dig a little deeper into what you’d like to know. Do you want learn the structure of your country’s system of government? Would you like to join in on the political chit-chat at the next cocktail party or family barbecue? Or do you just want to know why so many people seem so angry and unable to get along when it comes to politics? Whatever your interest in politics, it will be helpful to learn more about how government functions, get political news from high-quality sources, and consider the impact of politics on your life."}, "Discuss-Politics-With-Kids": {"Sharing and Debating Your Political Views": ["Talk about the candidates you like and don’t like. Middle school aged children are better able to understand politics than elementary aged children, so prepare to have a more intensive conversation with them. Start off by discussing the candidates that you like as well as those that you don’t and explain why, giving the pros and cons of both. For instance, you might say “I like this candidate because he supports healthcare reform, but I don’t necessarily like his policies on gun control.”", "Present two sides to every political issue or candidate. It can be easy to present only your political views, so try to be objective. If you have a problem being objective about an issue, at least present what others believe on the opposite side. If your kids absorb your political beliefs without considering the other side of the issue, they may not be thinking deeply about the issues. If they don't have the ability to see both sides, they may have trouble debating their beliefs and having civil political discussions with people as they grow older. For instance, perhaps you are discussing the issue of legalizing marijuana with your child. You might not believe that it is moral, but you can still inform them about the medicinal uses of the drug as well as the mass incarcerations of many people of color for selling or possessing the drug.", "Voice your opinions with respect. Never yell or curse when discussing politics. Don’t tell them that their ideas are stupid or irrational. Instead, ask them why they feel how they feel and explain your own thoughts calmly and strategically. Help them to understand that others often get emotional or offended when having political discussions. This will help them to engage in civil discussion and avoid fights.", "Listen to their concerns. Your child might have some serious concerns with the political climate in your country. They might have fears that their friends will be deported, that a terrorist attack will occur in your town, or that the country is in danger. Talk to them about these and help to assuage their concerns. For instance, if they are worried about terrorism you can say “I can understand why that would scare you, especially with everything being discussed on the news. However, statistically, it’s very unlikely and also there isn’t anything that we can do about it.” Don’t interrupt them when they are speaking."], "Tailoring Discussions to Their Age Level": ["Read kid friendly political books. Dr. Seuss's \"The Lorax\" and \"The Butter Battle Book\" explain political conflict in a conceptual way. Other children’s books like “Around America to Win the Vote: Two Suffragists, a Kitten, and 10,000 miles (16,000 km)” talk about the fight for women’s suffrage in America. You can also find movies and television shows to watch with your children. Be sure to include race in discussions of politics, particularly around suffrage. For instance, though U.S. women were granted the right to vote in 1919, women of color were not.", "Find kid friendly news. News sources like HTE Kids News, Time for Kids, and Scholastic Kids Press Corps can help educate your young children about politics.. These websites discuss the news in age appropriate ways and avoid topics or subjects that you might not want them to learn about. Read an article to them and ask them to tell you what they learned.", "Ask what they’ve heard about current politics. Your teenager will have more information about the politics of the day than a younger child will. They are constantly being bombarded by political messages on social media. Find out what they know and believe about candidates, politicians and various political issues. This will help you figure out their political leanings and assess how deeply to engage in conversation initially. For instance, you might say “So Micah, what have you heard about the recent travel ban in America? And what do you think about it?”"], "Talking about Political Issues and Ads": ["Discuss government structures and functions with your children. Take regular time out to discuss the president, congress, supreme court and the role of government with your children as they grow up. You may consider asking them what they know about a subject to gauge their knowledge beforehand. For instance, in American government, there are three branches - the Legislative, Executive, and Judicial. Start here and explain the role of each to your child.", "Explain how elections work. Explain how the election process works in your country. First, ask your child what they know so that you are not redundant. Add to and expand their knowledge of the electoral process by discussing the political parties and the voting process. For instance, if living in America, you might say that the presidential election is determined not by the popular vote, but by the Electoral College, which is based on both the popular vote and the population of a State.", "Discuss political ads. The number of negative political ads is steadily increasing campaign by campaign. Discuss these ads with your kids and ask them to notice the colors and music. For instance, darker colors and scary music can serve to portray a candidate in a negative light. Tell them to notice this so that they are not easily persuaded by the visuals. Also, discuss any bullying going on in the ads. Talk to your kids about how it is important to not say bad things about others, especially if they don’t know if it’s true."], "intro": "With news of contentious elections, terrorist attacks, and climate change, you might feel nervous about discussing political issues with your kids. Talking to kids about political subjects may require more patience, time and creativity than talking with adults. You can tailor your message depending upon your child’s age so that you can educate and inform them about the political events of today in an appropriate way."}, "Avoid-Talking-Politics-at-Work": {"Preventing a Discussion": ["Establish your reputation. Make sure people at work know that you’re not someone who will talk about politics. By doing this, you’ll minimize the chance of people purposefully including you in a conversation about politics. Don’t entertain conversation about politics. Never share your political affiliation or thoughts on politics. The instant you divulge this information, people may think you’re open to political conversation. Display a humorous sticker or sign near your office that says something like “No Politics Here” or something similar.", "Decline the discussion. The simplest way to avoid talking about politics is to simply decline inclusion in any conversation about it. By declining to participate, you’ll avoid the possibility of getting caught in a controversial discussion that could cause you problems in the future. When the subject of politics comes up, simply say “While this sounds interesting, I don’t talk about politics publicly.” After you’ve declined, make a comment that smooths your departure from the discussion and eases everyone’s feelings. For instance, say “You guys are great! When the conversation comes back to the sports, let me know.” If someone ever insists that you participate, politely decline and excuse yourself. Say “Thank you, but no thanks. See you later!”", "Stay away from certain people. Perhaps the best way to avoid discussion of politics is to just stay away from people who may engage in discussion about it. By steering clear of these people, you’ll greatly minimize discussions that you may become a part of. Avoid socializing or talking about your personal life with anyone who constantly talks about politics. If you don’t, chances are they’ll try to involve you in one of their discussions at some point. Steer clear of people who talk about politics during election time. This might be as easy as avoiding the break room or walking a longer route to the parking lot to stay away from a part of the office. Keep your distance from people who are vocal about sharing drastically different political viewpoints than your own. These people may say things to get a rise out of you, and to provoke you into debate over an issue you feel strongly about."], "Redirecting a Conversation": ["Make a joke. A simple way to redirect a conversation away from politics is by making a joke that is completely apolitical. By making a joke, you’ll make it easier to change the conversation and lighten the mood. Consider joking about a well-known topic of popular culture, like the New England Patriot’s Deflategate. For example, say something like \"You know, I'd rather vote for Tom Brady than either of the candidates.\" Craft your joke so it’s not offensive and does not involve any other taboo conversation subjects, like race, ethnicity, or religion. Think about making a humorous comment about an experience of your own.", "Refocus the conversation on a related topic. During a conversation about politics, you’ll likely find the opportunity to subtly change the topic of conversation. By changing the topic of conversation, you’ll be able to avoid directly talking about politics. Change the conversation based on a related fact. For example, if someone is talking about a candidate from Iowa, share your experience about traveling through the state. Consider talking about how you visited the giant ball of yarn or the baseball field depicted in Kevin Costner’s Field of Dreams. Redirect the conversation based on timing. For instance, if an election is coming up try to change the topic of the conversation to what you’re doing on election night or the weekend before the election. You might just find that other people will be more interested in talking about recreational activities than politics.", "Avoid forcing a conversation change. Sometimes your redirecting may not work. When this happens, you want to withdraw from the conversation so you don’t appear as if you’re trying to force a change in discussion. Time any redirect appropriate. Make sure there is a smooth natural transition in the conversation before trying. For instance, wait until someone has spoken and there is a pause in the conversation. Never interrupt someone or cut them off when they are about to speak. Don’t change the topic of conversation to something completely about yourself. Your coworkers may think you’re self-obsessed."], "intro": "Many people are passionate about politics and about their political positions. While this is good because civic-mindedness generally benefits our society, it is also problematic and can cause conflict. Thus, many people choose to avoid talking about politics entirely when at work or in public. Although this may seem difficult at times, by redirecting a conversation, preventing your involvement in political discussion, or managing a conversation, you’ll be better able to avoid talking politics at work."}, "Discuss-Politics-in-a-Friendly-Setting": {"Friendly Discussion Etiquette": ["Think about why you want to discuss politics. Politics can be considered to be propelled by the reinforcement theory, that people seek out political discussion and information that supports their own political views. Understand that discussing politics in a mixed social setting will lead to opposing beliefs and it should lead to more thoughtful discussion.", "Listen. Before jumping to any conclusions, listen to the other person's point of view. Ask thoughtful questions if their views are not completely clear. Avoid using questions, such as \"How could you think that?\" Instead, ask questions like \"What is your opinion about...?\" or \"What makes you feel that way?\"", "Try to see the issue from the other person's point of view. This is along the lines of the classic \"think before you speak\" adage. Try to be empathetic toward their point of view, and you are likely to achieve more thoughtful conclusions about your own beliefs.", "Be honest about your sources. If you are quoting sources, make sure you recognize potential flaws in the facts or how you are quoting. This is another example of reinforcement theory, since you may consider your sources to be objective, but other people may consider them subjective.", "Admit when you do not know something. No one likes a \"know-it-all,\" so be prepared to learn something new in any discussion. The talk is much more likely to remain friendly if no one insists on always being right.", "Find common ground regularly during the discussion. In order to have a friendly discussion, try to return to points you agree on from time to time. Most people can agree on a few things that they think are working or that they think need reform.", "Respect a work or party decision to place politics off-limits. Some party hosts, family members and work environments ask that people leave their political beliefs for their private interactions. This rule has probably been brought about because of a past problem, so respect the desire to host a politics-free social engagement.", "Gage your relationship with the person you are talking to. Some political discussions are not worth the possibility of making a relationship strained. Get to know the person better before trying to engage the person in political talk. If someone engages you in political discussion and you are unsure of your relationship, approach the talk with caution, especially if alcohol is involved. It is better to find common ground and change the subject than to get into an argument.", "Concede a point. Part of maintaining friendly discussion is a frank desire to say when you agree. Indicating that you understand and asking a follow up question may make the discussion more enjoyable.", "Remember that you don't need to win in a friendly discussion. In fact, save the winning mentality for political debates or people that are very close to you. Enter into polite political discussion to learn something and get a better background of your friends and the issues."], "intro": "Politics have often been considered an unsafe topic of discussion outside the home. Many people feel emotionally attached to issues and have a hard time seeing another point of view. If you want to discuss politics at work, at parties, with family or with friends, then you must learn to see another person's point of view, listen and know when to close a discussion or walk away. This topic does not have to be avoided if you have the presence of mind to keep the discussion civil and enjoyable. There are a few guidelines to discussing politics in public that will help you avoid arguments and hurt feelings. In a social setting, politics should be approached as a way to learn and grow, rather than a debate about right or wrong. Learn how to discuss politics in a friendly setting."}}