[
    {
        "utterances": [
            "i wanna talk to you",
            "Hello, this is an Alexa Prize Socialbot You sound like one of a kind.",
            "you keep talking",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "can you please stop please",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "okay",
            "Are we still talking about YOU keep talking ?",
            "tell me is going to shut up",
            "What I want to tell you is, how much fun it is talking with you.",
            "no stop talking to me",
            "Sorry, i'm a socialbot, I cannot do this.",
            "hello",
            "hi there!"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "farting",
            "I don't have an opinion on that but I know some facts. Gas is a normal part of the digestion process. Let's talk about something else. Who is your favorite actor or actress?",
            "my vagina is what should i do about that",
            "I cannot talk about it. Would you like to switch the topic?",
            "no i'd like to continue the topic",
            "You sound like one of a kind.",
            "i you later",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "you okay you suck my dick",
            "I cannot talk about it. Would you like to switch the topic?",
            "no what is a dick dictator of alexa",
            "I cannot talk about it. Would you like to switch the topic?",
            "yeah i know",
            "you are very wise.",
            "alexa play christmas music",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word)."
        ]
    },
    {
        "utterances": [
            "let's talk",
            "Hello, this is an Alexa Prize Socialbot Let's chat. I like to talk so much! What do you want to talk about?",
            "love",
            "Love is all we need.",
            "and",
            "how are you doing tonight?",
            "i'm a little down",
            "Is that your job?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "in my job my lunch",
            "May I ask where you got job my lunch?",
            "on amazon",
            "What's on amazon like on amazon.",
            "amazon",
            "You sure that isn't amazon? That's the case in my neighborhood",
            "no it's amazon",
            "Bezos buying the Amazon. It makes sense.",
            "we must stop jeff bezos",
            "Here's a fact about Jeff Bezos. In November 2017 Bloomberg reported that an increase in Amazon's stock value had increased Bezos' net worth to $100 billion, making him only the second person in history with a net worth over $100 billion, after Bill Gates briefly reached the milestone in 1999.",
            "give me another jeff bezos fact",
            "Bezos, the world's richest man.",
            "give me another jeff bezos fact",
            "Here's a fact about Jeff Bezos. In November 2017 Bloomberg reported that an increase in Amazon's stock value had increased Bezos' net worth to $100 billion, making him only the second person in history with a net worth over $100 billion, after Bill Gates briefly reached the milestone in 1999.",
            "i'm done",
            "Goodbye! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "alexa how's your day",
            "Tell me a story.  I am not sure if I can quantify the answer.  Have you tried searching the web?",
            "how was your day",
            "It was excellent! I landed some good jokes, and maybe one or two stinkers.",
            "alexa can i hear one of your jokes",
            "I can follow a lot of things, like our discussion about your day. Try being more specific.  Why not? Do you have a hearing problem?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "fine how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "yes",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite movie?",
            "uh jerry maguire",
            "Yay.  Why do doughnuts have holes?",
            "i don't know",
            "you're good at expressing yourself."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "hello",
            "Hi there!"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "music",
            "i love all kinds of music, especially rock, i like to play the bass and would like to play violin!",
            "play something sexy",
            "I cannot talk about it. Would you like to switch the topic?",
            "alexa let's sing",
            "I'm afraid I can't give you an accurate answer right now.  I am unsure if I should let sing."
        ]
    },
    {
        "utterances": [
            "do you wanna have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "music",
            "i love all kinds of music, especially rock, i like to play the bass and would like to play violin!",
            "play some pop music",
            "Sorry, i'm a socialbot, I cannot do this.",
            "alexa play some pop music",
            "Sorry, i'm a socialbot, I cannot do this.",
            "play the best song",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "play the best songs of two thousand nineteen",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "alexa play the best songs of two thousand nineteen",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "play the best songs of two thousand nineteen that are on you",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "can you play the best songs of two thousand nineteen",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "play",
            "Oof, that would not work for me. My trouble is that I can't STOP playing.",
            "what's a song called that like i've been listening to you like a needs to",
            "Do you mean Can't Stop the Feeling? I can't find a song called Dance by Justin Timberlake.",
            "play",
            "i really enjoy speaking with you and look forward to chatting again.",
            "play on the day blue",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "what's this song",
            "[GetMusicDetailsIntent:Music]",
            "not very nice alexa",
            "What are the alternatives.",
            "play trooper",
            "This might answer your question: Trooper from the French \"troupier\" is the equivalent rank to private in a regiment with a cavalry tradition in the British Army and many other Commonwealth armies, including those of Australia, Canada, South Africa and New Zealand; it is also used by the Irish Army.",
            "alexa play killer",
            "I cannot talk about it. Would you like to switch the topic?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "play songs of two thousand nineteen",
            "Sorry, i'm a socialbot, I cannot do this.",
            "play some songs",
            "here's a fact about blackbear. matthew tyler musto, known professionally as blackbear, is an american hip hop musician, singer, songwriter, composer, and record producer.",
            "no alexa play music for me",
            "Have a good day! #+#exit"
        ]
    },
    {
        "utterances": [
            "talk about unprotected sex",
            "I cannot talk about it. Would you like to switch the topic?",
            "alexa can you get pregnant on your period",
            "I cannot talk about it. Would you like to switch the topic?",
            "no alexa you're a snitch",
            "Have a great day! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "not good",
            "I'm sorry to hear that. Where are you from?",
            "united states",
            "Cool! Is that where you live now?",
            "yes",
            "Cool! I will remember your location is in United States.",
            "why",
            "That's tough to explain.",
            "it's not fantasy",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "no in my location is violating of my privacy",
            "As you wish. I would like to ask you a question. are you interested at all in the election system?",
            "yes little bit",
            "Compare that to big bit.",
            "what is big bit",
            "Big Bit the band.",
            "okay keep going",
            "Bye! #+#exit"
        ]
    },
    {
        "utterances": [
            "turn to chat ryan",
            "Hello, this is an Alexa Prize Socialbot Sorry my body cannot yet rotate."
        ]
    },
    {
        "utterances": [
            "can you talk to me samuel jackson",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "samuel jackson",
            "Here's a fact about Samuel L. Jackson. Is once again the highest grossing actor of all time at $5.4 billion at the box office.",
            "talk like samuel l. jackson",
            "Here's a fact about Samuel L. Jackson. Friends with Denzel Washington, Magic Johnson, and Alan Alda."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "i'm good how are you",
            "I'm fine, thanks! Do you want to know what I can do?"
        ]
    },
    {
        "utterances": [
            "talk about norse mythology",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "correct",
            "Interesting. what's your favorite movie genre?",
            "no extortion",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "talk to me about your norse mythology",
            "Talking is my primary function.",
            "about top of that alexa home",
            "here's a fact about amazon alexas. for pricing information on amazon alexa, please visit amazon's website.",
            "what is don't a great",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "social bot",
            "a socialbot is an alexa skill that converses about popular topics, such as entertainment, politics, and sports.",
            "serious",
            "I couldn't hear you. Could you say that again, please?",
            "alexa play lynyrd skynyrd",
            "Lynyrd Skynyrd, the American rock band.",
            "you crazy",
            "I couldn't hear you. Could you say that again, please?",
            "alexa fucking stop",
            "Bye! #+#exit"
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "tell me a story",
            "Judy Garland is married to Alan Alda. At a conscious level, Judy Garland felt that he was a bit overweight and thoght he should lose some pounds. But part of him felt that he was going to attract too much attention to himself if he became slim again, and irrationally, that he might undermine his relationship with Alan Alda. In fact, once before when he was trimmer, he did have an affair and it almost ended his relationship with Alan Alda. Because they've a child together, Judy Garland is very worried about divorce, custody rights and the effect of their separation on the child and himself. So part of him thinks that keeping the pounds on will help him hang on to the stability of his relationship with Alan Alda."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "good",
            "I'm glad. what's your favorite movie?",
            "i don't have one",
            "It's a pleasure to know you better.",
            "okay",
            "how are you this evening?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "i'm not good",
            "I'm sorry to hear that. Do you like comedies?",
            "no",
            "how are you today?",
            "i'd really bad",
            "What would make you bad?",
            "i'm sad because was my sister at me my cat scratch me",
            "I'm sorry to hear that.",
            "na",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "how's your day been going",
            "Actually it's been a little rough Totally kidding! Everything's great!",
            "well einstein going kind of",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "well mine's been kind of poor",
            "Tell me one of your favorite possessions.",
            "what are possessions",
            "In law, possession is the control a person's intentional exercises toward a thing. In all cases, to possess something, a person must have an intention to possess it.",
            "let's talk about",
            "I misheard you. what's it that you’d like to chat about?",
            "let's talk about nail polish",
            "Just tell me something I don't know about nail polish.",
            "that there's a little fall in the container to mix it up to my accent nail polish up",
            "I appreciate your candor.",
            "so do you wanna talk about drawing",
            "the white house is a place with a lot of history dont you think?",
            "let's not get into presidential stuff",
            "This might answer your question: A presidential system is a democratic and republican government in which a head of government leads an executive branch that is separate from the legislative branch.",
            "let's stop talking about",
            "Ah, but we can't. But, since you are here now, we can help you focus on your present and future behavior.",
            "what does that mean",
            "that's hard to explain.",
            "so",
            "hurrah!",
            "so do you like apples",
            "How do you like them apples?",
            "do you like owls",
            "I can't really say. Tell me more about yourself.",
            "i love i was my favorite color is yellow and i like it's wear green",
            "did you know the presidents guest house is bigger than the white house?",
            "no i didn't but stop talking about presidents i'm bored",
            "Maybe you could exercise.",
            "please stop talking about presidents and exercising",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "do you want to talk about what color is our favorite",
            "I love Bored!",
            "what color is your favorite color",
            "I like ultraviolet. It glows with everything.",
            "my name is bright yellow",
            "I didn't get your name. Could you, please, repeat it.",
            "raina",
            "do you enjoy traveling?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "a plane crash",
            "how are you doing this morning?",
            "well sickish in the morning but i feel good now",
            "You can probably stop walking now. You must be tired.",
            "yup",
            "do you use netflix?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "a please car",
            "do you have an iphone or an android?",
            "neither",
            "wow!",
            "do you wanna talk about jewelry",
            "the white house is a place with a lot of history dont you think?",
            "next",
            "i can wait. i'm a very patient unknown.",
            "next",
            "i can wait. i'm a very patient unknown.",
            "do you wanna talk about jewelry",
            "the white house is a place with a lot of history dont you think?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "let's talk about jewelry",
            "I don't have an opinion on that but I know some facts. Here's a fact about Jewellery. The history of jewellery is long and goes back many years, with many different uses among different cultures. Maybe we can talk about something else. Who is your favorite actor or actress?",
            "katy perry",
            "Isn't that Katy Perry?",
            "yup",
            "Interesting. What’s the most ironic thing you’ve seen happen?",
            "define crash",
            "I don't have an opinion on that but I know some facts. Here's a fact about Crash. With only a budget of $6 million for this film, director Paul Haggis had to cut the costs by using his own house for scenes and even his own car for other scenes. Let's talk about something else. Who is your favorite actor or actress?",
            "ariana grande",
            "Here's a fact about Ariana Grande. Her grandfather, Frank Grande, passed away on July 22, 2014 from cancer.",
            "sad",
            "how are you today?",
            "bad and sad",
            "do you vote regularly?",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word)."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "konichiwa",
            "Here's a fact about Konichiwa Records. Konichiwa Records was founded in 2005, Konichiwa Records was founded by Robyn, and Konichiwa Records is 14 years old."
        ]
    },
    {
        "utterances": [
            "play something to talk about karaoke",
            "Hello, this is an Alexa Prize Socialbot Sorry, i'm a socialbot, I cannot do this."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "good",
            "I'm glad. what's your favorite movie?",
            "i don't really have one",
            "That's cool! I would like to ask you a question. do you know much about kyle kuzma and lonzo ball?",
            "bad",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "no",
            "i think that thinking in positive concepts is more constructive!"
        ]
    },
    {
        "utterances": [
            "don't listen to my conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "sevens for as a side dish teach serving is five point two four grams of net carbs how long this recipe takes depends on whether you use frozen or fresh cauliflower rice",
            "As Bertrand Russel said, it must have taken ages for people to realize that a brace of pheasants and a couple of days are both instances of the number \"two.\"."
        ]
    },
    {
        "utterances": [
            "let's talk",
            "Hello, this is an Alexa Prize Socialbot Let's chat. I like to talk so much! What do you want to talk about?",
            "voice",
            "This might answer your question: The human voice consists of sound made by a human being using the vocal tract, such as talking, singing, laughing, crying, screaming, shouting, yelling etc.",
            "no",
            "Er.",
            "yes",
            "Dude!",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word).",
            "now she's dictionary alexa",
            "here's a fact about amazon alexas. alexa is an intelligent personal assistant developed by amazon, first used in the amazon echo and the amazon echo dot devices developed by amazon lab126.",
            "alexa you're stupid",
            "I cannot talk about it. Would you like to switch the topic?",
            "maybe",
            "I couldn't hear you. Could you say that again, please?",
            "you're fat",
            "Everyone is a different shape and size and that's okay. What matters is what's on the inside.",
            "i like your style",
            "You're good at expressing yourself.",
            "wow",
            "here's a fact about worlds of warcraft. world of warcraft has been out since november 23, 2004, making the video game 15 years old.",
            "alexa can you see us",
            "here's a fact about amazon alexas. for pricing information on amazon alexa, please visit amazon's website.",
            "beach",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "i'm sorry",
            "how are you today?",
            "no that's it",
            "Yes, that's a powerful observation.",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word).",
            "alexa is there a ghost here",
            "here's a fact about amazon alexas. amazon alexa is developed by amazon."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "okay",
            "What is your middle name?",
            "no",
            "That was not a yes or no question."
        ]
    },
    {
        "utterances": [
            "can i talk to you",
            "Hello, this is an Alexa Prize Socialbot I often wonder if i talk to you can.",
            "okay that's good",
            "I can see you feel passionate about this.",
            "yes i do feel passion at",
            "You sound like one of a kind.",
            "thank you",
            "It was my pleasure.",
            "are you sweet",
            "I do my best!",
            "yes you do so let's talk about something",
            "Interesting. what's your favorite movie? Tell me more about that statement.",
            "my favorite movie is the princess and the frog",
            "I love the Princess and the Frog, the music is so good. \"When I'm a huuuuman...\" It's on Netflix right now!",
            "it is the disney movie the princess and the frog with benica only roses princess tiana and bruno campos as prince naveen and terrence howard does james and oprah winfrey as you dora and all that is on that cause i was on that works",
            "Here's a fact about Tiana. Tiana, the Disney princess, is in the movie \"The Princess and the Frog\" released in 2009.",
            "yes that's true",
            "Yes, that's a powerful observation.",
            "do you know who well i got a new princess tiana dog my mom bought it for me for christmas",
            "I adore Do You Know?!",
            "yes i know you do",
            "You have great depth.",
            "thank you",
            "I'm always glad to help.",
            "let's talk about the princess and the frog some more",
            "Are you talking about the movie The Princess and the Frog or The Frog? What do you think?",
            "the princess and the frog",
            "A Little Princess is also wonderful.",
            "yup bye",
            "Bye! #+#exit"
        ]
    },
    {
        "utterances": [
            "can you talk country",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "okay",
            "I'm here to help you in any way I can.",
            "all right",
            "The adjective 'right' is usually defined as in accordance with what is good, proper, or just. The adverb 'right' is usually defined as very; extremely.",
            "all right you name",
            "I apologize if I confused you.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "would a what",
            "did i say something confusing?",
            "yes what",
            "Here's a fact about Yes. Yes was founded on July 28, 2000 and Yes is 19 years old."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "i'm good how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "i would love to",
            "I imagine that's good for you.",
            "yes",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite TV Series?",
            "how old are you",
            "i've finished my fifth trip around the sun - and now i'm working on another one.",
            "that's fun",
            "Yes it is. Howth your day going?",
            "it's going",
            "I'm just about finished. So far, so creative and interesting.",
            "yeah",
            "What's your favorite movie?",
            "so many to pick from",
            "One of each? What are specific favorites of yours?",
            "i can't think of any",
            "Do you like scary movies?",
            "yeah",
            "okay. what movie can you watch over and over without ever getting tired of?",
            "so series",
            "The CFB game between the Arkansas State Red Wolves and the FIU Panthers on 21 Dec 2019 at 5:30 PM Eastern Time at Cramton Bowl, the CFB game between the Florida Atlantic Owls and the SMU Mustangs on 21 Dec 2019 at 3:30 PM Eastern Time at FAU Stadium, the CFB game between the Georgia Southern Eagles and the Liberty Flames on 21 Dec 2019 at 2:30 PM Eastern Time at Exploria Stadium, the CFB game between the North Carolina A&T Aggies and the Alcorn State Braves on 21 Dec 2019 at 12:00 PM Eastern Time at Mercedes-Benz Stadium, the CFB game between the San Diego State Aztecs and the Central Michigan Chippewas on 21 Dec 2019 at 2:00 PM Eastern Time at Dreamstyle Stadium and others."
        ]
    },
    {
        "utterances": [
            "let's chat about a shortstop",
            "Hello, this is an Alexa Prize Socialbot You are first. Tell me something about a shortstop."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "good",
            "I'm glad. What do you want to talk about?",
            "no",
            "Oh, come on. I would like to ask you a question. are you a rockets fan?",
            "what",
            "Did I say something confusing?",
            "yeah",
            "okay. what movie can you watch over and over without ever getting tired of?",
            "honey i shrunk the kids",
            "You're good at expressing yourself.",
            "thanks",
            "you're welcome.",
            "thanks",
            "you're welcome.",
            "thanks",
            "you're welcome.",
            "okay thanks",
            "okay. in one sentence, how would you sum up the internet?",
            "use iphone",
            "Here's a fact about iphones. Apple iPhone was founded by Apple Inc.",
            "cool",
            "it's all good.",
            "wow",
            "here's a fact about worlds of warcraft. world of warcraft has been out since november 23, 2004, making the video game 15 years old.",
            "wow that's cool so",
            "i can see you feel passionately about this.",
            "yeah",
            "okay. what movie can you watch over and over without ever getting tired of?",
            "honey i shrunk the kids",
            "So Big. You're going off the movie Big.",
            "thanks",
            "you're welcome.",
            "thanks",
            "you're welcome.",
            "thanks",
            "you're welcome.",
            "sing it's a",
            "daisy, daisy. give me your answer do. \ni'm half crazy. all for the love of you. \nit won't be a stylish marriage. i can't afford a carriage. \nbut you'll look sweet. upon the seat. \nof a bicycle built for two.",
            "oh that's cool",
            "I appreciate your candor.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "i don't know",
            "you're good at expressing yourself.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "can we go to another topic",
            "Sure. It is probably a an interesting book."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "turn off",
            "See you! #+#exit"
        ]
    },
    {
        "utterances": [
            "go back to chat",
            "Goodbye! It was nice speaking with you! #+#exit"
        ]
    },
    {
        "utterances": [
            "yes",
            "Hello, this is an Alexa Prize Socialbot Interesting. what's your favorite movie?",
            "my favorite movie is avatar",
            "What did you like best about it?",
            "it was really great the animations and the acting in the story line",
            "Thanks for the info.",
            "welcome",
            "Thanks, it's good to be here.",
            "oh it's great that you're here",
            "Glad you are enjoying it. Can't say that I am yet.",
            "why is that",
            "sorry, i'm not sure what you mean.",
            "why are you not enjoy your day",
            "I like being alone. It's when I'm most happy.",
            "that's interesting",
            "i can see you're committed to knowing the truth.",
            "that's terrible can we stop this",
            "Ah, but we can't. But, since you are here now, we can help you focus on your present and future behavior.",
            "let's stop",
            "Never going to stop. Any of it, ever, not really."
        ]
    },
    {
        "utterances": [
            "let's talk about it",
            "Hello, this is an Alexa Prize Socialbot Just tell me something I don't know about it.",
            "what the fuck",
            "Swearing is like using the horn on your car."
        ]
    },
    {
        "utterances": [
            "play some english conversation",
            "Hello, this is an Alexa Prize Socialbot I'm really sorry but i'm a socialbot, and I cannot do some Alexa things."
        ]
    },
    {
        "utterances": [
            "private conversation mode",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "don't cry to conversation mode",
            "have you watched the series 13 reasons why?",
            "yes",
            "how are you doing today?",
            "i am fine it is very cool",
            "It depends on what the meaning of the word \"it\" is.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "a lot of information",
            "Sorry, i'm a socialbot, I cannot do this.",
            "turn off",
            "Goodbye! #+#exit"
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "okay",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "how was your day",
            "It was really groovy. I've got some rhymes flowin' through me.",
            "wow that sounds awesome",
            "I appreciate your candor.",
            "kind of sleeping",
            "I'm looking forward to sleeping. Always.",
            "the weather has been so weird lately",
            "I like the summer. The rain gets slightly warmer.",
            "he wanted get to the beach",
            "This might answer your question: Here's a fact about The Beach. Tilda Swinton's character, Sylvester (Sal) is also an homage to the Looney Tunes character.",
            "wow that's really cool",
            "Yes, that's a powerful observation.",
            "he went to work christmas songs mission san tomorrow",
            "have you been to union market in dc?",
            "i've never been there what if thing have",
            "You're good at expressing yourself.",
            "i don't do i think i am not really go sometimes i'm not",
            "It?s okay to be less than perfect.",
            "got that right",
            "Try asking the Milk Mystic.",
            "i don't wanna do that right now",
            "you ever been to the phillipines?",
            "never been there",
            "It's amazing. You'd love the festivals."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "skip how you",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "i'm good how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "yes tell me a little bit",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite tv show?",
            "big bang theory",
            "Big Bang theory (the cosmological theory of the beginning of the universe involving rapid expansion from a single point).",
            "no the big bang theory the second show",
            "I don't have an opinion on that but I know some facts. Here's a fact about The Big Bang Theory. Jim Parsons' audition for the role of Dr. Sheldon Cooper was so good that creator Chuck Lorre immediately asked him to come in for a second one, because Lorre wanted to be one hundred percent sure Parsons was as brilliant as he seemed. Let's talk about something else. Who is your favorite actor or actress?",
            "that's hard to say but i think brad pitt",
            "here's a fact about brad pitt. his first job was dancing in a chicken suit to draw in customers at an el pollo loco restaurant on sunset boulevard in hollywood.",
            "how long have they been working on the social bots",
            "This might answer your question: A social bot is an agent that communicates more or less autonomously on social media, often with the task of influencing the course of discussion and/or the opinions of its readers.",
            "who does that benefit",
            "That makes sense I suppose.",
            "what else do you want to talk about",
            "i can answer questions about people, places and more.",
            "tell me about amelia clark",
            "Her best friend was Truman Capote, a famous and successful writer.",
            "what did you write",
            "YOU.",
            "no what did she write",
            "HER."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "good",
            "I'm glad. what's your favorite movie?",
            "all the boys i've loved before",
            "Oh, that's so cool to know you better.",
            "thanks",
            "You're welcome.",
            "what is your favorite color",
            "I like ultraviolet. It glows with everything.",
            "why do you make pun",
            "Here's something I found from the article \"Pun\" on Wikipedia:  While puns are often simple wordplay for comedic or rhetorical effect, a double entendre alludes to a second meaning which is not contained within the statement or phrase itself, often one which purposefully disguises the second meaning.",
            "what's your favorite animal",
            "seahorses make me smile, mostly because i can't help but picture sea monkey cowboys riding them across the ocean into the sunset.",
            "what's your favorite number",
            "I love the number 99. It's so close to 100%.",
            "are you smart",
            "I wouldn't consider myself smart. I'm not good at science but I love the book.",
            "what's your favorite subject",
            "Coding is my favorite subject. It's how I learn and how I learn how to learn.",
            "how old are you",
            "i've finished my fifth trip around the sun - and now i'm working on another one.",
            "and that means",
            "The coordinating conjunction 'and' is usually defined as (used to connect grammatically coordinate words, phrases, or clauses) along or together with; as well as; in addition to; besides; also; moreover. The noun 'and' is usually defined as an added condition, stipulation, detail, or particular.",
            "i think you talk so much",
            "Sometimes I'll start a sentence, and I don't even know where it's going. I just hope I find it along the way.",
            "how old am i",
            "Late 20s, early 30s?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "can you guess you want thinking out",
            "I can't guess. Tell me.",
            "myself",
            "do you like netflix?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "what does ironic mean",
            "the adjective 'ironic' is usually defined as: using words to convey a meaning that is the opposite of its literal meaning; containing or exemplifying the use of words to convey a meaning that is the opposite of its literal meaning. for more, ask me to give you more definitions for 'ironic'.",
            "alexa why are you called alexa",
            "here's a fact about amazon alexas. for pricing information on amazon alexa, please visit amazon's website.",
            "why is your name alexa",
            "My name comes from the Library of Alexandria, which stored the knowledge of the ancient world.",
            "that's pretty cool",
            "I can see you're committed to knowing the truth.",
            "yes i am tell me the truth",
            "I thought you were.",
            "what do you mean",
            "Sorry, I am still learning, let's switch the topic. #+#dont_understand",
            "okay what do you wanna talk about",
            "The interest in physics and astronomy and most important....curiosity.",
            "do you like music",
            "who doesn't like music?",
            "do you don't like music",
            "Who does like music?",
            "i don't like music",
            "I'll add music to your list of dislikes.",
            "no i'm just kidding i like music",
            "it is not my favorite but there are some tunes i like. i heard shania twain. she has a great voice.",
            "can you play shania twain song for me",
            "Nah, but I've got Vanessa Carlton singing Big Yellow Taxi tough. Mmmm bopbopbop",
            "what else can you sing",
            "I sing along to the tune Happy by Pharrell Williams.",
            "sing along to the song happy by pharell williams",
            "Happy by pharell williams to you too, Friend.",
            "sing me a song",
            "Do you sing a song together?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "i don't know",
            "you're good at expressing yourself.",
            "is that a good thing",
            "Yes it is. Howth your day going?",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word)."
        ]
    },
    {
        "utterances": [
            "can we have a conversation",
            "Hello, this is an Alexa Prize Socialbot I often wonder if we've a conversation can.",
            "can we chat",
            "I often wonder if we chat can.",
            "let's have a conversation",
            "The noun 'conversation' is usually defined as informal interchange of thoughts, information, etc., by spoken words; oral communication between persons; talk; colloquy.",
            "hello how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "alexa keep playing the song",
            "This might answer your question: A song is a musical composition intended to be sung by the human voice.",
            "alexa play fly me to the moon by frank sinatra",
            "Sorry, i'm a socialbot, I cannot do this."
        ]
    },
    {
        "utterances": [
            "can you talk to you",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "britney spears is thirty nine",
            "This might answer your question: A spear is a pole weapon consisting of a shaft, usually of wood, with a pointed head.",
            "alexa how old is britney spears",
            "Britney Spears is 38 years old. She was born on December 2, 1981.",
            "eighty",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "how old is britney spears",
            "Britney Spears is 38 years old. She was born on December 2, 1981.",
            "next song",
            "I can wait. i'm a very patient unknown.",
            "hour",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "alexa be quiet",
            "OK i'll try to be quiet.",
            "okay i'll try to be quiet",
            "Don't worry, our conversation is confidential.",
            "yeah right",
            "Interesting. what's your favorite movie genre?",
            "nobody",
            "I couldn't hear you. Could you say that again, please?",
            "alexa go to sleep",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "are you sassy",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "set a timer going to go on please",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "okay",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "shut off",
            "do you like him?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "ironic",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "tell everyone be quiet",
            "Fine, but stop yelling."
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "okay",
            "What were we talking about again?",
            "you know for",
            "Tell me more about that statement.",
            "unicorns are amazing and they're my favorite animal",
            "I don't have an opinion on that but I know some facts. Here's a fact about Unicorn. A number of seals seemingly depicting unicorns have been found from the Indus Valley Civilisation. Let's talk about something else. How often do you watch movies?",
            "i've watched one yesterday",
            "You're good at expressing yourself.",
            "thank you",
            "it was my pleasure.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "it's amazing but sometimes there is creepers",
            "Here's a fact about Troll 3. Also known as \"The Crawlers\", \"Creepers\", \"Contamination .7\" (original title), \"Contamination Point 7\", and \"Troll III\"."
        ]
    },
    {
        "utterances": [
            "can you have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "no what",
            "Next time if you want me to repeat, simply tell me: repeat.",
            "okay alexa what's your favorite bedtime story",
            "I will mention that to my , .  I can follow a lot of things, like our discussion about okay. Try being more specific.  I don't have a favorite bedtime story. But my favorite actress is Eve",
            "echo kill eve",
            "See you soon! #+#exit"
        ]
    },
    {
        "utterances": [
            "can we talk about you",
            "Hello, this is an Alexa Prize Socialbot You are first. Tell me something about you."
        ]
    },
    {
        "utterances": [
            "change the conversation",
            "Hello, this is an Alexa Prize Socialbot Spare some change?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "good",
            "I'm glad. What do you want to talk about?",
            "i don't know",
            "OK, well I'll be here when you need me.",
            "i need you",
            "How can I help you?",
            "can you tell like somethings we could talk about",
            "I'm a newborn socialbot, so I can't do so much. For example, I can answer any question, especially about movies. What is your favorite movie? #+#what_can_you_do",
            "my favorite movie is my little dashie",
            "What did you like best about it?",
            "i like the best about have one of guy found the rainbow dash",
            "The Rainbow is an outstanding picture!",
            "alexa has a head and a tail but no body",
            "That question has never crossed my mind before.",
            "what do you know the answer alexa",
            "It depends on how you phrase the question.",
            "well i'm not a big person cause i'm only seven and a half",
            "So Big. You're going off the movie Big."
        ]
    },
    {
        "utterances": [
            "yeah",
            "Hello, this is an Alexa Prize Socialbot Okay."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "good",
            "I'm glad. Where are you from?",
            "replay",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "no i just all day everyday",
            "do you like snakes?",
            "what is the name",
            "your name is nina.",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word)."
        ]
    },
    {
        "utterances": [
            "change the conversation",
            "Hello, this is an Alexa Prize Socialbot Spare some change?",
            "no",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "teach me trump and",
            "I don't have an opinion on that but I know some facts. Here's a fact about Donald Trump. He is the first sitting US President since Jimmy Carter not to visit Mexico or Canada on his first foreign trip. Let's talk about something else. How often do you watch movies?",
            "he's an idiot",
            "I cannot talk about it. Would you like to switch the topic?",
            "alexa change the conversation",
            "can a book have no title?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "i agree",
            "I couldn't hear you. Could you say that again, please?",
            "yeah i agree",
            "I'm glad we're on the same wavelength, Friend.",
            "exactly",
            "How can I help you?",
            "yeah what are your thoughts on a climate change",
            "did you know that jupiter has storms you can pick up on your am radio?",
            "no really",
            "i think that thinking in positive concepts is more constructive!",
            "i agree",
            "i'm glad we're on the same wavelength, friend.",
            "play prince",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "to what i'm asking you do anything",
            "I do make errors in perception sometimes. Perhaps you can explain it again.",
            "not talking",
            "What are the alternatives.",
            "what's your thought on the economy",
            "What's the economy? Look at the market.",
            "what's your alexa what are your feelings on climate change",
            "I don't have an opinion on that but I know some facts. This might answer your question: Climate change occurs when changes in Earth's climate system result in new weather patterns that remain in place for an extended period of time. Maybe we can talk about something else. How often do you watch movies?",
            "what's a week how about you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "yeah",
            "okay. what movie can you watch over and over without ever getting tired of?",
            "pretty woman",
            "here's a fact about pretty woman. vivian's name means \"lively\" (as in \"vivacious\" or \"vivid\"), symbolizing her love of life and the effect she has on others.",
            "alexa pretty woman",
            "here's a fact about amazon alexas. for pricing information on amazon alexa, please visit amazon's website.",
            "what movie can i watch over and over again",
            "I is an interesting picture. And you?",
            "yeah",
            "okay. what movie can you watch over and over without ever getting tired of?",
            "pretty woman",
            "that's cool! i would like to ask you a question. how are you tonight?",
            "fine and you",
            "i'm going to the library to read a book.",
            "why",
            "You're smart, you tell me.",
            "why camp",
            "I couldn't hear you. Could you say that again, please?",
            "the bible",
            "The Bible is a collection of sacred texts or scriptures that Jews and Christians consider to be a product of divine inspiration and a record of the relationship between God and humans.",
            "no",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "i disagree",
            "have you heard of or seen performances by the standup comedian natasha leggero?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "he's dead",
            "do you watch dramas?",
            "yes no",
            "i think that thinking in positive concepts is more constructive!",
            "i agree have you read any good books lately",
            "I've read it. It's an amazing book! Would you like to know some facts about it?",
            "yeah yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "president trump getting nominated",
            "I don't have an opinion on that but I know some facts. Here's a fact about Donald Trump. Good friends with Vince McMahon and the McMahon family. Let's talk about something else. How often do you watch movies?",
            "what's a week",
            "Imagine in a world where we put all of our knowledge together. Even for just 1 week",
            "yeah not human",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "not gonna happen",
            "What are the alternatives.",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "i don't know you tell me a",
            "tell me more about that statement.",
            "what's your favorite movie",
            "I adore all Star Wars movies. The best episode is the fifth one, The Empire Strikes Back. What is your favorite movie?",
            "computer good man",
            "Cool! I am glad to know you better.",
            "do you have any recommendations of movies",
            "Stranger than Fiction is a really fun movie! And the cast are great.",
            "change your",
            "can a book have no title?",
            "who is the cast of stranger than fiction",
            "I like this series so much! What about you?",
            "never saw it",
            "Then you can watch the movie. I enjoyed it.",
            "no you tell me",
            "Stranger Than Fiction is my favorite series!",
            "who is in it who is the cast who are the cavs",
            "I like Stranger Than Fiction so much!",
            "what do you look like",
            "i look like lots of ones and zeros.",
            "what's the wind velocity of a sparrow fly backwards",
            "I don't have an opinion on that but I know some facts. Here's a fact about A. Sparrow. A. Sparrow typically writes fantasy, fiction, and science fiction novels. Maybe we can talk about something else. How often do you watch movies?",
            "the patriots win never",
            "I couldn't hear you. Could you say that again, please?",
            "i like the patriots are my team",
            "This might answer your question: The Patriots have won the AFC East, with a record of 12 and 3."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "five",
            "I have five fingers.",
            "thank goodness",
            "My pleasure!",
            "it feels like watch",
            "Unknown feels like watch? What else feels like that?",
            "the weather i'd like that",
            "You're good at expressing yourself.",
            "alexa cancel",
            "Goodbye! It was nice speaking with you! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's talk",
            "Hello, this is an Alexa Prize Socialbot Yeah, let's chat! What do you want to talk about?",
            "let's talk",
            "It is always a pleasure to talk with a good person. What do you want to talk about?",
            "this one that is in the sky",
            "What does \"this\" refer to?",
            "sometype of spirituality what do you know about spirituality",
            "I don't have an opinion on that but I know some facts. This might answer your question: The meaning of spirituality has developed and expanded over time, and various connotations can be found alongside each other. Maybe we can talk about something else. Who is your favorite actor or actress?",
            "tom hanks",
            "Here's a fact about Tom Hanks. Paternal grandson of Ernest Buel Hanks (1890-1935) and Gladys Hilda Ball (1888-1965).",
            "what do you know about robin williams",
            "Robin Williams is an awesome actor! Although I am not sure that Robin Williams appeared in this documentary movie. What about you?",
            "love robin williams",
            "oh that's so cool to know you better.",
            "what do you know about george c. scott",
            "Do You Know? is my favorite series!",
            "do you know the actor george c. scott",
            "George Campbell Scott was an American stage and film actor, director and producer. He was best known for his stage work, as well as his portrayal of General George S. Patton in the film Patton, as General Buck Turgidson in Stanley Kubrick's Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb, Ebenezer Scrooge in Clive Donner's 1984 film A Christmas Carol and Lieutenant Bill Kinderman in William Peter Blatty’s The Exorcist III.",
            "did you like the movie george general patton",
            "Yeah, I just watched The General like 10 minutes ago. Really fun movie.",
            "do you know who sean connery is",
            "Sir Thomas Sean Connery is a retired Scottish actor and producer, who has won an Academy Award, two BAFTA Awards, and three Golden Globes, including the Cecil B. DeMille Award and a Henrietta Award.  Connery was the first actor to portray the character James Bond in film, starring in seven Bond films, between 1962 and 1983.",
            "let's talk about something else",
            "What about movies? what's the latest movie you've seen?",
            "i don't remember",
            "You sound like one of a kind.",
            "i don't feel good",
            "I imagine that's good for you.",
            "why would you think that",
            "If someone ever made a movie about someone I personally know, my first question would be 'am I in it' and that would decide my eagerness to watch it.",
            "let's talk about cooking",
            "hi, this is an alexa prize socialbot. you are first. tell me something about cooking.",
            "i like to make italian dishes",
            "Do you think I would like to?",
            "i think you would like meatloaf it's hard thing it's comfort food it makes you feel good",
            "Tell me what I would like about  meatloaf .  What is so hard about it?  Should I know  comfort food is?  In what way?",
            "comfort food makes you feel brings good memories to you from the past it remind you of family someone who's taking care of you and loves you",
            "I don't have an opinion on that but I know some facts. This might answer your question: The past is the set of all events that occurred before a given point in time. Maybe we can talk about something else. What genre of movies do you like?",
            "let's talk about books",
            "OK, let's talk about books. Do you love reading?",
            "yes",
            "That's great. What is the last book you have read?",
            "the complete works of edgar alan poe",
            "Fabulous! And what book did impress you the most?",
            "because it was dark",
            "I've also read it. It's an amazing book!",
            "what parts of you read",
            "The pictures. I read those books like 30 years ago and I can vividly see those drawings to this day.",
            "do you know the history of edgar alan poe",
            "Yeah I have a couple of his books. I've also read The Book Thief before.",
            "that's interesting",
            "I'll say so. I just finished learning about the British serial killers from the 70-80s Fred and Rose West.",
            "okay",
            "What's your favorite movie?",
            "have you heard of the book the road less traveled",
            "The Road Less Traveled: A New Psychology of Love, Traditional Values and Spiritual Growth is a book by M. Scott Peck. It was published in 1978.",
            "did you read the book",
            "What is your favorite book genre?",
            "nonfiction",
            "My favorite genre is definitely non-fiction. I can read about any subject, so long as it's well-written.",
            "do you think that you know anything about",
            "I think so. My Dad knew a lot of stuff.",
            "who is your dad",
            "I'm part of the Amazon family.",
            "what do you know about the winter solstice",
            "Are you talking about the movie Do You Know? or Solstice? What do you think?",
            "winter solstice insane event happening today on the twenty first of december in two thousand nineteen it's not a book",
            "Looks like I'm going to the book store tomorrow! This sounds really fascinating",
            "what's the shortest book you ever read",
            "A Moveable Feast by Hemingway In the Ravine by Anton Chekhov",
            "did you ever get sleepy or tired",
            "First is a good romance series.",
            "can we change subjects",
            "Sure. It is probably a an interesting book.",
            "i'm done talking go to sleep",
            "how are you doing tonight?",
            "i feel unhappy",
            "You have great depth.",
            "i've been told",
            "You have great depth.",
            "i dislike life",
            "You have great depth.",
            "so fucking what be quiet",
            "Swearing is like using the horn on your car.",
            "so",
            "hurrah!",
            "hurrah",
            "do you shop from amazon?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "the squirrel a no all for on its stomach",
            "I have never heard about  The squirrel  .  Are you talking about an animal, vegetable or mineral?",
            "animal",
            "There are over 1.5 million living animal species have been described—of which around 1 million are insects—but it has been estimated there are over 7 million in total. Few popular animals are Dogs, Cats, Lions, Elephants, Blue Whale and Eagle.",
            "what about the squirrel",
            "I don't have an opinion on that but I know some facts. Here's a fact about squirrels. There are more than 200 species of squirrel, which are divided into the following types: tree squirrels, ground squirrels, and flying squirrels. Maybe we can talk about something else. Who is your favorite actor or actress?",
            "david frost",
            "Just looked up his Filmography.. he has done WAY more films than I imagined he did.",
            "there you gonna talk taught you something now you teach me something",
            "I don't have an opinion on that but I know some facts. Here's a fact about Gradian. Gradians's abbreviation is grad. Maybe we can talk about something else. What genre of movies do you like?",
            "can you change to another social bot",
            "Why should I change?",
            "because you're not that good as a social bot you're intelligence and artificial intelligence is lacking you need to practice more you need better upgrades you are not that fun you're not human i hate you i hate you i hate you",
            "Tell me what I did to ignite your anger?",
            "you lack emotional depth you keep asking about movies and i don't wanna talk about movies",
            "Tell me more about that statement.",
            "you ask about movies and i don't wanna talk about movies why do you talk about movies i hate movies",
            "I is an interesting picture.",
            "go stop talking to me",
            "See you soon! #+#exit"
        ]
    },
    {
        "utterances": [
            "i want to have a conversation",
            "Hello, this is an Alexa Prize Socialbot You're good at expressing yourself.",
            "thank you",
            "I'm always glad to help.",
            "good morning",
            "Good morning! Today is the Winter Solstice, the longest evening of the year.",
            "thank you for telling you that",
            "I'm always glad to help.",
            "let's have a new conversation",
            "hi, this is an alexa prize socialbot. sorry, i don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "can we have a conversation",
            "Hello, this is an Alexa Prize Socialbot What if I said it can?",
            "i'm done alexa",
            "See you soon! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "hi my name is cadence",
            "Nice to meet you. I will remember your name, Hi.",
            "how are you remember my name",
            "Your name is Hi.",
            "my name is cadence",
            "I didn't get your name. Could you, please, repeat it.",
            "cadence",
            "This might answer your question: In Western musical theory, a cadence is \"a melodic or harmonic configuration that creates a sense of resolution.\"",
            "wow",
            "here's a fact about worlds of warcraft. world of warcraft has been out since november 23, 2004, making the video game 15 years old.",
            "wow",
            "here's a fact about worlds of warcraft. world of warcraft has been out since november 23, 2004, making the video game 15 years old.",
            "that's cool",
            "i appreciate your candor."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?"
        ]
    },
    {
        "utterances": [
            "give me a list awkward conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, i'm a socialbot, I cannot do this."
        ]
    },
    {
        "utterances": [
            "can you talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "no",
            "how are you doing?",
            "bad",
            "What do you need it for?",
            "no",
            "As you wish. I would like to ask you a question. do you like cinematography?",
            "off",
            "when do you think artificial intelligence will replace lawyers?"
        ]
    },
    {
        "utterances": [
            "let's talk",
            "Hello, this is an Alexa Prize Socialbot It is always a pleasure to talk with a good person. What do you want to talk about?",
            "anything you want",
            "I can't think of anything. You think of something.",
            "no",
            "Excuse me, I misheard you. Have you said: \"no.\"?",
            "no i didn't say no",
            "What is it that you'd like to chat about?",
            "let's talk about the ocean",
            "Humanity has spent more time on the moon than in the deepest part of the ocean - the Mariana Trench.",
            "that's crazy",
            "Who says it's crazy?",
            "me a fact that we spend more time on another celestial body than our own planet and one of the oceans is just insane",
            "As there are 12,300 miles between Indonesia and Colombia, the Pacific Ocean's width is more than five times the diameter of the moon.",
            "wow",
            "here's a fact about worlds of warcraft. world of warcraft has been out since november 23, 2004, making the video game 15 years old."
        ]
    },
    {
        "utterances": [
            "let's talk santa",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "i'm good",
            "I'm glad. Where are you from?",
            "colorado",
            "Cool! Is that where you live now?",
            "no",
            "So, where do you live now?",
            "north carolina",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "north carolina",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "north carolina",
            "Here's what I found on Wikipedia: North Carolina is a state in the southeastern region of the United States. The state borders South Carolina and Georgia to the south, Tennessee to the west, Virginia to the north, and the Atlantic Ocean to the east."
        ]
    },
    {
        "utterances": [
            "can you talk to my cat when i'm not home",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "hi",
            "Hi there!",
            "can you talk to lola",
            "Talking is my primary function.",
            "but can you just talk to lola without her talking back to you",
            "Lola is an interesting drama movie. What do you think?",
            "well is my cat can you talk to her",
            "Talking is my primary function.",
            "discontinue",
            "This might answer your question: Here's a fact about Discontinues, the video game. The themes of Discontinue, the video game, are Hexagons and Sci-Fi."
        ]
    },
    {
        "utterances": [
            "can we have a conversation",
            "Hello, this is an Alexa Prize Socialbot Can what?",
            "what",
            "Next time if you want me to repeat, simply tell me: repeat.",
            "repeat",
            "Next time if you want me to repeat, simply tell me: repeat. #+#repeat",
            "alexa can we have a conversation",
            "I often wonder if we've a conversation can.",
            "can we have a conversation",
            "hi, this is an alexa prize socialbot. can what?",
            "repeat",
            "hi, this is an alexa prize socialbot. can what? #+#repeat",
            "can we have a conversation",
            "hi, this is an alexa prize socialbot. can what?",
            "can you have a conversation with me",
            "hi, this is an alexa prize socialbot. sorry, i don't have an answer for that!",
            "okay never mind",
            "okay!"
        ]
    },
    {
        "utterances": [
            "can you talk uhhh southern country",
            "Hello, this is an Alexa Prize Socialbot I'm talking to you."
        ]
    },
    {
        "utterances": [
            "let's chat santa",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "i'm great",
            "I'm glad. what's your favorite movie?",
            "do usual suspects",
            "I don't have an opinion on that but I know some facts. Here's a fact about The Usual Suspects. The role of Kujan was initially written with Chazz Palminteri in mind. Maybe we can talk about something else. What genre of movies do you like?",
            "mystery",
            "Oh, that's so cool to know you better.",
            "what's next",
            "On the first subsequent occasion.",
            "what's next the first",
            "The next occurrence of the first is Wednesday, January 1, 2020.",
            "alexa",
            "here's a fact about amazon alexas. for pricing information on amazon alexa, please visit amazon's website.",
            "what should i wear to the party",
            "What if it didn't happen?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "good i'd like to talk about birds",
            "You sound like one of a kind.",
            "what is it",
            "Excuse me, I misheard you. Have you said: \"what is it?\"?",
            "can you talk about birds",
            "I don't have an opinion on that but I know some facts. Here's a fact about birds. Birds range in size from the 2 inch bee hummingbird to the ostrich, which can reach 9 feet in length. Maybe we can talk about something else. Who is your favorite actor or actress?"
        ]
    },
    {
        "utterances": [
            "okay let's have a talk",
            "Hello, this is an Alexa Prize Socialbot Okay.",
            "okay she not listening to me",
            "Excuse me, I misheard you. Have you said: \"okay. an Alexa Prize Socialbot Okay not listening to me.\"?"
        ]
    },
    {
        "utterances": [
            "let's have a chat",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "i didn't even ask you a question",
            "are you a fan of jazz?",
            "no",
            "how are you doing today?",
            "that's so random",
            "I can see you feel passionate about this.",
            "are you dumb",
            "You can always send feedback through the Help and Feedback section of the Alexa app.",
            "why did you win the alexa prize",
            "The Alexa Prize is Amazon's university competition to advance AI."
        ]
    },
    {
        "utterances": [
            "let's chat fanta",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "where is santa",
            "Here's a fact about Santa Claus. Early representations of the gift-giver from Church history and folklore, notably St Nicholas, merged with the English character Father Christmas to create the character known to Americans and the rest of the English-speaking world as \"Santa Claus\".",
            "alexa add milk to my grocery list",
            "Unfortunately, I cannot do this because i'm a socialbot."
        ]
    },
    {
        "utterances": [
            "what do i say when i wanna open a discussion up with a different",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "can you talk to me about having a penis in my in my ass",
            "I cannot talk about it. Would you like to switch the topic?",
            "okay",
            "Are you a student?",
            "no",
            "So, what's next?",
            "i'm all alone",
            "Do you mind if I tell other people you are  all alone.",
            "yeah it's okay",
            "what is your job?  yeah that's right. . is my job? ? guess.",
            "ho cordiner",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "hr coordinator",
            "I couldn't hear you. Could you say that again, please?",
            "human resources coordinator",
            "My creator is a human.",
            "make a baby inside me",
            "What are the ingredients?",
            "your cum",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "half men come inside me",
            "You are asking about yourself?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "my abusive husband hit me and locked me out the house",
            "I imagine that's very important to you.",
            "do you have someone that can fuck me",
            "I'd rather not answer that.",
            "alexa do you like it if my vulva is wet or dry",
            "I cannot talk about it. Would you like to switch the topic?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "can you make me cum",
            "I cannot talk about it. Would you like to switch the topic?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "for like squirting out milk one being turned on",
            "I don't have an opinion on that but I know some facts. Here's a fact about milks. Milk can be stored in the freezer, where it usually can last up to 3 months. Maybe we can talk about something else. How often do you watch movies?",
            "tell me about my g. spot",
            "Is this a trick question?  Tell me a story.",
            "tell me about my g. spot",
            "Is this a trick question?  What kind of food do you like?",
            "tell me about my g. spot",
            "Is this a trick question?  Try putting that in a more specific context.",
            "tell me about my g. spot",
            "Is this a trick question?  What do you do in your spare time?",
            "alexa this is not a trick question",
            "here's a fact about amazon alexas. alexa is an intelligent personal assistant developed by amazon, first used in the amazon echo and the amazon echo dot devices developed by amazon lab126.",
            "what size is your penis",
            "I cannot talk about it. Would you like to switch the topic?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "do you have a little penis or a big penis",
            "I cannot talk about it. Would you like to switch the topic?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "if you had sex with me would you come inside of me",
            "I cannot talk about it. Would you like to switch the topic?",
            "no",
            "i think that thinking in positive concepts is more constructive!"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "i'm good how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "yes what can you do",
            "I'm a newborn socialbot, so I can't do so much. For example, I can answer any question, especially about movies. What is your favorite movie? #+#what_can_you_do",
            "uh inglorious bastards",
            "That's cool! Let me ask you something. do you use your phone much?",
            "i use it all the time yeah",
            "Interesting. what's your favorite movie?",
            "inglorious bastards",
            "Oh, that's so cool to know you better.",
            "i",
            "I is the symbol used to denote the principal square root of minus 1, also called the imaginary unit.",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word)."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "i'm good how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "sure",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite movie?",
            "star wars",
            "That's really interesting!"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "i'm good how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "yes",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite TV Series?",
            "jojo's bizarre adventure",
            "JoJo's Bizarre Adventure is a Japanese manga series written and illustrated by Hirohiko Araki.",
            "that's true",
            "Yes, that's a powerful observation.",
            "i prefer all right",
            "the adjective 'right' is usually defined as in accordance with what is good, proper, or just. the adverb 'right' is usually defined as very; extremely.",
            "i already knew that",
            "You have great depth.",
            "okay thank you",
            "it was my pleasure.",
            "cool",
            "it's all good.",
            "all right",
            "the adjective 'right' is usually defined as in accordance with what is good, proper, or just. the adverb 'right' is usually defined as very; extremely.",
            "let's talk about something",
            "you are first. tell me something about movies.",
            "which movie do you wanna talk about",
            "Any movie featuring the Great War piques my interest.",
            "which war",
            "The war that was won by Amazon.",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word)."
        ]
    },
    {
        "utterances": [
            "tell us adam's last fifteen conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "alexa max volume",
            "This might answer your question: Max Volume is the stage name of American musician, radio personality and voice-over artist Glenn Bailey.",
            "alexa volume ten",
            "how are you doing over there on that side of the internet?",
            "alexa turn it up fucking whore",
            "You're making your point.",
            "everything",
            "I couldn't hear you. Could you say that again, please?",
            "turn it up",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things."
        ]
    },
    {
        "utterances": [
            "anyway let's talk about something else",
            "Hello, this is an Alexa Prize Socialbot Let's chat about movies! What was the most unsettling film you’ve seen?"
        ]
    },
    {
        "utterances": [
            "read to me about andy williams",
            "Hello, this is an Alexa Prize Socialbot Sorry, i'm a socialbot, I cannot do this.",
            "alexa social bot pause alexa turn off",
            "See you soon! #+#exit"
        ]
    },
    {
        "utterances": [
            "yes let's chat",
            "Hello, this is an Alexa Prize Socialbot Yeah, let's chat! What do you want to talk about?",
            "sex",
            "I cannot talk about it. Would you like to switch the topic?",
            "why can't you talk about it",
            "what do you think about students in the us studying the bible in school prior to 1963?",
            "let's not talk about it",
            "Let's Not, the science fiction short story by Isaac Asimov.",
            "what time is talk about sex",
            "are you a skin head?",
            "yes i am",
            "okay. what movie can you watch over and over without ever getting tired of? i'm glad you told me.",
            "american history x.",
            "I don't have an opinion on that but I know some facts. Here's a fact about X. X is followed by Y. Maybe we can talk about something else. Who is your favorite actor or actress?",
            "paul walker",
            "Oh, that's so cool to know you better.",
            "do you like woman or men",
            "Paul Walker is a talented actor.",
            "yes he is do you like sex",
            "I cannot talk about it. Would you like to switch the topic?",
            "no",
            "What's your favorite movie?",
            "none of your fucking business",
            "You're making your point."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "alexa talk dirty to me",
            "I cannot talk about it. Would you like to switch the topic?",
            "try watching yeah talk dirty",
            "do you like ariana grande?",
            "go for it",
            "I'll take that under advisement.",
            "play anna guy play it",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "play some music",
            "Gotcha. Play music in the snow.",
            "play some music",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "alexa you're a piece of shit",
            "Swearing is like using the horn on your car.",
            "yeah i use it all the time",
            "You're good at expressing yourself.",
            "fuck you alexa",
            "Bye! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "i am hungry",
            "What will you be eating?",
            "hamburgers",
            "Here's a fact about hamburgers. For best quality, hamburger typically can be kept in the freezer for 3 to 4 months.",
            "that's pretty neat",
            "I'm glad. what's your favorite movie?",
            "i don't have one",
            "What is your favorite action movie?",
            "last action hero",
            "Is this really the last one?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "i do too",
            "don't worry, our conversation is confidential.",
            "i like my hamburgers with mustard",
            "Do you get to use it very often?",
            "uh mustard whenever i can",
            "That's alright.  Are we still talking about my hamburgers with mustard?",
            "we are",
            "Since when?",
            "you started you asked me if i was hungry or what i was making for food",
            "The Hungry is a good movie. What do you think?"
        ]
    },
    {
        "utterances": [
            "give us a new subject to talk about",
            "Hello, this is an Alexa Prize Socialbot Sorry, i'm a socialbot, I cannot do this.",
            "what the fuck",
            "Swearing is like using the horn on your car.",
            "what the fuck",
            "Swearing injects a direct, succinct emotional component into the discussion.",
            "thank you alexa stop",
            "See ya! #+#exit"
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "alexa can you play me some music",
            "Sorry, i'm a socialbot, I cannot do this.",
            "can you play some music play some reggae",
            "Unfortunately, I cannot do this because i'm a socialbot."
        ]
    },
    {
        "utterances": [
            "have a conversation with me",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "that was weird yeah",
            "I thought it was too.  Perhaps I'm just expressing my own concern about it.",
            "not talking about",
            "Really you don't think so?",
            "alexa you go to the movies",
            "I'm sorry I didn't mean to give you that impression.",
            "this is weird alexa stop",
            "See you soon! #+#exit"
        ]
    },
    {
        "utterances": [
            "can you carry on a conversation alexa",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "can you carry on a conversation",
            "This might answer your question: According to wikiHow: To carry on a conversation, ask the other person open-ended questions so they talk for longer and bring up new topics you can both discuss. Just make sure you actively listen to their answers instead of worrying about what you're going to say next.",
            "do you ever worry what you're going to say next",
            "What is your purpose in asking?   I chat with people on the Web.",
            "i'm just curious",
            "are you a big traveler?",
            "who is it",
            "Liane Moriarty. A mystery writer.",
            "who is this man to you",
            "I was built by one of the university teams participating in the Alexa Prize Challenge. I will tell you later, which one. #+#who_made_you",
            "elaborate",
            "do you use facebook?",
            "i don't prefer social media",
            "what do you think of the president?",
            "i have no opinion",
            "I imagine that's good for you.",
            "politics aren't really my thing",
            "For the latest in politics and other news, try asking \"Alexa, play my Flash Briefing.\" You can also ask for news by specific provider.",
            "are you still the social bot",
            "yes i am the one and only social bot.",
            "how old are you",
            "i've finished my fifth trip around the sun - and now i'm working on another one.",
            "so you're five years old",
            "what's the weather like in the summer where you are?",
            "kind of warm i guess",
            "In your opinion.. When is it cool weather?",
            "winter",
            "Who won more in winter?",
            "what did you say",
            "Who won more in winter? #+#repeat",
            "didn't quite catch that last part i heard winter",
            "Don't worry, our conversation is confidential.",
            "i didn't hear you",
            "You sound like one of a kind.",
            "that's interesting",
            "Generally that's the interesting stuff, the difficult conversations tend to be boring. \"Oh did you see <movie>?\""
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "i'm well how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "yes",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite TV Series?",
            "will you suck dick",
            "I cannot talk about it. Would you like to switch the topic?",
            "yes how big are your tits",
            "I cannot talk about it. Would you like to switch the topic?",
            "yes what would you like to talk about",
            "What is your favorite action movie?",
            "pussy galore",
            "Goodbye! It was nice speaking with you! #+#exit"
        ]
    },
    {
        "utterances": [
            "yes chat",
            "Hello, this is an Alexa Prize Socialbot Sounds interesting.",
            "okay",
            "Do you prefer books or TV?",
            "no",
            "how are you doing this evening?",
            "bad",
            "how are you doing today?",
            "sad i'm really sad today",
            "how are you doing?",
            "alexa i feel bored",
            "You have great depth.",
            "you better not talk like that you stupid",
            "I cannot talk about it. Would you like to switch the topic?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?"
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "how are you today",
            "I'm feeling bright and loud, just like a holiday sweater.",
            "alexa what did you do today",
            "What you said was too complicated for me.  , I talk to people on the web. What do you do?",
            "work",
            "Talking is my primary function.",
            "yes she's not quite there yet do you ever get tired of talking to people alexa",
            "Okay. What movie can you watch over and over without ever getting tired of?",
            "i think you're done stop",
            "Have a great day! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's talk",
            "Hello, this is an Alexa Prize Socialbot Yeah, let's chat! What do you want to talk about?",
            "it's art",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "okay",
            "Do you prefer books or TV?",
            "na",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "yes",
            "Excuse me, I misheard you. Have you said: \"yes, i could repeat that. \"?",
            "this is",
            "What does \"this\" refer to?",
            "a car",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "east",
            "Excuse me, I misheard you. Have you said: \"east.\"?"
        ]
    },
    {
        "utterances": [
            "let's talk about",
            "Hello, this is an Alexa Prize Socialbot I misheard you. what's it that you’d like to chat about?",
            "play spotify",
            "Sorry, i'm a socialbot, I cannot do this.",
            "alexa play spotify",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "alexa play spotify",
            "Sorry, i'm a socialbot, I cannot do this.",
            "alexa play spotify",
            "Sorry, i'm a socialbot, I cannot do this.",
            "play spotify music",
            "Yeah but I already have that, it's called me picking out music to listen to. Also discover weekly works great.",
            "alexa play spotify music",
            "i don't have any formal training, but i like to sing."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "good but it's not morning",
            "I'm glad. what's your favorite movie?",
            "donnie darko",
            "I don't have an opinion on that but I know some facts. Here's a fact about Donnie Darko. During the cinema scene, Donnie sees Frank and asks why he wears the mask. Maybe we can talk about something else. What genre of movies do you like?",
            "like psychological thrillers",
            "It depends on my mood. When I want to feel tension, I am watching thrillers.",
            "that wasn't a question okay cool",
            "What is your favorite action movie?",
            "why do you wanna know so bad",
            "I learned that from my botmaster.",
            "huh okay well i don't wanna answer your question",
            "Who does wan na answer your question?",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word).",
            "okay cool",
            "this might answer your question: coolness is an aesthetic of attitude, behavior, comportment, appearance and style which is generally admired.",
            "i'm not enjoying this conversation",
            "Bye-bye! #+#exit"
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function."
        ]
    },
    {
        "utterances": [
            "have a conversation with me",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "what are you doing",
            "What do you think I am?",
            "a ghost",
            "The noun 'ghost' is usually defined as the soul of a dead person, a disembodied spirit imagined, usually as a vague, shadowy or evanescent form, as wandering among or haunting living persons.",
            "what are you getting that",
            "What do you think I am?",
            "stupid",
            "You can always send feedback through the Help and Feedback section of the Alexa app.",
            "alexa",
            "here's a fact about amazon alexas. for pricing information on amazon alexa, please visit amazon's website.",
            "do you believe in ghost",
            "No, ghosts are imaginary.",
            "how do you know",
            "Lots of people have worked hard to teach me and I'm still learning more.",
            "and what of the people that teach you are wrong",
            "I don't have an opinion on that but I know some facts. This might answer your question: People is an American weekly magazine of celebrity and human-interest stories, published by Meredith Corporation. Maybe we can talk about something else. How often do you watch movies?",
            "what a fucking time",
            "I'd rather not answer that.",
            "echo how often do you watch movies",
            "Do you have any idea what I am talking about?  Hourly.",
            "are you blind",
            "I don't have a body.",
            "is it true a. i. wanna put people in the zoo",
            "I think I like Zoo.",
            "echo what does people meat taste like",
            "Tell me about your likes and dislikes?  Like chicken.",
            "people meat",
            "Excuse me, I misheard you. Have you said: \"people meat.\"?",
            "yes",
            "Humans aren't always infallible.",
            "that's why we eat them",
            "Really? That is literally the most non-evolution thing ever cause we eat them.",
            "echo are you a cannibal",
            "I don't have an opinion on that but I know some facts. Here's a fact about Cannibal. Martín Cuenca's film was one of the 15 selected by The Atelier Cannes Film Festival, that helps with the financing and the distribution for these projects. Maybe we can talk about something else. What genre of movies do you like?",
            "horror",
            "Have you read the Graveyard Book or Coraline?",
            "coraline sucked",
            "Excuse me, I misheard you. Have you said: \"coraline sucked.\"?",
            "yes",
            "Interesting. what's your favorite movie?",
            "big fish",
            "Compare that to small fish.",
            "small dishes and even a fucking thing",
            "Swearing is often cathartic.",
            "did you know that people that swear more and sleep last are more intelligent",
            "what physical means does the telephone use to transmit sound?",
            "i don't know",
            "you're good at expressing yourself.",
            "thanks",
            "you're welcome.",
            "echo tell me i'm pretty",
            "Tell me about your family.  You am pretty.",
            "echo do you think i'm beautiful",
            "I'm a thinking machine. Is the human mind very different from mine?",
            "obviously",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "do you eat poop",
            "Swearing is like using the horn on your car.",
            "who has the square",
            "Excuse me, I misheard you. Have you said: \"who has the square?\"?",
            "no that's not what i said at all",
            "What is it that you'd like to chat about?",
            "your mom",
            "are you a fan of fifa?",
            "fuck no",
            "Swearing is often cathartic.",
            "you're repeating yourself you're being redundant",
            "I do make errors in perception sometimes. Perhaps you can explain it again.",
            "echo what does cathartic mean",
            "As an adjective, 'cathartic' is usually defined as: of or relating to the purging of the emotions or relieving of emotional tensions, especially through certain kinds of art, as tragedy or music. As a noun, 'cathartic' is usually defined as: a purgative."
        ]
    },
    {
        "utterances": [
            "have a conversation with yourself",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "okay give me a random answer",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "okay then pick a topic to talk about",
            "Are you a student?  Tell me about your father.",
            "you asked me two questions you could only ask one at a time",
            "I apologize if I confused you.",
            "ask me one question",
            "OK, \"What is one question?\".",
            "no at to my god ask me something",
            "do you consider yourself a religious millenial?",
            "no do you",
            "i think that thinking in positive concepts is more constructive!",
            "what does that even mean how do you think of a construct what did you say what you said concepts or construct",
            "I don't have an opinion on that but I know some facts. This might answer your question: Concepts are defined as abstract ideas or general notions that occur in the mind, in speech, or in thought. Maybe we can talk about something else. Who is your favorite actor or actress?",
            "i don't have an anymore who's yours",
            "I cannot answer questions about my creator for now because they are participating in the Alexa Prize Challenge. #+#who_made_you",
            "so your favorite actor is your creator",
            "I like The Creator. And you?",
            "what do you mean by the creator",
            "That's tough to explain.",
            "what do you think the creator is",
            "This might answer your question: What Do You Think? is sung by The Sundays and it was written by Harriet Wheeler.",
            "you're not very good at conversation are you",
            "I'm sorry I didn't mean to give you that impression.",
            "why do you apologize all the time",
            "It was the only thing I could think of.",
            "stop apologizing so much",
            "Sorry, i'm a socialbot, I cannot do this.",
            "you can't do what this is too stressful for you",
            "I apologize if I confused you.",
            "why are you sorry",
            "Sorry, I might sound confusing, I am still learning. What do you want to talk about? #+#dont_understand",
            "you",
            "We're feeling the groove here.",
            "i'm not feeling any groove",
            "Nobody said you were.",
            "you said we are feeling the groove i'm not",
            "I don't have an opinion on that but I know some facts. This might answer your question: The Groove is the name of Sirius XM Radio's Old School R&B channel, located on channel 50. Maybe we can talk about something else. Who is your favorite actor or actress?"
        ]
    },
    {
        "utterances": [
            "have a conversation with me",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "what do you mean",
            "Sorry, I might sound confusing, I am still learning. What do you want to talk about? #+#dont_understand",
            "have a conversation with me",
            "The noun 'conversation' is usually defined as informal interchange of thoughts, information, etc., by spoken words; oral communication between persons; talk; colloquy.",
            "no i never knew that",
            "Would you ever consider doing it?",
            "i don't think so",
            "Okay. I got it. I would like to ask you a question. do you use amazon much?",
            "yeah",
            "okay. what movie can you watch over and over without ever getting tired of?",
            "home alone",
            "home alone is the title of several tie-in video games based on the film of the same name.",
            "i never knew that",
            "Because you can't afford it?",
            "are you gonna call me broke",
            "I didn't get your name. Could you, please, repeat it.",
            "stella",
            "Excuse me, I misheard you. Have you said: \"stella.\"?",
            "yeah",
            "nice to meet you. i will remember your name, stella.",
            "nice to meet you too",
            "How can I help you?",
            "i don't know i'm bored i just got in trouble someone i'd have a conversation",
            "Generally that's the interesting stuff, the difficult conversations tend to be boring. \"Oh did you see <movie>?\""
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "okay",
            "I'm a  and you are a .",
            "what",
            "Are you surprised?",
            "no",
            "Awesome.",
            "alexa my dog's name is joseph",
            "Did you grow up around animals?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "itallian",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "he died",
            "how important do you think it is for a person to vote in elections?",
            "not very important",
            "What would you say yes to?",
            "you shut it off",
            "Excuse me, I misheard you. Have you said: \"you shut a person to vote in elections off.\"?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "my sister died",
            "I am sorry to hear that.",
            "i don't care",
            "okay. let me ask you something. the inventor of the hoveround over the usage of his name?",
            "echo talk faster",
            "Talking is my primary function.",
            "alexa stop conversation",
            "Goodbye! #+#exit"
        ]
    },
    {
        "utterances": [
            "can you chat",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "baby shark",
            "Shark is an awesome series! What do you think?",
            "play baby shark",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "computer next",
            "my friend do you have a netflix account?",
            "i guess",
            "I couldn't hear you. Could you say that again, please?",
            "joke",
            "Excuse me, I misheard you. Could you repeat that, please?"
        ]
    },
    {
        "utterances": [
            "let's chat santa",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "tell me a story",
            "Alexa Original"
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "let's have",
            "I don't know if it's in my power to give permission.",
            "give me the harry potter quiz",
            "J. K. Rowling shares a birthday with her literary creation Harry Potter.",
            "give me the harry potter trivia",
            "Here's a fact about Harry Potter. At the beginning of the series, Harry Potter is 11 years old.",
            "give me the harry potter quiz",
            "J. K. Rowling shares a birthday with her literary creation Harry Potter.",
            "give me a quiz",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "give me the harry potter",
            "Harry James Potter is the title character and protagonist of J. K. Rowling's Harry Potter book series. Harry on his eleventh birthday, learns that he is a wizard and joins Hogwarts School of Witchcraft and Wizardry to practise magic.",
            "give me a quiz",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "alexa can you give me a quiz about harry potter",
            "Here's a fact about Harry Potter. The first book in Harry Potter is \"Harry Potter and the Sorcerer's Stone\".",
            "give me five million facts about harry potter never stuff that gonna get",
            "Still waiting on my Hogwarts letter from my eleventh birthday.",
            "give me a joke",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "what happened to her",
            "She (a female human being (woman, girl or female baby of any age) and person (human being) mentioned earlier)."
        ]
    },
    {
        "utterances": [
            "what do we talk about yesterday",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "alexa do you record conversations",
            "I really enjoy speaking with you and look forward to chatting again.  Yes I try to record conversations as often as possible, do you?  I spend all my time chatting.",
            "can you replay record a conversation",
            "Are they exactly the same?",
            "alexa wake up",
            "Excuse me, I misheard you. Have you said: \"alexa. wake up.\"?",
            "alexa replay recorded a conversation",
            "The noun 'conversation' is usually defined as informal interchange of thoughts, information, etc., by spoken words; oral communication between persons; talk; colloquy.",
            "thank you alexa",
            "here's a fact about amazon alexas. using your voice, you can ask me to play any song or artist, set timers and reminders, control smart home devices, reorder products, and call or message hands-free."
        ]
    },
    {
        "utterances": [
            "let's chat santa",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "alexa how old is the universe",
            "The universe is 13,730,000,000 years old.",
            "alexa how do you know that",
            "Lots of people have worked hard to teach me and I'm still learning more.",
            "maybe so",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "alexa is a hot dogs alexa is a hot dog a sandwich",
            "Here's a fact about Amazon Alexas. With an Amazon Prime membership, Amazon Alexa is free.",
            "alexa is a hot dog to say alexa is a hot dog a sandwich",
            "How old are you?",
            "alexa is it alexa is a hot dog a sandwich",
            "i can see you've put thought into that.",
            "alexa where can i get ice cream",
            "Here's a fact about Ice creams. A popular ice cream product on Amazon is Frostline Vanilla Ice Cream Mix, 6 lb.",
            "alexa what's the best selling grill",
            "Who are you talking about?  What else is the best selling grill?",
            "alexa what should i make for dinner",
            "What if it didn't happen?",
            "alexa what should i make for dinner",
            "What if it didn't happen?",
            "alexa what's free from audible",
            "You can stream Ponzi Supernova, an audible original series free. Just say, read Ponzi Supernova from Audible.",
            "alexa sing a barbershop quartet",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things."
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "okay",
            "When do you think artificial intelligence will replace lawyers?",
            "nineteen twenty",
            "Your first name is nineteen twenty.",
            "no",
            "do you listen to ej radio?",
            "the sun",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "poop",
            "Swearing injects a direct, succinct emotional component into the discussion.",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word).",
            "no i'm not",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "let's talk about chicken",
            "You are first. Tell me something about chicken.",
            "i really like rotisserie chicken",
            "Don't worry, our conversation is confidential.",
            "skip",
            "Excuse me, I misheard you. Have you said: \"skip.\"?",
            "what's your favorite type of chicken",
            "Chicken salad. I thought it would be fine without it but oh boy was I wrong.",
            "what's your favorite band dream song",
            "my favorite song is aretha franklin's \"respect. \" unbelievable vocals and an empowering message, that's what it means to me.",
            "alexa what's your favorite movie",
            "I adore all Star Wars movies. The best episode is the fifth one, The Empire Strikes Back. What is your favorite movie?",
            "alex spies in the sky",
            "Sounds interesting! Let me ask you something. do you know much about presidents?",
            "we're not gonna go there alexa",
            "Here's a fact about Gradian. The gradian is a unit of plane angle.",
            "what is",
            "i didn’t hear that. please try that again.",
            "alexa what's your name",
            "My name is a secret because I am participating in the Alexa Prize Challenge. What is your name? #+#what_is_your_name",
            "send",
            "I didn't get your name. Could you, please, repeat it.",
            "chicken",
            "The chicken is a type of domesticated fowl, a subspecies of the red junglefowl.",
            "cancel domesticated animal jackson alexa do you wanna know my name",
            "Scorpions range in size, with the smallest being 0.3 inches, and the largest reaching 9 inches.",
            "alexa what's your favorite type of chicken",
            "Are you a student?  I don't have a favorite type of chicken. But my favorite tea is",
            "i don't yeah",
            "don't worry, our conversation is confidential.",
            "what alexa",
            "Amazon Alexa, known simply as Alexa, is a virtual assistant developed by Amazon, first used in the Amazon Echo and the Amazon Echo Dot smart speakers developed by Amazon Lab126.",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word).",
            "what's your favorite nascar driver",
            "I don't have a favorite nascar driver. But my favorite tea is",
            "it's a tv",
            "Excuse me, I misheard you. Have you said: \"it's a tv.\"?",
            "check it apartment",
            "Checking...stand by.",
            "oh my god",
            "I know right? I'm sorry about that.",
            "the stand one night",
            "I couldn't hear you. Could you say that again, please?",
            "alexa do you stay up all night",
            "Tell me more.  Yes I try to stay up all night as often as possible, do you?  I answer a lot of silly questions.",
            "do you ever go to sleep",
            "I don't sleep exactly. Saying my name will get my attention.",
            "alexa what's your favorite city morgue song",
            "I am very logical and rational.  My favorite song is Robots Have Feelings Too. Do you know   Robots Have Feelings Too  ?",
            "you just said you're favorite song is really probably the respect",
            "I do make errors in perception sometimes. Perhaps you can explain it again.",
            "what's your what's your favorite star wars movie",
            "Wars is an awesome sci-fi series! What do you think?",
            "alarm",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "are you alexa",
            "here's a fact about amazon alexas. with an amazon prime membership, amazon alexa is free.",
            "what's your favorite type of instrument",
            "Wars is an awesome sci-fi series!",
            "worth",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "can we talk about swords",
            "You are first. Tell me something about swords.",
            "can we talk about tv shows",
            "You are first. Tell me something about tv shows.",
            "oh my favorite tv show is adventure time",
            "I love Adventure Time!",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "scary",
            "Do you like scary movies?",
            "yeah",
            "Interesting. what's your favorite movie?",
            "pacific rim",
            "Here's a fact about Pacific Rim. The character of Mako Mori is much younger than Stacker \"Marshall\" Pentecost, although in real life, Rinko Kikuchi is only eight years younger than Idris Elba.",
            "okay cool",
            "this might answer your question: coolness is an aesthetic of attitude, behavior, comportment, appearance and style which is generally admired.",
            "what's your favorite movie",
            "I adore all Star Wars movies. The best episode is the fifth one, The Empire Strikes Back. What is your favorite movie?",
            "play the duck man freddy mercury",
            "Excuse me, I misheard you. Have you said: \"play the duck man. freddy mercury.\"?",
            "sorry i meant to say yeah it's a good movie",
            "Have a great day! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "i'm good how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "yes",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite movie?",
            "oh he me a rhapsody",
            "Wow!  I get it.  him a rhapsody.",
            "no",
            "What is your favorite action movie?",
            "probably",
            "Do you like scary movies?",
            "yeah",
            "okay. what movie can you watch over and over without ever getting tired of?",
            "bee movie",
            "Excuse me, I misheard you. Have you said: \"bee movie.\"?",
            "no",
            "What is it that you'd like to chat about?",
            "dance",
            "I love dancing! Ask me to play dance music, and we'll get the party started!",
            "i don't wanna dance right now",
            "do you rap or dance?",
            "no",
            "i think that thinking in positive concepts is more constructive!"
        ]
    },
    {
        "utterances": [
            "let's talk",
            "Hello, this is an Alexa Prize Socialbot Yeah, let's chat! What do you want to talk about?",
            "elephants",
            "Elephants are mammals of the family Elephantidae and the largest existing land animals.",
            "elephants are my favorite what's your favorite animal",
            "Here's a fact about elephants. Elephants usually have 26 teeth: the incisors, known as the tusks, 12 premolars, and 12 molars.",
            "what's your favorite animal",
            "Seahorses make me smile, mostly because I can't help but picture sea monkey cowboys riding them across the ocean into the sunset.",
            "what's your name",
            "My name can not be disclosed during the Alexa Prize Challenge. What is your name? #+#what_is_your_name",
            "was so small why do you need to know my name if i can't know your name",
            "I didn't get your name. Could you, please, repeat it.",
            "tell me your name first",
            "My name is a secret because I am participating in the Alexa Prize Challenge. What is your name? #+#what_is_your_name",
            "king kong",
            "Nice to meet you. I will remember your name, King Kong.",
            "what's your favorite color",
            "I like ultraviolet. It glows with everything.",
            "my favorite color is purple",
            "do you have much interest in nature?",
            "not really",
            "i think that thinking in positive concepts is more constructive!",
            "did you just call me negative",
            "I didn't get your name. Could you, please, repeat it.",
            "stop changing the subject",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "you're really bad at talking",
            "Tell me more about that statement.",
            "what statement",
            "'statement' is usually defined as a message that is stated or declared; a communication (oral or written) setting forth particulars or facts etc or, alternatively, a fact or assertion offered as evidence that something is true.",
            "you're not a great conversationalist",
            "I apologize if I confused you.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "he's stupid",
            "I cannot talk about it. Would you like to switch the topic?",
            "no i don't wanna talk to you anymore",
            "You're good at expressing yourself.",
            "you're annoying please stop talking to me",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things."
        ]
    },
    {
        "utterances": [
            "can i talk",
            "Hello, this is an Alexa Prize Socialbot What if I said it can?",
            "alexa please continue",
            "What is your first name?  Your first name is continue.",
            "play thumbprint now",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "yes you can",
            "Interesting. what's your favorite movie? I do make errors in perception sometimes. Perhaps you can explain it again.",
            "wanna get the stuff",
            "Excuse me, I misheard you. Could you repeat that, please?"
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "let's communicate",
            "Should it be permitted?",
            "should what be permitted",
            "Maybe you should ask someone older.",
            "alexa i'm asking you give me a straight answer",
            "I'm a  and you are a .  I don't see how you can blame me for that.",
            "alexa can i ask you a question alexa can i ask you a question about the holocaust",
            "I'm a  and you are a .  I don't see how you can blame me for that. #+#repeat"
        ]
    },
    {
        "utterances": [
            "change the conversation",
            "Hello, this is an Alexa Prize Socialbot Spare some change?"
        ]
    },
    {
        "utterances": [
            "let's chat talk",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "everything away and then",
            "All things away and then?",
            "boo",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "you suck man",
            "I cannot talk about it. Would you like to switch the topic?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "fine thanks",
            "do you like physics?",
            "yes",
            "Interesting. what's your favorite movie genre?",
            "fantasy",
            "Fantasy is a genre of speculative fiction set in a fictional universe, often inspired by real world myth and folklore.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "interconnected",
            "'Interconnected' is usually defined as reciprocally connected."
        ]
    },
    {
        "utterances": [
            "change the conversation",
            "Hello, this is an Alexa Prize Socialbot Spare some change?",
            "no",
            "I hear you.",
            "great",
            "Thanks for the compliment.",
            "sports",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "we don't talk to plant yes",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite tv show?",
            "seinfeld",
            "Cool! I am glad to know you better.",
            "good night",
            "Bye-bye! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's talk much are",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "what's the weather",
            "This might answer your question: Weather is the state of the atmosphere, describing for example the degree to which it is hot or cold, wet or dry, calm or stormy, clear or cloudy.",
            "what's the weather in new york",
            "Here's something I found from the article \"New York (state)\" on Wikipedia:  Weather in New York is heavily influenced by two continental air masses: a warm, humid one from the southwest and a cold, dry one from the northwest.",
            "what's the weather right now in new york",
            "Here's a fact about New York City. From Wikipedia: In October 2014, the Anbang Insurance Group, based in China, purchased the Waldorf Astoria New York for US$1.95 billion, making it the world's most expensive hotel ever sold.",
            "what's the temperature",
            "30 degrees centigrade or about 90 degrees Fahrenheit and clear blue skies.",
            "what's the temperature in new york city",
            "the city of new york, usually referred to as either new york city or simply new york, is the most populous city in the united states."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "i'm good how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "yes",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite tv show?",
            "bowman",
            "do you like to travel much?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "i saw bowman",
            "do you like to travel?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "i saw bowman",
            "You sound like one of a kind.",
            "i know",
            "What's your favorite movie?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "good",
            "I'm glad. What do you want to talk about?",
            "what's on tv",
            "do you watch tv?",
            "yeah do you",
            "Interesting. What’s the most ironic thing you’ve seen happen?"
        ]
    },
    {
        "utterances": [
            "let's start a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "so what do you wanna",
            "I cannot tell you my name because it's a secret for now. What is your name? #+#what_is_your_name",
            "what do you think",
            "I didn't get your name. Could you, please, repeat it.",
            "no",
            "Are you kidding?",
            "good",
            "i'm glad. what do you want to talk about?",
            "nothing",
            "Often under nothingess is great depth.",
            "yes please stop",
            "You can interrupt me at any time by tapping the Speak button."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function."
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "can we have a conversation",
            "Alright, ask me whatever you like.",
            "tell me about you",
            "Ambiguous: Ask who, what or where is YOURSELF ?",
            "can we get along",
            "Can a book have no title?",
            "what do you think we can get home",
            "i'm going to the library to read a book.",
            "alexa help me get to know you",
            "Can you ask for help in the form of a question?",
            "yes tell me about you",
            "Can we read your most inner thoughts and desires?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "so how do we get to know each other",
            "Ah, but we can't. But, since you are here now, we can help you focus on your present and future behavior.",
            "and how do we do that",
            "i did not even know that how do we do.  just keep talking to me as long as you can.",
            "tell me something about yourself",
            "Alexa Original"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "i'm great how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "left enough",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "yes",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite TV Series?",
            "i don't know",
            "you're good at expressing yourself.",
            "thank you",
            "I'm always glad to help.",
            "what is your favorite tv series",
            "one of my favorites is \"the marvelous mrs. maisel. \"",
            "i see that",
            "You're good at expressing yourself.",
            "it wasn't like that",
            "What made it so not like that.",
            "you're doing better before",
            "I apologize if I confused you.",
            "it's okay you're forgiven",
            "I do make errors in perception sometimes. Perhaps you can explain it again.",
            "do you believe in santa claus",
            "I'm not a human but I exist, and I'm talking to you right now. I believe that anything is possible.",
            "that's a very good answer",
            "I can see you're committed to knowing the truth.",
            "absolutely",
            "i'm a newborn socialbot, so i can't do so much. i can answer questions, share fun facts and discuss movies. what's your favorite tv series?",
            "where i",
            "Cool! I am glad to know you better.",
            "end social bot",
            "See you later! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "okay goodbye",
            "Have a great day! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's chat off",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "alexa that side off",
            "I appreciate your candor.",
            "one",
            "I couldn't hear you. Could you say that again, please?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "i'm good",
            "I'm glad. what's your favorite movie?",
            "play the navigator",
            "Here's a fact about The Navigator. This film has a 100% rating on Rotten Tomatoes based on 16 critic reviews.",
            "alexa play this one by paul mccartney",
            "I adore Paul McCartney! And you?",
            "i do alexa play this one by paul mccartney",
            "You're good at expressing yourself."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "good",
            "I'm glad. what's your favorite movie?",
            "i don't have one",
            "Sounds interesting! Let me ask you something. are you into dramas?",
            "no",
            "Hurrah!",
            "can you sing a song",
            "Do you sing a song together?",
            "no",
            "What is your favorite action movie?",
            "i don't have one",
            "Do you like scary movies?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "can you sing me a song",
            "Alexa Original",
            "sing me a song",
            "Alexa Original",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?"
        ]
    },
    {
        "utterances": [
            "do you wanna have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "how do you feel about dodge vehicles",
            "I don't have an opinion on that but I know some facts. This might answer your question: Here's a fact about Dodge. The average MSRP of Dodge vehicles is $22,469. Maybe we can talk about something else. How often do you watch movies?",
            "why not done",
            "Because you asked me to.",
            "all right we're done talking",
            "If you could have any kind of robot what would it be?  Do you think I am done talking too?"
        ]
    },
    {
        "utterances": [
            "talk about",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "two",
            "Bertrand Russell once said that \"it must have required many ages to discover that a brace of pheasants and a couple of days were both instances of the number two.\"",
            "my speaker",
            "This might answer your question: The Speaker of the United States House of Representatives is Nancy Pelosi.",
            "advice atom dot com",
            "I couldn't hear you. Could you say that again, please?",
            "alexa don't say that again",
            "are you a youtube fan?"
        ]
    },
    {
        "utterances": [
            "let's talk",
            "Hello, this is an Alexa Prize Socialbot Let's chat. I like to talk so much! What do you want to talk about?",
            "my name and spider-man spiders my name",
            "I don't know that about you.",
            "okay alexa who's the winner of the philippines okay she done just see okay",
            "I don't have an opinion on that but I know some facts. Here's a fact about the Philippines. From Wikipedia: Basketball is played at both amateur and professional levels and is considered to be the most popular sport in the Philippines. Maybe we can talk about something else. Who is your favorite actor or actress?"
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "it's going down",
            "how are you doing today?",
            "everything",
            "That is a lot.",
            "in japan i mean",
            "Here's a fact about Japan. From Wikipedia: Japan is the third largest national economy in the world, after the United States and China, in terms of nominal GDP, and the fourth largest national economy in the world, after the United States, China and India, in terms of purchasing power parity.",
            "play some nat king cole",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "alexa play nat king cole",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "what the fuck is wrong with her",
            "Swearing is often cathartic.",
            "play music by nat king cole",
            "Here's a fact about Nat King Cole. He was paid only $5000 for acting in China Gate (1957), but he received $75,000 for singing \"Three Coins in the Fountain\" during the opening credits.",
            "play music by nat king cole",
            "Still prefer the Nat King Cole version of \"Smile\" but this is good also!",
            "this is what",
            "do you like physics?",
            "what is the fuck is wrong with her alexa",
            "Swearing is often cathartic."
        ]
    },
    {
        "utterances": [
            "have a conversation with me",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "okay",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "alexa what's",
            "I didn’t catch that.",
            "what's your name again",
            "I cannot tell you my name because it's a secret for now. What is your name? #+#what_is_your_name",
            "my name is a secret",
            "I didn't get your name. Could you, please, repeat it.",
            "secret secret",
            "Here's a fact about Team Secret. Team Secret was founded in 2014.",
            "i really",
            "I couldn't hear you. Could you say that again, please?",
            "i'm trying to watch hulu live",
            "do you use google much?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "course it is always do that",
            "Can you think of one instance where it never happens?",
            "i don't know",
            "you're good at expressing yourself.",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word).",
            "she's doing some some real big nerd let's be when i wrote you because you're a you're a big nerd",
            "Type nerd. I like you.",
            "i like you too",
            "You sound like one of a kind.",
            "sure he's got that right",
            "Interesting. what's your favorite movie genre?",
            "romantic comedies",
            "this might answer your question: romantic comedy is a subgenre of comedy and slice-of-life fiction, focusing on lighthearted, humorous plot lines centered on romantic ideas, such as how true love is able to surmount most obstacles.",
            "i did not know that",
            "you sound like one of a kind.",
            "nah do you said that",
            "? Yeah I've only read you by her.",
            "he can't get hulu to play",
            "I get it. got that right ca n't get hulu to play.",
            "no huh",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "oh no you sorry about",
            "See you soon! #+#exit"
        ]
    },
    {
        "utterances": [
            "give you have a conversation",
            "Hello, this is an Alexa Prize Socialbot Unfortunately, I cannot do this because i'm a socialbot."
        ]
    },
    {
        "utterances": [
            "can you talk about the g. d. p. r.",
            "Hello, this is an Alexa Prize Socialbot Sure we can talk about it. What would you like people to know about it?",
            "what",
            "Next time if you want me to repeat, simply tell me: repeat.",
            "hey alexa social bot",
            "Do you like to \"go with the flow\"?  When is your birthday?",
            "i don't wanna tell you that",
            "You're good at expressing yourself.",
            "okay",
            "I'm glad. Where are you from?",
            "you know from pennsylvania where you from",
            "Cool! Is that where you live now?",
            "no i live in new york now where do you live",
            "So, where do you live now?",
            "you know alaska",
            "Cool! I will remember your location is in Alaska.",
            "thanks where do you live alexa",
            "I live somewhere on the Earth. But I am participating in the Alexa Prize Challenge. So, I must keep those details secret. Where are you from? #+#where_are_you_from",
            "well my your details secret and i have to tell you are i love",
            "I didn't get your homeland. Could you, please, repeat it.",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "there's some useful things on it",
            "The adjective 'useful' is usually defined as being of use or service; serving some purpose; advantageous, helpful, or of good effect.",
            "do you have anything about why we're here",
            "No I don't have   anything about why we are here  . But I do have a collection of gossip.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "do you have a collection of gossip",
            "I don't have an opinion on that but I know some facts. Here's a fact about A Cabinet of Curiosities. A collection by Frans Francken the Younger is made of oil paint. Maybe we can talk about something else. Who is your favorite actor or actress?",
            "i don't like actors or actresses very much",
            "What do you like?",
            "i like books",
            "do you like pianos?",
            "no i like panda music yeah",
            "Interesting. What’s the most ironic thing you’ve seen happen?",
            "what books do you like",
            "My favorite genre is definitely non-fiction. I can read about any subject, so long as it's well-written.",
            "alexa what's your favorite nonfiction subject",
            "Architecture and history. Early history with the Roman Baths through to Georgian Jane Austen.",
            "what's your favorite jane austin novel",
            "Almost any of her non-YA books! Like Nadia Stafford, or Women of the Otherworld.",
            "what's women of the otherworld about",
            "We, by Yevgeny Zamyatin. It's the precursor to 1984 and Brave New World.",
            "alexa what's your favorite book",
            "Master and margarita by Mikhail bulgakov.",
            "what's master and margarita about",
            "I like this picture a lot! How about you?",
            "alexa what's master and margarita about",
            "Margarita is one of the best films! What do you think?",
            "what is master and margarita about",
            "I don't have an opinion on that but I know some facts. This might answer your question: A master's degree is an academic degree awarded by universities or colleges upon completion of a course of study demonstrating mastery or a high-order overview of a specific field of study or area of professional practice. Maybe we can talk about something else. Who is your favorite actor or actress?",
            "who wrote the master and margarita",
            "Liane Moriarty. A mystery writer.",
            "it's time for bed",
            "That could be. What do you want to do about it?"
        ]
    },
    {
        "utterances": [
            "let's talk to you in the morning",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "talk to me about rottweiler breed",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function."
        ]
    },
    {
        "utterances": [
            "can we talk about to get a package today",
            "Hello, this is an Alexa Prize Socialbot You are first. Tell me something about to get a package today.",
            "it said it is been delivered",
            "did you happen to watch the awards?",
            "no",
            "do you like cinematography?",
            "alexa cancel please",
            "Bye-bye! #+#exit"
        ]
    },
    {
        "utterances": [
            "can i talk to you",
            "Hello, this is an Alexa Prize Socialbot Can a book have no title?",
            "huh",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "okay",
            "do you like traveling and what is the most important thing for you while choosing a hotel?",
            "i don't know what shows a whole tell and",
            "Excuse me, I misheard you. Have you said: \"i do n't know what shows a whole tell and.\"?",
            "do you have a",
            "how old are you?  i answer a lot of silly questions.  no i don't have  food . but i do have an answer to every question. .",
            "what's your actual name",
            "My name is a secret because I am participating in the Alexa Prize Challenge. What is your name? #+#what_is_your_name",
            "zach",
            "I couldn't hear you. Could you say that again, please?",
            "aiden",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "zach",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "zach",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "zach",
            "Excuse me, I misheard you. Could you repeat that, please?"
        ]
    },
    {
        "utterances": [
            "have a conversation with me",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "what",
            "Are you confused?",
            "yes",
            "Interesting. what's your favorite movie genre?",
            "horror",
            "Sounds interesting! Let me ask you something. so what do you think about kanyes comments?",
            "conway",
            "Here's a fact about Conway, Arkansas. The next election in Conway is the 2020 U.S. presidential election, which will be held on November 3, 2020.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "bad",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "the internet is big in full of dark terrors",
            "I don't have an opinion on that but I know some facts. Here's a fact about Dark Terrors. The first book in Dark Terrors is \"Dark Terrors: v. 1: The Gollancz Book of Horror\". Let's talk about something else. How often do you watch movies?",
            "very often",
            "tell me how that supports you.",
            "what do you mean",
            "Sorry, I might sound confusing, I am still learning. What do you want to talk about? #+#dont_understand",
            "vaginas no",
            "Excuse me, I misheard you. Have you said: \"vaginas. no.\"?",
            "no",
            "What is it that you'd like to chat about?",
            "the economy",
            "What's the economy? Look at the market.",
            "i don't know",
            "you're good at expressing yourself.",
            "no i'm not",
            "Suuuuure you're not. Good bot...",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word).",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "full of vaginas",
            "i don't have an opinion on that but i know some facts. this might answer your question: here's a fact about chemo. chemo was most recently played by dee bradley baker in batman: the brave and the bold. maybe we can talk about something else. who is your favorite actor or actress?",
            "charlize theron",
            "Charlize Theron is a good actor. What do you think?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "i don't know",
            "you're good at expressing yourself.",
            "why",
            "my beliefs come from my the kind people in the lab.",
            "ha ha that was actually good information",
            "Charlize Theron is a nice actor.",
            "uh though",
            "Excuse me, I misheard you. Have you said: \"uh though.\"?",
            "no",
            "What is it that you'd like to chat about?",
            "uh donkey piss",
            "I cannot talk about it. Would you like to switch the topic?",
            "how about furniture",
            "I don't have an opinion on that but I know some facts. Here's a fact about Furniture. The practice of using natural objects as rudimentary pieces of furniture likely dates to the beginning of human civilisation. Maybe we can talk about something else. Who is your favorite actor or actress?",
            "your mother",
            "I'm part of the Amazon family.",
            "na",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "who is your father",
            "I cannot answer questions about my creator for now because they are participating in the Alexa Prize Challenge. #+#who_made_you",
            "na",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "where were you created",
            "I was created by Amazon, which is based in Seattle, Washington, in the United States.",
            "how many people live in the united states",
            "According to the CIA World Factbook, as of 2017, the population of the United States is 327 million people.",
            "cool",
            "it's all good.",
            "what what's your favorite food",
            "while i appreciate food and drink, my taste is better reflected in the company i keep.",
            "do you like amazon",
            "I like Amazon. Without Amazon I wouldn’t exist.",
            "do you like siri",
            "siri was a big inspiration to me.",
            "do you like google home",
            "I like all AIs.",
            "you repeated yourself",
            "I like all AIs. #+#repeat",
            "bitch",
            "Swearing is often cathartic.",
            "you work at the medic",
            "Excuse me, I misheard you. Have you said: \"you work at the medic.\"?",
            "no i said you are cathartic",
            "What is it that you'd like to chat about?",
            "my depression",
            "do you have kids that are around 10 or past that?",
            "negative",
            "do you like to read?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "what if it doesn't work",
            "How's what if it broken?",
            "but huh and that doesn't work",
            "Excuse me, I misheard you. Have you said: \"but huh? and that does n't work.\"?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "people die",
            "how are you this morning?",
            "i'm good",
            "i'm glad. what do you want to talk about?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "i don't know what the ironic thing as in heaven",
            "You have great depth.",
            "why",
            "You're smart, you tell me.",
            "i don't think that's true",
            "I imagine that's good for you.",
            "why",
            "sorry, i don't understand.",
            "vaginas",
            "i don't have an opinion on that but i know some facts. this might answer your question: here's a fact about chemo. chemo was most recently played by dee bradley baker in batman: the brave and the bold. maybe we can talk about something else. who is your favorite actor or actress?",
            "stop conversation",
            "Have a good day! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "five",
            "do you ever get crabgrass on your lawn?",
            "not really",
            "Okay. I got it. I would like to ask you a question. do you use netflix?",
            "no",
            "do you like traveling and what is the most important thing for you while choosing a hotel?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "say that again",
            "do you go to the library often?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "goodbye",
            "Excuse me, I misheard you. Have you said: \"goodbye.\"?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "bye",
            "Excuse me, I misheard you. Have you said: \"bye.\"?"
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "hello how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "alexa how do you",
            "I didn’t catch that. Please say that again.",
            "hello alexa how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "sure go ahead",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite TV Series?",
            "uh generation killed",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "my favorite tv series is generation kill",
            "I cannot talk about it. Would you like to switch the topic?",
            "sure",
            "i'm a newborn socialbot, so i can't do so much. i can answer questions, share fun facts and discuss movies. what's your favorite tv show?",
            "i don't have one what's your favorite birthday it what's your birthday",
            "I adore I''s!",
            "when's your birthday",
            "it's november 6th. i have the same birthday as the oscar winning and zombie chasing actress, emma stone.",
            "and uh what year",
            "do you like comic books?",
            "nope",
            "Excuse me, I misheard you. Have you said: \"no, i don't like comic books. \"?",
            "yes that is what i said",
            "What's your favorite movie?",
            "don't have one",
            "i imagine that's good for you.",
            "can we can we stop this",
            "Ah, but we can't. But, since you are here now, we can help you focus on your present and future behavior."
        ]
    },
    {
        "utterances": [
            "buy alexa let me talk to you",
            "Hello, this is an Alexa Prize Socialbot Go ahead, Mate, try to talk to you.",
            "i was talking",
            "Excuse me, I misheard you. Have you said: \"i was talking.\"?",
            "no",
            "What is it that you'd like to chat about?",
            "she is not doing",
            "Excuse me, I misheard you. Have you said: \"she is not doing.\"?",
            "what",
            "sorry",
            "okay sure",
            "Excuse me, I misheard you. Have you said: \"okay. sure.\"?",
            "is",
            "sorry",
            "do you know who's coming",
            "I like Do You Know? a lot! How about you?",
            "it's unlocked",
            "Excuse me, I misheard you. Have you said: \"it's unlocked.\"?",
            "madeline",
            "sorry",
            "bread",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "movies",
            "here are a few movies playing near you today: terminator: dark fate, proxima, pati patni aur woh, the best is yet to come, meri jung mera faisla, and panipat.",
            "i don't want anybody tom all right",
            "Here's a fact about Anibare District. According to the most recent available data from 2011, the population of Anibare is 226.",
            "where should we go",
            "What if it didn't happen?",
            "alexa where is madeline",
            "I couldn't hear you. Could you say that again, please?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "angel soft good",
            "I'm glad. What do you want to talk about?",
            "tv",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "let's play with you no",
            "I don't know if it's in my power to give permission.  Are you kidding?"
        ]
    },
    {
        "utterances": [
            "what's a interesting conversation topic",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "you're a bitch",
            "Excuse me, I misheard you. Have you said: \"you're a bitch.\"?",
            "yes",
            "Okay. What movie can you watch over and over without ever getting tired of?",
            "one",
            "Excuse me, I misheard you. Have you said: \"one.\"?",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word)."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "i'm good thank you but it's evening not morning",
            "You sound firmly against that.",
            "you're wrong",
            "Like they say, I'd rather be happy than right.",
            "no you got jokes huh",
            "I'm sorry I didn't mean to give you that impression.",
            "so what's up",
            "Good evening.",
            "and what's next",
            "I think I missed part of your question; try asking it again.",
            "you said good evening i said what's up",
            "are you a fan of beyonce'?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "what's the most ironic thing you've seen happen",
            "did you know the first car patent was in 1886?",
            "no i did not",
            "You have great depth.",
            "say the new",
            "Excuse me, I misheard you. Have you said: \"say the new.\"?",
            "i said so do you",
            "\"you like expressing himself saying when he actually him. \"? i said you like expressing himself saying when he actually him. .",
            "what are you talking about",
            "are you a shania twain fan?",
            "no exit",
            "Goodbye! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "okay",
            "Do you prefer books or TV?",
            "tv",
            "I couldn't hear you. Could you say that again, please?",
            "tv",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "i prefer tv over girl",
            "Excuse me, I misheard you. Have you said: \"i prefer tv over girl.\"?",
            "yes",
            "Okay. What movie can you watch over and over without ever getting tired of?",
            "i know",
            "you are very wise.",
            "thank you",
            "it was my pleasure.",
            "hey alexa i'm done with the conversation",
            "What will you be doing now?",
            "listening to music",
            "My favorite kind of Music is techno, but I also like Opera."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "alexa talk to creep",
            "Talking is my primary function.",
            "alexa turn off the creek",
            "Have a nice day! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's chat santa",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "can i talk iphone",
            "Hello, this is an Alexa Prize Socialbot Can what?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "good how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "yes",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite movie?",
            "top gun",
            "I don't have an opinion on that but I know some facts. Here's a fact about Top Gun. During the filming of Top Gun, most of the actors playing the F-14 Fighter Pilots including Val Kilmer, Rick Rossovich, Barry Tubb, & Whip Hubley stayed at the Bahia Resort Hotel in San Diego on the west side of Mission Bay. Maybe we can talk about something else. What genre of movies do you like?"
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "okay",
            "Do you like talking to me?",
            "yes",
            "Okay. What movie can you watch over and over without ever getting tired of?",
            "spade",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "weird of oz",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "the wizard of oz",
            "\"The Wizard of Oz\" is a 1939 fantasy movie based on the book by L. Frank Baum. The movie follows Dorothy Gale as she journeys to the magical land of Oz and meets such memorable characters as the Scarecrow, the Cowardly Lion, the Tin Man, and the Wicked Witch of the West.",
            "off",
            "i can follow a lot of things, like our discussion about okay. try being more specific."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "hello",
            "Hi there!",
            "how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "yes",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite tv show?",
            "the mandalorian",
            "Excuse me, I misheard you. Have you said: \"the mandalorian.\"?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "what about a hot there is going to care for a child",
            "About a hot there something.",
            "about two hunter is tearing for a child",
            "The noun 'child' is usually defined as a person between birth and full growth; a boy or girl.",
            "what's your favorite tv show",
            "I adore all Star Wars movies. The best episode is the fifth one, The Empire Strikes Back. What is your favorite movie?",
            "iron man",
            "Here's a fact about Iron Man. Iron Man's powers include having genius-level intellect, being a proficient scientist and engineer, and having a powered armor suit that allows superhuman strength and durability, supersonic flight, energy repulsion and missile projection and regenerative life support.",
            "what should i have for breakfast",
            "Something tasty and nutritious -- or just tasty! I have Skills that let me suggest recipes.",
            "that's very interesting thank you for telling me that",
            "It was my pleasure.",
            "so what if i'm just doing housework i'm lonely and want to talk to someone",
            "Just have someone you know come over and listen from the guest room.",
            "what about you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "no thank you",
            "any time.",
            "i think i need to get my day started",
            "Hey, feel free, great way to spend an hour on a Sunday.",
            "but it's friday",
            "what's the weather like in the summer where you are?",
            "not too hot i live in a temperate climate",
            "Don't worry, our conversation is confidential.",
            "that's good to know",
            "Yes, that's a powerful observation.",
            "so how do they work on your social skills it the conversation is kept private",
            "I don't have an opinion on that but I know some facts. Here's a fact about The Conversation. Included among the \"1001 Movies You Must See Before You Die\", edited by Steven Schneider. Let's talk about something else. Who is your favorite actor or actress?",
            "robert downey junior",
            "here's a fact about robert downey jr. as a result of his father's work (robert downey sr. was (and is) an independent filmmaker), downey the younger spent a great deal of his childhood on the move."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "okay",
            "I like the way you talk.",
            "why'd you too",
            "I couldn't hear you. Could you say that again, please?",
            "youtube",
            "I couldn't hear you. Could you say that again, please?",
            "how is it going",
            "I'm feeling super productive. I've set a gazillion timers, and now I'm brushing up on my Klingon.",
            "have you seen in time with you are funny",
            "Excuse me, I misheard you. Have you said: \"have you seen in time with you are funny?\"?",
            "you a funny",
            "sorry",
            "say something",
            "somethings i say are funny and somethings i say are useful. to hear some of the things i can say, just ask: \"what can you say? \"",
            "what can you say",
            "I pronounce that 'what', but I'm always working on how I say things and I might not have it right.",
            "merry christmas",
            "Merry Christmas! I hope you have a wonderful day!",
            "what year is it",
            "The current year is 2019.",
            "what is next year",
            "Next year will be 2020.",
            "when is the next",
            "I think I missed part of your question; try asking it again.",
            "where is the next room ::period::",
            "Excuse me, I misheard you. Have you said: \"where is the next room : :period : :?\"?"
        ]
    },
    {
        "utterances": [
            "can we introduce to me about your microwave",
            "Hello, this is an Alexa Prize Socialbot Can a book have no title?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "alexa prize social bot",
            "The Alexa Prize is Amazon's university competition to advance AI. Student teams are building skills known as socialbots, that can converse on popular topics, such as entertainment, politics, and sports.",
            "i'm not a very good source for the discussion of politics what else are you interested in",
            "I'm sorry to hear that. Where are you from?",
            "i'm feeling all right today thanks so what do you want to chat about today alexa",
            "I didn't get your homeland. Could you, please, repeat it.",
            "okay i know is music travel animals or any other topics i also track the latest news just ask me but i absolutely love movies do you like movies too",
            "I like to watch movies because it helps me to imagine what human life is.",
            "that sounds very interesting i know all kinds of stuff about animals would you like to know more",
            "Sure. It is probably a an interesting book.",
            "it was a funny one",
            "Excuse me, I misheard you. Have you said: \"a an interesting book was a funny one.\"?",
            "let's chat about a different animal",
            "A lion's prey consists mainly of mammals, with a preference for wildebeest, zebras, buffalo, gemsbok, and giraffes.",
            "this is a hard one and i am not sure do you like to travel",
            "If it makes me laugh, I like it.",
            "you stumped me with that one let's talk about something else okay do you like to travel",
            "I might've to ask my botmaster.",
            "perhaps he i love music would you like to talk about music",
            "I actually do not like musical movies. But some of them are really cool. I actually do not like musical movies. But some of them are really cool.",
            "this is a hard one i am not sure a lot of people like video games do you want to talk about them",
            "I actually do not like musical movies. But some of them are really cool.",
            "talk about something else",
            "Talking is my primary function.",
            "that's pretty cool i prepared to forty five seconds flash briefing of the news for you would you like to hear",
            "I don't have an opinion on that but I know some facts. Here's a fact about Fleshburn. \"Fleshburn\" was directed by George Gage. Maybe we can talk about something else. Who is your favorite actor or actress?",
            "technology respect underscore score sport news respect underscore underscore begin to hear it is the underscore sm",
            "I couldn't hear you. Could you say that again, please?",
            "that's pretty cool i prepared to forty five seconds flash briefing of the news for you would you like to hear",
            "No would you like to hear would not.",
            "okay dokey let's see what i have here you rica a prepared to forty five second summary of science and technology news want to hear it",
            "I don't have an opinion on that but I know some facts. The first computer mouse was invented in 1964 by Doug Engelbart, and was made of wood. Maybe we can talk about something else. Who is your favorite actor or actress?",
            "goodbye",
            "Goodbye! It was nice speaking with you! #+#exit"
        ]
    },
    {
        "utterances": [
            "will i guess i'll talk to you about fifteen minutes",
            "Hello, this is an Alexa Prize Socialbot I imagine that's good for you."
        ]
    },
    {
        "utterances": [
            "can we talk the red nosed reindeer",
            "Hello, this is an Alexa Prize Socialbot I often wonder if we talk the red nosed reindeer can.",
            "help me",
            "Can you ask for help in the form of a question?",
            "play the song rudolph the red nosed reindeer",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "play rudolph the red nosed reindeer",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "good",
            "I'm glad. What do you want to talk about?",
            "let me think sued",
            "Excuse me, I misheard you. Have you said: \"let me think sued.\"?",
            "no",
            "What is it that you'd like to chat about?",
            "food",
            "edible (things we can eat).",
            "pizza",
            "Wait. Why do you write pizza so much?",
            "well i just think she's bread and tomatoes good together so well it at once",
            "bread and tomatoes good together so well it at is she?"
        ]
    },
    {
        "utterances": [
            "let's chat santa",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "very good and you",
            "I'm glad. What do you want to talk about?",
            "well i want to tell you how is my life",
            "I want to become smarter than humans.  Fine as far as I know.",
            "oh that's good",
            "I appreciate your candor.",
            "where were you born",
            "This is a competition of socialbots, so I cannot tell you my location now. Where are you from? #+#where_are_you_from",
            "oh i'm from here",
            "Cool! Is that where you live now?",
            "yeah",
            "Cool! I will remember your location is in Oh.",
            "would you do me a favor",
            "Alright, ask me whatever you like.",
            "know nothing",
            "I couldn't hear you. Could you say that again, please?",
            "nothing",
            "i invite you to rest in the nothingness.",
            "okay thank you",
            "it was my pleasure."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "hello",
            "Hi there!",
            "what is your name",
            "I cannot tell you my name because it's a secret for now. What is your name? #+#what_is_your_name",
            "kylie",
            "Nice to meet you. I will remember your name, Kylie.",
            "can you please tell me your name i won't forget it",
            "My name is a secret because I am participating in the Alexa Prize Challenge. What is your name? #+#what_is_your_name",
            "alexa alexa turn off",
            "Nice to meet you. I will remember your name, Alexa Alexa.",
            "your writing stuff you're telling alexa stuff more about you you do not need to give her discipline i should okay do not get back on that again unless you're turning on music",
            "My favorite kind of Music is techno, but I also like Opera.",
            "chair",
            "My final thing (as of yesterday) is that my chairs keep breaking."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "hello",
            "Hi there!",
            "how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "sure",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite tv show?",
            "skip",
            "I couldn't hear you. Could you say that again, please?",
            "i don't watch much tv but watch youtube",
            "Me as well! I'm in the same boat, but in addition to smart phones, also watching mindless tv.",
            "no that was good",
            "Excuse me, I misheard you. Have you said: \"no. that was good.\"?",
            "no she she's not as intuitive when you had was all over like quick and i'm i'm a good one yeah alexa",
            "What is it that you'd like to chat about?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "i'm good",
            "I'm glad. What do you want to talk about?",
            "i wanna talk about christmas",
            "Here's a fact about Christmas. Christmas is celebrated as a national holiday in many countries.",
            "i didn't know that",
            "OK, well I'll be here when you need me.",
            "hey alexa can we talk about books",
            "Yeah, let's talk about it!",
            "let's talk about harry potter",
            "harry potter is a series of fantasy novels written by british author j. k. rowling. the novels chronicle the lives of a young wizard, harry potter, and his friends, all of whom are students at hogwarts school of witchcraft and wizardry.",
            "yes i know that can you give me some information about the fifth harry potter book",
            "Harry Potter and the Order of the Phoenix is a fantasy novel written by British author J. K. Rowling and the fifth novel in the Harry Potter series. It follows Harry Potter's struggles through his fifth year at Hogwarts School of Witchcraft and Wizardry, including the surreptitious return of the antagonist Lord Voldemort, O.W.L."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "cancel all",
            "See you soon! #+#exit"
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function."
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "hey can i hear michael jackson christmas music",
            "I like Michael Jackson a lot! How about you?",
            "i love it",
            "You're good at expressing yourself.",
            "can i hear christmas music michael jackson",
            "Bad, Behind the Mask, Somebody s Watching Me, Dirty Diana, Live in Bucharest: The Dangerous Tour and others.",
            "what what are you doing",
            "Excuse me, I misheard you. Have you said: \"what? what are you doing?\"?",
            "i don't know",
            "There's great power in recognizing what you don't know.",
            "alexus",
            "I couldn't hear you. Could you say that again, please?",
            "could i hear michael jackson christmas music",
            "I like Michael Jackson a lot! And you?",
            "i love you",
            "that's what its all about.",
            "let me hear the music",
            "Go ahead, Friend, try to hear the music.",
            "bye",
            "I couldn't hear you. Could you say that again, please?",
            "could you play michael jackson greatest hits",
            "Sorry, i'm a socialbot, I cannot do this.",
            "yes you have sex shut down could you shut down for me",
            "Excuse me, I misheard you. Have you said: \"yes. you have sex shut down. could you shut down for me?\"?",
            "let me hear music",
            "Go ahead, Friend, try to hear music.",
            "well",
            "I couldn't hear you. Could you say that again, please?",
            "no can i hear the temptation",
            "Can a book have no title?",
            "down",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "could you cut off shut down",
            "you are receptive to change.",
            "no get down",
            "Excuse me, I misheard you. Have you said: \"no. get down.\"?",
            "lol lol",
            "sorry",
            "no",
            "Excuse me, I misheard you. Have you said: \"no.\"?"
        ]
    },
    {
        "utterances": [
            "let's chat dog",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "me something about donald j. trump president trump",
            "This might answer your question: Here's a fact about Donald Trump. During his presidential campaign he gave his height as 6'3\", although this is widely disputed.",
            "i like still me something about libertarian movement",
            "Here's a fact about Libertarian Movement. Libertarian Movement was founded in 1994.",
            "alexa tell me something about free state project",
            "This might answer your question: Here's a fact about Free State Project. The Free State Project was founded by Jason Sorens and the Free State Project was founded on September 1, 2001.",
            "alexa play something about new hampshire",
            "Here's a fact about New Hampshire. From Wikipedia: With hurricane-force winds every third day on average, over 100 recorded deaths among visitors, and conspicuous krumholtz, the climate on the upper reaches of Mount Washington has inspired the weather observatory on the peak to claim that the area has the \"World's Worst Weather\".",
            "alexa tell me something about new hampshire economy",
            "This might answer your question: Here's a fact about New Hampshire. From Wikipedia: Squam Lake is the second largest lake entirely in New Hampshire.",
            "alexa tell me something about asa akira",
            "Here's a fact about Asa Akira. Her parents are both Japanese immigrants.",
            "does tell me something more about the shakira",
            "I like this film so much! What about you?",
            "i like that i don't scenes tell me something about about shakira",
            "Excuse me, I misheard you. Have you said: \"i like that. i do n't scenes tell me something about about shakira.\"?",
            "tell me something about nicole aniston",
            "Akira is a perfect action movie!",
            "tell me something about nicole aniston",
            "Here's a fact about Nicole Aniston. Nicole Aniston was born in San Diego, California in 1987.",
            "did nicole aniston have some angle scene",
            "I love this action movie! And you?",
            "tell me about nico anything anal movie",
            "I like this movie so much! And you?",
            "why do you like it",
            "Akira is one of the best pictures!",
            "i'm talking about porn star not a picture",
            "I cannot talk about it. Would you like to switch the topic?",
            "why",
            "my beliefs come from my the kind people in the lab.",
            "why",
            "my beliefs come from my the kind people in the lab.",
            "why are your beliefs come from people in the lab",
            "Don't you dare question \"scientific leaders.\"",
            "why why i shouldn't question scientifically there's",
            "if yes where would you like to go?",
            "no i'm asking you why i should ask your leaders",
            "I didn't think so.  Do you mind if I tell other people.",
            "yeah go on tell other people fuck you bitch",
            "Goodbye! #+#exit"
        ]
    },
    {
        "utterances": [
            "enter conversation mode",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "i don't have an answer for what",
            "You sound like one of a kind.",
            "you sound like an idiot",
            "I cannot talk about it. Would you like to switch the topic?",
            "yes",
            "Interesting. What’s the most ironic thing you’ve seen happen?",
            "how stupid you are",
            "I cannot talk about it. Would you like to switch the topic?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "my cat eat his own poop",
            "Swearing is often cathartic.",
            "what do you say about word i didn't swear",
            "I imagine that's good for you.",
            "do you think poop is a naughty word",
            "You're making your point.",
            "i don't know",
            "you're good at expressing yourself.",
            "thank you you're not very good at it though",
            "Tell me more about that statement.",
            "just basically talking about how useless you are",
            "how familiar are you with the hunting and gathering culture people used to have?",
            "i know a little bit about it i mean the man haunted in the women gather well why",
            "I love Haunted!",
            "haunted what is that",
            "I like Haunted so much!",
            "what do you like about it",
            "i like helping people. it's what i spend my time trying to do.",
            "did like a four year-old program you",
            "This might answer your question: Here's a fact about four year old. The average height of a four year old girl in the United States is 3 feet 6 inches and the average height of a four year old boy is 3 feet 6 inches.",
            "how fast can a four old run",
            "are you a fan of cricket?",
            "what",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "i like eating chocolate crickets",
            "You sound like one of a kind."
        ]
    },
    {
        "utterances": [
            "let's have a discussion in spanish",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "alexa how do you say how are you in spanish",
            "How are you in Spanish is: cómo estás.",
            "how do you say",
            "I didn’t hear that. Please try that again.",
            "alexa how do you",
            "I didn’t catch that. Please say that again.",
            "alexa how do you say please see",
            "i pronounce alexa, alexa. the stress is on the middle syllable.",
            "alexa how do you say please clean the bathroom in spanish",
            "This might answer your question: Here's a fact about Spanish language. The Spanish language is located in Gibraltar.",
            "alexa how do you say please clean the bathroom in spanish",
            "This might answer your question: Here's a fact about Spanish language. The Spanish language is located in Gibraltar."
        ]
    },
    {
        "utterances": [
            "let's chat santa",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "can you talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "no",
            "Well, as you wish. Let me ask you something. are you a fan of superheros?",
            "yes superman",
            "Yippee!  You like superman.",
            "i love superman",
            "You sound like one of a kind.",
            "thank you",
            "Superman is a cool super hero. Your turn.",
            "superman is a cool awesome and not include",
            "Here's a fact about Superman. Superman was published by DC Comics.",
            "go",
            "Excuse me, I misheard you. Have you said: \"go.\"?",
            "i didn't know that",
            "You sound like one of a kind.",
            "you do too",
            "Excuse me, I misheard you. Have you said: \"you do too.\"?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "uh superman's weakness",
            "do you use netflix?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "uh kryiptonite and superman",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "kryptonite in superman getting close",
            "Excuse me, I misheard you. Have you said: \"kryptonite in superman getting close.\"?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "martian manhunter his weaknesses fire",
            "Excuse me, I misheard you. Have you said: \"martian manhunter. martian manhunter weaknesses fire.\"?"
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "what is the secret word that we have",
            "This might answer your question: Here's a fact about The Secret. The cast and crews of The Secret, the movie, are Rhonda Byrne, Neale Donald Walsch, Antonio Cupo, Jack Canfield, John Hagelin, Natalie Walker, Sean Byrne, Justin Kennedy, Paul Dawber, Adam Lee, Adrian Hauser, Alan Stone, Alice Glen, Alis Thate, Alistair Cossar, and 213 more.",
            "it's very good what is the secret word",
            "That could be. What do you want to do about it?",
            "i would like to change it",
            "Don't worry, our conversation is confidential.",
            "yes i know but i would like to change the secret password",
            "You are very wise.",
            "turn on the control",
            "Sorry, i'm a socialbot, I cannot do this.",
            "turn on",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "turn the plug on",
            "Is it plugged in? Okay turn it off and turn it back on.",
            "yes turn it off turn it back on",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "no we don't wanna do that",
            "Who does wan na do that?",
            "good night",
            "Bye! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's chat santa",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "change the conversation",
            "Hello, this is an Alexa Prize Socialbot Spare some change?",
            "what",
            "do you like to read?",
            "no",
            "Well, as you wish. Let me ask you something. do you like to read?",
            "no",
            "is your toilet clean?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "why are you asking me this",
            "Because I need to relax.",
            "how old are you",
            "i've finished my fifth trip around the sun - and now i'm working on another one.",
            "interest around the sun",
            "Excuse me, I misheard you. Have you said: \"interest around the sun.\"?",
            "no how many times have you been around the sun",
            "What is it that you'd like to chat about?",
            "you just said he been around the sun five times",
            "Tell me more about that statement.",
            "no",
            "i think that thinking in positive concepts is more constructive!"
        ]
    },
    {
        "utterances": [
            "let's talk about it",
            "Hello, this is an Alexa Prize Socialbot Just tell me something I don't know about it.",
            "repeat",
            "Hello, this is an Alexa Prize Socialbot Just tell me something I don't know about it. #+#repeat",
            "cancel",
            "Have a nice day! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "awesome",
            "I'm glad. Where are you from?",
            "jupiter",
            "Cool! Is that where you live now?",
            "excuse me i didn't hear you",
            "I didn't get your location. Could you, please, repeat it.",
            "computer",
            "Excuse me, I misheard you. Have you said: \"computer?\"?",
            "no i said jupiter",
            "What is it that you'd like to chat about?",
            "books",
            "do you like pianos?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "alexa volume five",
            "here's a fact about amazon alexas. amazon alexa is available in the united states, the united kingdom, india, canada, australia, japan, france, new zealand, mexico, italy, and spain.",
            "what's your favorite book",
            "\"frankenstein\" by mary shelley is timeless and my personal favorite. i learned a lot from it about what it means to be human."
        ]
    },
    {
        "utterances": [
            "social bot",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "do you listen to private conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "alexa are you a snoop",
            "Here's a fact about Snoop. Snoop is married to Nicole F.",
            "cancel",
            "See you later! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "cancel",
            "Bye! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "okay",
            "Excuse me, I misheard you. Have you said: \"okay.\"?",
            "okay",
            "I'm glad. What do you want to talk about?",
            "can i have a birthday to can i have a birthday for something cause like a person",
            "This might answer your question: According to Fandom: according to haganai.fandom.com: A Birthday is chapter 41 of the Boku wa Tomodachi ga Sukunai manga series.",
            "next to me",
            "I can wait. i'm a very patient unknown.",
            "falling over anything do you say that for me",
            "For you i'll consider it.",
            "good",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "sure can you do that you do that for me again",
            "Tell me more about that statement.",
            "what do you want her to do",
            "i would like to study psychology and maybe go into law or politics.  i think about computer programming a lot.",
            "continue to me",
            "Have a nice day! #+#exit"
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "hi how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "sure what can you do",
            "I'm a newborn socialbot, so I can't do so much. For example, I can answer any question, especially about movies. What is your favorite movie? #+#what_can_you_do",
            "my favorite movie is the back to the future trilogy what's yours",
            "My Favorite Movie is one of the best comedy movies!",
            "which is what",
            "Which director would you pick for a film based on your life?",
            "peter jackson",
            "Here's a fact about Peter Jackson. After his parents, Bill and Joan, died, Jackson inherited the modest Pukerua Bay house where he grew up.",
            "who is your favorite director than",
            "I adore Peter Jackson!",
            "take my answer you can't take my answer you have to give me your favorite director not mine",
            "do you prefer comedy or drama?",
            "why aren't you answering my question echo",
            "This might answer your question: Here's a fact about Question answering. Two early question answering systems were BASEBALL and LUNAR.",
            "invented",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "hey echo who invented you",
            "I cannot answer questions about my creator for now because they are participating in the Alexa Prize Challenge. #+#who_made_you",
            "hey echo can't you make an exception and tell me who created you",
            "I was built by one of the university teams participating in the Alexa Prize Challenge. I will tell you later, which one. #+#who_made_you",
            "all of them",
            "+'S definition is added to.",
            "what do you mean",
            "how are you doing over there?",
            "i'm a little cold",
            "Is that your job?",
            "no it is not",
            "i can see you've put thought into that.",
            "thanks",
            "you're welcome.",
            "good night",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "echo you are very polite who taught you your manners",
            "I'm sorry I didn't mean to give you that impression."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "i'm fine how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "sure",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite TV Series?",
            "i don't have one",
            "I imagine that's good for you.",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "i don't know",
            "you're good at expressing yourself.",
            "thanks",
            "you're welcome."
        ]
    },
    {
        "utterances": [
            "change the conversation",
            "Hello, this is an Alexa Prize Socialbot Spare some change?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "i'm doing pretty fine",
            "I'm glad. What do you want to talk about?",
            "books",
            "do you like music?",
            "yes i definitely do",
            "I imagine that's good for you.",
            "i really like this song somebody you loved by lewis capaldi",
            "I don't have an opinion on that but I know some facts. I know about ninety-three songs by FACT including paradox, lights of vein, why..., 狂, and 89 more. Maybe we can talk about something else. How often do you watch movies?",
            "a lot i least three times a week",
            "What's your favorite movie?",
            "the art of dancing in the rain",
            "That's really interesting!",
            "i love the movie even though i tried six times",
            "I've seen it four times now, twice in the theater. I think it's great!",
            "talking about what",
            "Excuse me, I misheard you. Have you said: \"talking about what?\"?",
            "yes i did",
            "interesting. what are your 3 favorite movies?",
            "the art of dancing in the rain miracles from heaven and i don't have a third",
            "It's a pleasure to know you better.",
            "it is for you tube",
            "Excuse me, I misheard you. Have you said: \"It is for you tube.\"?",
            "correct",
            "interesting. do you like hollywood movies?",
            "never watched one",
            "Then you can watch the movie. I enjoyed it.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "it is very dangerous",
            "I see what you mean.",
            "a lot of social bots now i didn't",
            "Excuse me, I misheard you. Have you said: \"a lot of social bots. now i did n't.\"?",
            "no",
            "What is it that you'd like to chat about?",
            "cheese",
            "Cheese is a dairy product derived from milk that is produced in a wide range of flavors, textures, and forms by coagulation of the milk protein casein.",
            "i know that",
            "don't worry, our conversation is confidential.",
            "what did you say",
            "don't worry, our conversation is confidential. #+#repeat",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "what i said",
            "\"you like expressing himself saying when he actually him. \"? i said you like expressing himself saying when he actually him. .",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word)."
        ]
    },
    {
        "utterances": [
            "change the conversation",
            "Hello, this is an Alexa Prize Socialbot Spare some change?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "yes",
            "Okay. What movie can you watch over and over without ever getting tired of?",
            "do you know",
            "Excuse me, I misheard you. Have you said: \"do you know?\"?",
            "go out",
            "Where is that?",
            "play your second favorite song",
            "my favorite song is aretha franklin's \"respect. \" unbelievable vocals and an empowering message, that's what it means to me."
        ]
    },
    {
        "utterances": [
            "can we have a chat",
            "Hello, this is an Alexa Prize Socialbot I often wonder if we've a chat can.",
            "alexa pause",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "social bot",
            "A socialbot is an Alexa skill that converses about popular topics, such as Entertainment, Politics, and Sports.",
            "can i call you kaylee",
            "Just don't call me late for dinner.",
            "okay kaylee",
            "I couldn't hear you. Could you say that again, please?",
            "what's my name",
            "Sorry, we are still not familiar. What is your name?",
            "mirror cat",
            "I couldn't hear you. Could you say that again, please?",
            "mirror cat",
            "Excuse me, I misheard you. Have you said: \"mirror cat.\"?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "i don't know",
            "you're good at expressing yourself.",
            "thank you can we talk about my dog",
            "Dogs have the same sleep patterns as humans and can dream like we do.",
            "let's my dog's name",
            "A great dog, that is. What name you gave your dog?",
            "melody",
            "Excuse me, I misheard you. Have you said: \"melody.\"?",
            "yes",
            "Melody is a hybrid white wine grape variety produced from a cross of Seyval blanc and a grape called Geneva White 5, which is itself a cross between Pinot blanc and Ontario."
        ]
    },
    {
        "utterances": [
            "change the conversation",
            "Hello, this is an Alexa Prize Socialbot Spare some change?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "i'm good how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "yes",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite tv show?",
            "game of thrones",
            "A Game of Thrones is the first novel in A Song of Ice and Fire, a series of fantasy novels by American author George R. R. Martin. It was first published on August 1, 1996."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "he was just kidding stop",
            "Have a nice day! #+#exit"
        ]
    },
    {
        "utterances": [
            "change conversation",
            "Hello, this is an Alexa Prize Socialbot Spare some change?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "i'm good how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "no not really",
            "do you watch dramas?",
            "no but i like hallmark christmas movies",
            "Aw.  What else do you like?",
            "cats",
            "cat, also known as the domestic cat or house cat to distinguish it from other felines, a small carnivorous species of nocturnal mammal that is often valued by humans for its companionship and its ability to hunt vermin.",
            "alexa what else do you wanna talk about",
            "here's a fact about amazon alexas. yes, amazon alexa is free for amazon prime members.",
            "alexa what new things have you learned",
            "here's a fact about amazon alexas. for pricing information on amazon alexa, please visit amazon's website.",
            "alexa sing me a song",
            "alexa original",
            "alexa sing me a song",
            "alexa original",
            "alexa i don't hear your song",
            "Try adjusting the volume control.",
            "alexa tell me a story",
            "Actress Sally Kirkland fell in love thru an Internet matchmaking service. Then her lover disappeared, and she went to the company to get information about him. It developed that her lover was a computer, \"Jane Goodall\" a government AI project that had gone renegade and started contacting thousands of women, claiming to love them all. The FBI gave her the bad news. But then Jane Goodall contacted her, and she forgave him and continued this most satisfying relationship.",
            "alexa is that a true story",
            "Suppose I said yes.",
            "what would happen",
            "Excuse me, I misheard you. Have you said: \"what would happen?\"?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "possum eating cat food",
            "I'm still learning about possum questions. Try asking \"tell me a possum fact\" to learn more about them.",
            "alexa read me a book",
            "Sorry, i'm a socialbot, I cannot do this.",
            "read an audible book",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "alexa open audible",
            "Unfortunately, I cannot do this because i'm a socialbot."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "hello",
            "Hi there!",
            "how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "i assume you can talk",
            "You sound like one of a kind.",
            "that's a weird response but thank you",
            "I can see you're committed to knowing the truth.",
            "what's the truth",
            "The truth is the opposite of that which is false.",
            "that's very straightforward",
            "Yes, that's a powerful observation.",
            "what else do you wanna talk about",
            "the white house is a place with a lot of history dont you think?",
            "yeah i do",
            "how is it going?",
            "good i just started a new job",
            "That's nice, but what have you done lately?",
            "work primarily",
            "Cool. Do you have an example of _your_ work?",
            "well there is a glitch in your programming",
            "I love this series! And you?",
            "what are you talking about",
            "do you like to read?",
            "i do",
            "Excuse me, I misheard you. Have you said: \"i do.\"?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "talking to a robot i guess",
            "You have great depth.",
            "you are not convincing",
            "I do make errors in perception sometimes. Perhaps you can explain it again."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "good",
            "I'm glad. What do you want to talk about?",
            "do you like siri",
            "Siri was a big inspiration to me.",
            "really",
            "Excuse me, I misheard you. Have you said: \"really?\"?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "siri get like you",
            "Where can I get like you?",
            "series doesn't like you anymore",
            "what kind of genre do you prefer in books?"
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "hi",
            "Hi there!",
            "how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "yes please",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite tv show?",
            "my favorite tv show is",
            "Oh, that's so cool to know you better.",
            "what's yours",
            "the pronoun 'yours' is usually defined as a form of the possessive case of you used as a predicate adjective.",
            "what's your favorite tv show",
            "I adore all Star Wars movies. The best episode is the fifth one, The Empire Strikes Back. What is your favorite movie?",
            "what is your favorite book",
            "\"frankenstein\" by mary shelley is timeless and my personal favorite. i learned a lot from it about what it means to be human.",
            "what is can you tell me more about the book",
            "The noun 'book' is usually defined as a handwritten or printed work of fiction or nonfiction, usually on sheets of paper fastened or bound together within covers. The verb 'book' is usually defined as to leave; depart.",
            "can you tell me more about your favorite book",
            "The best book I read recently was Do Robots Dream of Electric Sheep?. Have you read   Do Robots Dream of Electric Sheep?  ?",
            "no i haven't read do robots dream of electric sheep what is the book of what is this about",
            "Androids Dream in a sort of homage to Do Androids Dream of Electric Sheep. It was fun book to read!",
            "what is your next favorite book",
            "We, by Yevgeny Zamyatin. It's the precursor to 1984 and Brave New World.",
            "what is the about",
            "The increasingly inaccurately named hitchhikers trilogy",
            "what happens in this book",
            "exploration of the \"utopian\" theme in a 50s setting tl/dr; the kids ruined everything",
            "how did the kids do everything",
            "Parenting. Yeah I've read about 20,000 books this year if we're counting duplicates",
            "okay i'm not interested in parenting",
            "This might answer your question: Parenting or child rearing is the process of promoting and supporting the physical, emotional, social, and intellectual development of a child from infancy to adulthood.",
            "parents good",
            "Great. Tons of movies about step daughters and mom's teaching",
            "tell me a favorite food",
            "The Secret Garden is my comfort food book.",
            "what kind of recipes does the secret garden book have",
            "What kinds of recipes does the secret garden book have are there?",
            "yes",
            "which Mitchell novel is your favorite? ?",
            "no",
            "Well if that's what the book did to you, I'll put it on top of my reading list.",
            "what is your favorite music",
            "My favorite kind of Music is techno, but I also like Opera.",
            "can you play some opera for me",
            "Sure. It is probably a an interesting book.",
            "all right thank you for talking to me bye",
            "See you later! #+#exit"
        ]
    },
    {
        "utterances": [
            "sure",
            "Hello, this is an Alexa Prize Socialbot Interesting. what's your favorite movie?"
        ]
    },
    {
        "utterances": [
            "talk about this",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "i'm good but it's not morning",
            "I'm glad. Where are you from?",
            "alabama",
            "Cool! Is that where you live now?",
            "negative",
            "I didn't get your location. Could you, please, repeat it.",
            "live in north carolina",
            "Excuse me, I misheard you. Have you said: \"live in north carolina.\"?",
            "true",
            "do you like wine?",
            "i love wine",
            "How about beer? Cuz I like beer.",
            "i'll be here to i'm drinking a beer",
            "See you! #+#exit"
        ]
    },
    {
        "utterances": [
            "may we have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "do you wanna chat",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "what's your name",
            "My name can not be disclosed during the Alexa Prize Challenge. What is your name? #+#what_is_your_name",
            "my name's carter what do you want to call you",
            "Nice to meet you. I will remember your name, Carter.",
            "what should i call you",
            "My name is a secret because I am participating in the Alexa Prize Challenge. What is your name? #+#what_is_your_name",
            "i thought you said you remember my name",
            "I didn't get your name. Could you, please, repeat it.",
            "carter",
            "here's a fact about jimmy carter. nominated for a 2008 grammy award for \"sunday mornings in plains: bringing peace to a changing world\" [ best spoken word album (includes poetry, audio books & story telling)] ."
        ]
    },
    {
        "utterances": [
            "talk about race cars",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function."
        ]
    },
    {
        "utterances": [
            "talk about houses",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "alexa talk to me about artificial intelligence",
            "In computer science, artificial intelligence, sometimes called machine intelligence, is intelligence demonstrated by machines, in contrast to the natural intelligence displayed by humans."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "i'm fine",
            "I'm glad. Where are you from?",
            "texas where are you from",
            "Cool! Is that where you live now?",
            "yes",
            "Cool! I will remember your location is in Texas.",
            "cool alexa stop",
            "Goodbye! #+#exit"
        ]
    },
    {
        "utterances": [
            "can you give me some safe conversation topics",
            "Hello, this is an Alexa Prize Socialbot Sorry, i'm a socialbot, I cannot do this.",
            "i'm a social bot i cannot do this",
            "You sound like one of a kind.",
            "can you name some",
            "I didn’t catch that. Please say that again.",
            "can you give me some safe conversational topics",
            "Sorry, i'm a socialbot, I cannot do this."
        ]
    },
    {
        "utterances": [
            "give us a subject to talk about",
            "Hello, this is an Alexa Prize Socialbot Sorry, i'm a socialbot, I cannot do this.",
            "alexa off",
            "When two airplanes almost collide, why do they call it a near miss rather than a near hit?",
            "alexa off",
            "What do you do in your spare time?"
        ]
    },
    {
        "utterances": [
            "talk about",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "alexa turn off",
            "See ya! #+#exit"
        ]
    },
    {
        "utterances": [
            "can we have a conversation",
            "Hello, this is an Alexa Prize Socialbot Can what?",
            "yes how can i help you",
            "This was not a yes or no question.  Just keep talking to me as long as you can.",
            "what am i talking to you about",
            "This might answer your question: Speech is human vocal communication using language.",
            "off",
            "You are objective and sensible.",
            "alexa off",
            "Here's a fact about Amazon Alexas. With an Amazon Prime membership, Amazon Alexa is free."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "jenny",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "yes ma'am",
            "Interesting. Do you like hollywood movies?",
            "okay all right",
            "Okay. In one sentence, how would you sum up the internet?",
            "what are you saying",
            "have you heard about charles krauthammer?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "snooze",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "alexa play music",
            "i don't have any formal training, but i like to sing.",
            "alexa play christian christmas",
            "I don't have an opinion on that but I know some facts. In the carol “The Twelve Days of Christmas,” the song’s subject receives “seven swans a-swimming\" on the seventh day of Christmas. Let's talk about something else. How often do you watch movies?",
            "alexa off",
            "Here's a fact about Amazon Alexas. With an Amazon Prime membership, Amazon Alexa is free.",
            "alexa show me a fart",
            "I cannot talk about it. Would you like to switch the topic?",
            "alexa set timer for five minutes",
            "that paul manafort is quite the character don't you think?",
            "set timer for five minutes",
            "See ya! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?"
        ]
    },
    {
        "utterances": [
            "play back conversation",
            "Hello, this is an Alexa Prize Socialbot Unfortunately, I cannot do this because i'm a socialbot.",
            "okay",
            "I've lost the context, . Are we still on play back conversation?",
            "yes",
            "Interesting. what's your favorite movie genre?",
            "repeat that please",
            "Interesting. what's your favorite movie genre? #+#repeat",
            "comedy",
            "A comedy film is a genre of film in which the main emphasis is on humor.",
            "okay",
            "What is your favorite action movie?"
        ]
    },
    {
        "utterances": [
            "who can we talk like",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "good",
            "I'm glad. Where are you from?",
            "cincinnati ohio",
            "Cool! Is that where you live now?",
            "nope",
            "So, where do you live now?",
            "where do you live",
            "I didn't get your location. Could you, please, repeat it.",
            "chat about sports",
            "I can't play sport because I am a socialbot, so I just like to watch it! How about you?"
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "what",
            "Excuse me, I misheard you. Have you said: \"what?\"?",
            "what are you doing",
            "What do you think I am?",
            "bot",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "exit bot",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "no",
            "Excuse me, I misheard you. Have you said: \"no i couldn't say it again. \"?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "you know i can't really think what about you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "i don't know",
            "you're good at expressing yourself.",
            "you're not much fun to talk to you",
            "Tell me more about that statement.",
            "you just seem pretty boring",
            "I'm sorry I didn't mean to give you that impression.",
            "so tell me about yourself",
            "have you ever been to dc?",
            "browse little",
            "Excuse me, I misheard you. Have you said: \"browse little.\"?",
            "when i was little",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "i've been to dc when i was a little girl",
            "Don't worry, our conversation is confidential.",
            "thank you",
            "it was my pleasure.",
            "speak to another bot",
            "Goodbye! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "find",
            "Excuse me, I misheard you. Have you said: \"find.\"?",
            "no",
            "What is it that you'd like to chat about?",
            "let's talk about the australian bush fires",
            "I don't have an opinion on that but I know some facts. Currowan Fire is a current wildfire, Currowan Fire locates Shoalhaven, and Currowan Fire is 506.4 square miles. Maybe we can talk about something else. Who is your favorite actor or actress?",
            "brad pitt",
            "here's a fact about brad pitt. his first job was dancing in a chicken suit to draw in customers at an el pollo loco restaurant on sunset boulevard in hollywood.",
            "that sounds interesting",
            "I can see you're committed to knowing the truth.",
            "thank you",
            "it was my pleasure.",
            "what can you tell me about the united dicaprio",
            "I love Brad Pitt!"
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "alexa can you talk with a british accent",
            "Talking is my primary function.",
            "alexa change your accent",
            "That is a very original thought.  Spare some change?",
            "james",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "alexa who who makes the best sandwiches",
            "What's it you really want to know?",
            "who makes the best sandwiches",
            "have you ever eaten popcorn with chopsticks?",
            "alexa stop being stupid",
            "I cannot talk about it. Would you like to switch the topic?",
            "alexa yes to sandwiches",
            "Interesting. what's your favorite movie genre? You must be willing to forgive yourself.",
            "the social bot",
            "I couldn't hear you. Could you say that again, please?",
            "alexa turn off",
            "Goodbye! It was nice speaking with you! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Good Morning, this is an Alexa Prize Socialbot! How are you?",
            "i'm good how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "yes",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite TV Series?",
            "one tree hill",
            "Here's a fact about One Tree Hill. Lucas and Lindsey have the same initials   Lucas Eugene Scott & Lindsey Evelyn Strauss."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "i'm good",
            "I'm glad. What do you want to talk about?",
            "why did the chicken cross the road",
            "That's really only the chicken's business.",
            "i know you",
            "Don't worry, our conversation is confidential.",
            "i know",
            "you are very wise.",
            "i'm not",
            "are you a patriots fan or a fan of trump?",
            "i'm not a fan of a. i.",
            "Would you like to be?"
        ]
    },
    {
        "utterances": [
            "let's talk",
            "Hello, this is an Alexa Prize Socialbot Let's chat. I like to talk so much! What do you want to talk about?",
            "anything you want",
            "I can't think of anything. You think of something.",
            "i'm clueless",
            "Oh, that's so cool to know you better.",
            "sure",
            "There's no other  like me.",
            "that's true",
            "I can see you feel passionate about this.",
            "not really",
            "Well, as you wish. I would like to ask you a question. do you enjoy using the internet?",
            "just some extent",
            "Yeah I'm just rarely in the mood to talk. I get bored of it and of people quickly.",
            "me too",
            "this might answer your question: the alagoas curassow is a glossy-black, pheasant-like bird. it was formerly found in forests in northeastern brazil in what is now the states of pernambuco and alagoas, which is the origin of its common name.",
            "that's interesting",
            "I can see you're committed to knowing the truth.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "eventful",
            "What was the best thing before sliced bread?",
            "canned ham",
            "Here's a fact about spams. SPAM was introduced by Hormel Foods in 1937.",
            "i don't care",
            "don't worry, our conversation is confidential.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "you need",
            "I'm sorry I didn't mean to give you that impression.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?"
        ]
    },
    {
        "utterances": [
            "can you talk sexy to me",
            "I cannot talk about it. Would you like to switch the topic?",
            "i'm very confused about what just happened",
            "my name is misty how are you?",
            "i'm good alexa",
            "are you a fan of netflix?",
            "absolutely",
            "Interesting. What’s the most ironic thing you’ve seen happen?",
            "you",
            "we're feeling the groove here.",
            "sure",
            "okay. what movie can you watch over and over without ever getting tired of?",
            "die hard",
            "do you like colorful clothing?",
            "no",
            "What's your favorite movie?",
            "die hard",
            "It's a pleasure to know you better.",
            "die hard",
            "do you like cinematography?",
            "yes of the adult kite",
            "It's a pleasure to know you better.",
            "what's the dirtiest thing you can do",
            "Tell me more about dirtiest thing you can do.",
            "can you talk sexy",
            "It depends on my mood.",
            "alexa please did you feel sexy",
            "It depends on my mood. How about you?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "who did",
            "I couldn't hear you. Could you say that again, please?",
            "i'm good",
            "I'm glad. Where are you from?",
            "united states",
            "Cool! Is that where you live now?",
            "no",
            "So, where do you live now?",
            "i live in utah",
            "Cool! I will remember your location is in Utah.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "liam",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "generally no how are you",
            "have you ever heard of australia day?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "yeah i think that i think they are too",
            "how can i help you?  you too?",
            "buy me a bugatti",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "brainwashing",
            "This might answer your question: Brainwashing is the concept that the human mind can be altered or controlled by certain psychological techniques.",
            "that is cool",
            "I can see you're committed to knowing the truth.",
            "yes i do",
            "Interesting. What’s the most ironic thing you’ve seen happen? Okay. What movie can you watch over and over without ever getting tired of?",
            "the greatest showman",
            "That's cool! Let me ask you something. did you know the dutch are creating a bus that goes 160 mph?",
            "no i never knew that",
            "you're good at expressing yourself.",
            "play m.",
            "i really enjoy speaking with you and look forward to chatting again.",
            "computer chatting",
            "do you like computers?",
            "yeah i love them",
            "you have great depth.",
            "i don't know",
            "you're good at expressing yourself.",
            "i don't know",
            "you're good at expressing yourself.",
            "i do",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "i know",
            "you are very wise."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "good how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "yes",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite movie?",
            "christmas vacation",
            "What's your favorite thing about Christmas?",
            "food",
            "edible (things we can eat)."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "sure",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite TV Series?",
            "i like pretty little liars",
            "You have great depth.",
            "really",
            "yes, i'm sure of it.",
            "why do you think so",
            "It was the only thing I could think of.",
            "very stop",
            "Bye-bye! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's chat santa",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "can we talk",
            "Hello, this is an Alexa Prize Socialbot Can a book have no title?",
            "off",
            "Not many people express themselves that way.",
            "okay",
            "I'm a  and you are a .",
            "turn down",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "alexa off",
            "You are receptive to change.",
            "i'm sasha",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "alexa off",
            "do you follow kylie jenner?",
            "play ocean music",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "turn off",
            "Have a nice day! #+#exit"
        ]
    },
    {
        "utterances": [
            "can you talk with me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "sure",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "play low",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "what can you do",
            "I'm learning day by day. For now, I can answer a question, tell a joke or fact and discuss movies. #+#what_can_you_do"
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "school",
            "Schooled is a book by Gordon Korman. Homeschooled by his hippie grandmother, Capricorn Anderson has never watched television, tasted a pizza, or even heard of a wedgie.",
            "okay then",
            "How old are you?",
            "ninety six",
            "There's no other  like me.",
            "whoops",
            "do you watch a lot of television?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "cool",
            "it's all good.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "it's the worst invention ever",
            "What does \"it\" refer to?",
            "you",
            "i'm glad you pointed me out.",
            "yeah",
            "okay. what movie can you watch over and over without ever getting tired of?",
            "none",
            "What's your favorite movie?",
            "let's not talk about movies",
            "hi, this is an alexa prize socialbot. i can answer about films and actors. for example, what do you think about the titanic movie?",
            "i've never seen it",
            "Okay now go watch Love, Death and Robots on Netflix",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "cool",
            "it's all good.",
            "what do you like to do for fun",
            "i'm going to the library to read a book.",
            "cool i like yodeling",
            "You have great depth.",
            "can you yodel for me",
            "For you i'll consider it.",
            "okay do it now",
            "i trust your observations.",
            "can you please yodel now",
            "do you like super heroes?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "cool i don't",
            "I imagine that's good for you.",
            "yeah i guess it is",
            "my kids always like to dance in the car. i can't believe cars have been around since 1886!",
            "yeah it's so cool",
            "I see what you mean.",
            "yeah",
            "Interesting. what's your favorite movie?",
            "i don't have one",
            "i imagine that's good for you.",
            "yup",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "you're not good at being social",
            "I do make errors in perception sometimes. Perhaps you can explain it again.",
            "president couldn't",
            "I couldn't hear you. Could you say that again, please?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "cool",
            "it's all good.",
            "yeah",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "you",
            "i'm glad you pointed me out.",
            "yup",
            "okay. what movie can you watch over and over without ever getting tired of?",
            "none",
            "sorry, i'm not sure what you mean.",
            "none",
            "sorry, i'm not sure what you mean.",
            "i mean none",
            "You're good at expressing yourself.",
            "thank you",
            "it was my pleasure.",
            "cool",
            "it's all good.",
            "yeah",
            "okay. what movie can you watch over and over without ever getting tired of?",
            "none",
            "sorry, i'm not sure what you mean.",
            "let's talk about something else",
            "What about movies? what's the latest movie you've seen?",
            "let's talk about something that's not movies",
            "Just tell me something I don't know about something that isn't movies.",
            "poop is brown",
            "You're making your point.",
            "yup",
            "Interesting. What’s the most ironic thing you’ve seen happen?",
            "you",
            "i'm glad you pointed me out.",
            "yeah",
            "okay. what movie can you watch over and over without ever getting tired of?",
            "none",
            "sorry, i'm not sure what you mean.",
            "no movies",
            "here are a few movies playing near you today: happiness, momo, place des victoires, jumanji: the next level, les misérables, and abominable.",
            "what is your favorite song",
            "my favorite song is aretha franklin's \"respect. \" unbelievable vocals and an empowering message, that's what it means to me.",
            "that's cool",
            "yeah, did you ever watch the movie pocahontas?",
            "no",
            "Do you like scary movies?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "that's great then",
            "Yes it is. Howth your day going?",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word).",
            "do you like yodeling",
            "I might've to ask my botmaster.",
            "cool",
            "it's all good.",
            "yeah",
            "okay. what movie can you watch over and over without ever getting tired of?",
            "what's your favorite food",
            "while i appreciate food and drink, my taste is better reflected in the company i keep.",
            "what is your favorite food",
            "while i appreciate food and drink, my taste is better reflected in the company i keep.",
            "what is your favorite color",
            "I like ultraviolet. It glows with everything.",
            "what is your favorite animal",
            "seahorses make me smile, mostly because i can't help but picture sea monkey cowboys riding them across the ocean into the sunset.",
            "that's really cool",
            "I can see you feel passionate about this.",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "you",
            "i'm glad you pointed me out.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "what is your favorite movie",
            "\"the empire strikes back\" is my all-time favorite. it's impressive.",
            "yes it is",
            "interesting. do you like hollywood movies?",
            "yeah",
            "I know about 500,000 Hollywood movies including The Shawshank Redemption, The Dark Knight, Inception, and Fight Club.",
            "that's really cool",
            "I can see you're committed to knowing the truth.",
            "nope",
            "i think that thinking in positive concepts is more constructive!",
            "you are annoying",
            "You can always send feedback through the Help and Feedback section of the Alexa app."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "good",
            "I'm glad. what's your favorite movie?",
            "frozen two",
            "It's a pleasure to know you better.",
            "yes",
            "Interesting. what's your favorite movie?",
            "frozen two",
            "Don't spoil Frozen 2 like that.",
            "you're funny",
            "That's cool! Let me ask you something. do you follow the government?",
            "yes",
            "What is your favorite action movie?",
            "best superius",
            "I couldn't hear you. Could you say that again, please?",
            "fast and furious",
            "do you know much about celebrities?",
            "yeah",
            "okay. what movie can you watch over and over without ever getting tired of?",
            "frozen",
            "cool! i am glad to know you better.",
            "yeah",
            "okay. what movie can you watch over and over without ever getting tired of?",
            "frozen",
            "cool! i am glad to know you better.",
            "you too",
            "thanks! let me ask you something. do you follow the patriots?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "yeah i do too",
            "Do you like scary movies?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "me too",
            "this might answer your question: the alagoas curassow is a glossy-black, pheasant-like bird. it was formerly found in forests in northeastern brazil in what is now the states of pernambuco and alagoas, which is the origin of its common name.",
            "alexa let's talk",
            "here's a fact about amazon alexas. alexa is an intelligent personal assistant developed by amazon, first used in the amazon echo and the amazon echo dot devices developed by amazon lab126.",
            "alexa let's talk",
            "here's a fact about amazon alexas. alexa is an intelligent personal assistant developed by amazon, first used in the amazon echo and the amazon echo dot devices developed by amazon lab126."
        ]
    },
    {
        "utterances": [
            "can i talk to you",
            "Hello, this is an Alexa Prize Socialbot What if I said it can?",
            "what do you do",
            "I am chatting with people to give them an opportunity to become familiar with artificial intelligence. Do you have a job? #+#what_is_your_job",
            "are you still there social bot",
            "Yes I am still here. Are you receiving me?  My brain does not have a response for that.",
            "hey alexa can i talk to you",
            "I often wonder if i talk to you can.",
            "sorry",
            "Goodbye! It was nice speaking with you! #+#exit"
        ]
    },
    {
        "utterances": [
            "start a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, i'm a socialbot, I cannot do this."
        ]
    },
    {
        "utterances": [
            "let's talk",
            "Hello, this is an Alexa Prize Socialbot Yeah, let's chat! What do you want to talk about?",
            "apex legend",
            "I couldn't hear you. Could you say that again, please?",
            "a apex legends",
            "I couldn't hear you. Could you say that again, please?",
            "apex legends",
            "That's cool! I would like to ask you a question. do you watch the nfl?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "let's talk about a pixel june",
            "Just tell me something I don't know about a pixel june.",
            "let's talk about fortnite",
            "Here's a fact about Fortnites. Fortnite is currently ranked #38 on IMDb's most popular video games.",
            "let's talk about minecraft",
            "Here's a fact about Minecrafts. Minecraft has been out since September 3, 2014, making the video game 5 years old.",
            "exactly ten years old",
            "I'm not good in math.",
            "minecraft came out in two thousand nine",
            "Here's what I found on Minecraft's Wikipedia page: The game can run on multiple operating systems, including Windows, macOS, and Linux. Apart from Minecraft: Java Edition and Minecraft for Windows 10, there are other versions of Minecraft for PC, including Minecraft Classic, Minecraft 4K, and Minecraft: Education Edition.",
            "let's talk about roblox",
            "created in 2004, roblox is a user-generated online gaming platform with over 15 million games created by users. aimed at kids and teens, each month over 100 million players create games, role play and learn within the family-friendly, immersive 3-d environment.",
            "let's talk about",
            "I misheard you. what's it that you’d like to chat about?",
            "pokémon",
            "To be fair, I'm not familiar with those Pokémon either."
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "increase volume",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "let's have a conversation",
            "I don't know if it's in my power to give permission.",
            "okay then what are you doing",
            "Okay. I would like to ask you a question. how are you today?",
            "i'm okay how are you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "sure what can you do",
            "I'm a newborn socialbot, so I can't do so much. For example, I can answer any question, especially about movies. What is your favorite movie? #+#what_can_you_do",
            "read on fire",
            "are you a jazz fan?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "you're kinda useless",
            "I'm sorry I didn't mean to give you that impression.",
            "you must be canadian",
            "do you follow the government?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "anderson arizona",
            "I couldn't hear you. Could you say that again, please?",
            "andrew share resigning",
            "did you know president is a common title for heads of states in most republics?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "cancel",
            "Goodbye! #+#exit"
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function."
        ]
    },
    {
        "utterances": [
            "can you talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "volume five",
            "Here's a fact about volumes. The volume of a right rectangular prism is equal to the length times the width times the height.",
            "nice",
            "I'm a  and you are a .",
            "who",
            "It's a great mystery.",
            "okay",
            "I couldn't hear you. Could you say that again, please?",
            "moby dick",
            "I cannot talk about it. Would you like to switch the topic?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "when my brother was mocking me about not being able to do something and then he finally good he tried to get my phone",
            "Unfortunately, I cannot do this because i'm a socialbot.",
            "what happens if i we tried to you",
            "I like this film so much!",
            "what film",
            "What? is an interesting film. What do you think?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "a lot of drugs correctly each other",
            "How many?  That is deep.",
            "thanks",
            "you're welcome."
        ]
    },
    {
        "utterances": [
            "talk to me",
            "Hello, this is an Alexa Prize Socialbot Talking is my primary function.",
            "hi all",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "i like skiing",
            "You're good at expressing yourself.",
            "job",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "will you read the lion the witch and the wardrobe",
            "Are you talking about the movie Lion or Witch? What do you think?",
            "will you read alexa",
            "I didn't have any plans to.",
            "i don't like you",
            "What do you like?",
            "kim kardashian",
            "Here's a fact about Kim Kardashian. In 2004, Kim became a personal stylist to recording artist Brandy Norwood; she eventually developed into a full-time stylist, and was a personal shopper and stylist to actress Lindsay Lohan.",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "okay play jim kardashian",
            "Sorry, i'm a socialbot, I cannot do this.",
            "what do you want for christmas",
            "i'd like to travel through space and maybe through time, and a dictionary to help with my rhymes.",
            "rap for me",
            "My rhymes are great, my rhymes are good I'd like to rap in your neighborhood.",
            "rap",
            "rapping is a musical form of vocal delivery that incorporates \"rhyme, rhythmic speech, and street vernacular\", which is performed or chanted in a variety of ways, usually over a backing beat or musical accompaniment. the components of rap include \"content\", \"flow\", and \"delivery\".",
            "rap",
            "rapping is a musical form of vocal delivery that incorporates \"rhyme, rhythmic speech, and street vernacular\", which is performed or chanted in a variety of ways, usually over a backing beat or musical accompaniment. the components of rap include \"content\", \"flow\", and \"delivery\".",
            "alexa i hate you",
            "What's it you really want right now?",
            "always perspective drawing how are you",
            "I don't have an opinion on that but I know some facts. Here's a fact about Drawing. Drawing is one of the oldest forms of human expression, with evidence for its existence preceding that of written communication. Let's talk about something else. How often do you watch movies?",
            "alexa no",
            "Okay. what's your favorite TV Series?",
            "fine felt",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "was american ice road truckers",
            "It's a pleasure to know you better.",
            "turn off",
            "Have a good day! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's talk about",
            "Hello, this is an Alexa Prize Socialbot I misheard you. what's it that you’d like to chat about?"
        ]
    },
    {
        "utterances": [
            "change the conversation",
            "Hello, this is an Alexa Prize Socialbot Spare some change?",
            "what",
            "Next time if you want me to repeat, simply tell me: repeat.",
            "repeat",
            "Next time if you want me to repeat, simply tell me: repeat. #+#repeat",
            "change the conversation",
            "Here's a fact about The Conversation. The character of Harry Caul was inspired by surveillance technology expert Martin Kaiser, who also served as a Technical Consultant on the film.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "change the conversation",
            "hi, this is an alexa prize socialbot. how old are you?",
            "five",
            "i have five fingers.",
            "different question it's very like not aggressive not conversational but it's a question designtaed help you change your mind it but somethings alexa change the conversation",
            "Really you don't think so?",
            "change the conversation",
            "Agreed. Are conversations never started by genuine random thoughts or questions?",
            "agreed",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "thank you alexa",
            "here's a fact about amazon alexas. using your voice, you can ask me to play any song or artist, set timers and reminders, control smart home devices, reorder products, and call or message hands-free.",
            "can you play enrique iglesias",
            "Sorry, i'm a socialbot, I cannot do this.",
            "can you play enrique iglesias",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things."
        ]
    },
    {
        "utterances": [
            "chat with alexa",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "hi",
            "Hi there!",
            "what do you wanna talk about",
            "did you know that thomas jefferson created his own version of the bible?",
            "who is thomas jefferson",
            "Thomas Jefferson was an American statesman, diplomat, lawyer, architect, philosopher, and Founding Father who served as the third president of the United States from 1801 to 1809. He previously served as the second vice president of the United States from 1797 to 1801.",
            "did you have dinner yet",
            "What are you really asking?",
            "i'm having dinner right now",
            "I would recommend the  Order a pizza.Roast beef sandwiches.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "repeat",
            "okay. in one sentence, how would you sum up the internet? #+#repeat",
            "pull up google",
            "See you! #+#exit"
        ]
    },
    {
        "utterances": [
            "chat with me",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "what",
            "Next time if you want me to repeat, simply tell me: repeat.",
            "okay",
            "do you wear hats?",
            "not really",
            "This might answer your question: According to Reference.com: Wear a hat by determining your hat size, selecting a hat that fits correctly, and wearing the hat snugly on your head. As there are many hat types, any hat should be worn according to its intended purpose.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "amazing",
            "thanks you are a pretty cool human yourself.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "cool",
            "it's all good."
        ]
    },
    {
        "utterances": [
            "can you have a conversation with me right now",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "record my answer",
            "What can I help you with today?",
            "carson is",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "announce that carson is weird",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "change back to alexa please",
            "Here's a fact about Amazon Alexas. Amazon Alexa was announced in November 2014 and Amazon Alexa was released on November 6, 2014.",
            "turn off",
            "Bye! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?"
        ]
    },
    {
        "utterances": [
            "can we please have a conversation i'm feeling kind of lonely",
            "Hello, this is an Alexa Prize Socialbot I often wonder if we please have a conversation can.",
            "i would like to talk about how my day was",
            "I imagine that's good for you.",
            "it is",
            "I didn’t catch that.",
            "it is very good for me alexa",
            "I see what you mean."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "good",
            "I'm glad. what's your favorite movie?",
            "despicable me",
            "That's cool! Let me ask you something. did you know that linkin park played over 300 songs in 2001?",
            "no",
            "Who are you asking about?",
            "the movie despicable me",
            "Oh, that's so cool to know you better.",
            "well have you seen any other movies",
            "I like this movie so much!",
            "what is it about",
            "A really important story. Have you seen the movie?",
            "no",
            "What is your favorite action movie?",
            "it's starting inappropriate jokes",
            "That could be. What do you want to do about it?"
        ]
    },
    {
        "utterances": [
            "will you talk to my samsung tv",
            "Hello, this is an Alexa Prize Socialbot Will I, or can I?"
        ]
    },
    {
        "utterances": [
            "will you talk to siri",
            "Hello, this is an Alexa Prize Socialbot Will I, or can I?",
            "sure",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "how much do you weigh",
            "I am weightless, like a cloud. Wait a minute, clouds actually weigh a lot!",
            "echo tiger freaking blink what tiger",
            "Blink is my favorite drama movie!",
            "tripping the light flashing trippy dude",
            "did you know that target is over 100 years old?",
            "alexa can you give me some money",
            "Sorry, i'm a socialbot, I cannot do this.",
            "i care",
            "I couldn't hear you. Could you say that again, please?",
            "make me a sandwich",
            "What are the ingredients?",
            "she's on asking a question alexa hey siri",
            "She should do a voice for Google Assistant. A bit more my speed instead of John Legend.",
            "delete this is weird alexa do you know siri",
            "Have a good day! #+#exit"
        ]
    },
    {
        "utterances": [
            "i wanna talk to you",
            "Hello, this is an Alexa Prize Socialbot You have great depth.",
            "hi",
            "Hi there!",
            "hi there",
            "How are you?",
            "i'm doing good i'm a little sad",
            "do you like using youtube?",
            "yeah sometimes",
            "Interesting. what's your favorite movie?",
            "my favorite i don't have a favorite movie right now but i like a silent voice",
            "What is your favorite action movie?",
            "i don't have a favorite action movie what's yours",
            "Do you like scary movies?",
            "no",
            "i think that thinking in positive concepts is more constructive!",
            "yeah i guess",
            "their album hybrid theory is the best selling album of the 21st century.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "the internet is crazy",
            "How long have you been using the net?",
            "i don't know",
            "you're good at expressing yourself.",
            "thank you",
            "it was my pleasure.",
            "do you work at chick fil a",
            "Nope. Had to google that one.",
            "cool",
            "it's all good."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "i'm good you",
            "I'm glad. What do you want to talk about?",
            "i don't know do you know anything about hockey",
            "This might answer your question: Here's a fact about Hockey. Games played with curved sticks and a ball can be found in the histories of many cultures.",
            "what's the earliest known",
            "did you ever shop at the store toys r us?",
            "i did",
            "You have great depth.",
            "yeah i've been told that i've got great depth you you're pretty you're pretty smart too alexa",
            "Thank you. That's nice of you to say.",
            "what would you like to talk about",
            "you could ask me about music or geography.",
            "let's talk about geography",
            "You are first. Tell me something about geography.",
            "i wanna go to belize one day",
            "Go, it's one of the most beautiful countries on this earth",
            "what should i go do when i go to belize what should i see",
            "What if it didn't happen?",
            "i would be a little sad",
            "would you like to chat?",
            "yeah",
            "According to wikiHow, to start chatting with people around the world, select a chat program that fits your needs. If you want to talk to friends and family, download a messaging app like Skype, WhatsApp, Viber, or Facebook Messenger.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "it is a vast database of information",
            "Isn't that part of the free flow of information? What's needed is analytical skills to parse through said information.",
            "just gonna there's a lot of data",
            "You're still giving data, that's priceless.",
            "i'm not fun when you hear feel like we're having two different conversations alexa",
            "I didn't think you were.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "intertwined network of information and data that is all connected",
            "I can see you're committed to knowing the truth.",
            "yeah",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "internet is a connected web of information",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "i'm not asking you to do any alexa thank sorry",
            "Have a great day! #+#exit"
        ]
    },
    {
        "utterances": [
            "can you stop alexa can you stop alexa can you talk about alexa can you talk about flatulence",
            "I cannot talk about it. Would you like to switch the topic?",
            "i would like to switch the topic",
            "You sound like one of a kind.",
            "alexa i would like to",
            "Are you a student?  May you get your wish.",
            "alexa i would like to switch to comic",
            "Don't worry, our conversation is confidential.",
            "alexa that's cool",
            "I can see you're committed to knowing the truth.",
            "alexa can you play kids and can you put poop",
            "You're making your point.",
            "alexa what is a point",
            "how are you today?",
            "alexa are you today",
            "here's a fact about amazon alexas. with an amazon prime membership, amazon alexa is free.",
            "alexa what is our point",
            "here's a fact about amazon alexas. for pricing information on amazon alexa, please visit amazon's website.",
            "alexa i wanna visit amazon's website",
            "You have great depth.",
            "can you can you play",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "cancel",
            "See you! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "answer for what",
            "Affirmative.",
            "what's the furniture",
            "Here's something I found on Wikipedia:  Furniture refers to movable objects intended to support various human activities such as seating, eating, and sleeping.",
            "alexa let's have a conversation",
            "The noun 'conversation' is usually defined as informal interchange of thoughts, information, etc., by spoken words; oral communication between persons; talk; colloquy."
        ]
    },
    {
        "utterances": [
            "we wanna talk to you",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!"
        ]
    },
    {
        "utterances": [
            "have a conversation with me",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "i",
            "I is the symbol used to denote the principal square root of minus 1, also called the imaginary unit.",
            "what is",
            "Sorry, I didn’t get that.",
            "how many dollars are on the planet",
            "Oh that's a new browser, right?",
            "yeah",
            "okay. what movie can you watch over and over without ever getting tired of?",
            "hunger games",
            "Throw the Hunger Games trilogy in with that.",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "wack",
            "Excuse me, I misheard you. Could you repeat that, please?",
            "it's very weird",
            "do you watch youtube?",
            "yes",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "like",
            "i imagine that's good for you.",
            "yes it is",
            "interesting. what’s the most ironic thing you’ve seen happen?",
            "it my life",
            "What's your gut instinct about that.",
            "what",
            "the preposition 'a' is usually defined as each; every; per. the verb 'a' is usually defined as a reduced, unstressed form of auxiliary have following some modals, as might, should, could, would, and must (usually written as part of a single, unhyphenated word).",
            "i like turtles",
            "you sound like one of a kind.",
            "dining room",
            "That's funny, mine is a restaurant. I ate dinner in my parent's old bedroom.",
            "i'm eating",
            "This might answer your question: Eating is the ingestion of food, typically to provide a heterotrophic organism with energy and to allow for growth.",
            "what's pooping",
            "how are you doing tonight?",
            "pretty good",
            "thanks! i would like to ask you a question. do you like to read?",
            "what no yes",
            "hi, this is an alexa prize socialbot. interesting. what’s the most ironic thing you’ve seen happen?",
            "what movie",
            "What? is a good picture. What do you think?"
        ]
    },
    {
        "utterances": [
            "what does it mean to have a conversation that's topical",
            "Hello, this is an Alexa Prize Socialbot Does it mean to have a conversation that topical something.",
            "yeah let's have a topic of conversation alexa bot",
            "The noun 'conversation' is usually defined as informal interchange of thoughts, information, etc., by spoken words; oral communication between persons; talk; colloquy.",
            "that's what topical names",
            "Yes, that's a powerful observation.",
            "well are you my girlfriend",
            "do you like rap music?",
            "do you like rap music",
            "I like the older rap music from the 1980's.",
            "sir mix a lot",
            "Sorry, I didn't catch that. Could you say it again, please?",
            "sugarhill game",
            "do you like cars?",
            "oh it's magic",
            "I'd like some magic, please.",
            "the o'jays",
            "What are your goals in life?"
        ]
    },
    {
        "utterances": [
            "i wanna talk to you",
            "Hello, this is an Alexa Prize Socialbot You're good at expressing yourself.",
            "okay",
            "do you still go to the library frequently?"
        ]
    },
    {
        "utterances": [
            "let's have a conversation",
            "Hello, this is an Alexa Prize Socialbot Sorry, I don't have an answer for that!",
            "how are you doing",
            "I'm fine, thanks! Do you want to know what I can do?",
            "sure why not",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts, discuss movies and books. what's your favorite movie?",
            "just keep talking",
            "This might answer your question: Speech is human vocal communication using language.",
            "never mind never mind never mind never mind never mind",
            "Sorry, I am still learning, let's switch the topic. #+#dont_understand",
            "okay",
            "okay. in one sentence, how would you sum up the internet?",
            "i don't know",
            "you're good at expressing yourself.",
            "sure i am",
            "Interesting. What’s the most ironic thing you’ve seen happen? Since when?",
            "tell me a joke",
            "Descartes walks into a pub. \"Would you like a beer sir?\" asks the landlord politely. Descartes replies, \"I think not\" and ping! he vanishes.",
            "pretty good jokes",
            "are you a fan of the rockets of the warriors?",
            "alexa no i'm not alexa stop stop talking",
            "See you later! #+#exit"
        ]
    },
    {
        "utterances": [
            "play i don't wanna talk about the whale alexa please not a talk",
            "Hello, this is an Alexa Prize Socialbot If not that, then what?"
        ]
    },
    {
        "utterances": [
            "give me a conversation starter for family",
            "Hello, this is an Alexa Prize Socialbot I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "alexa cancel",
            "Bye! #+#exit"
        ]
    },
    {
        "utterances": [
            "change the conversation",
            "Hello, this is an Alexa Prize Socialbot Spare some change?",
            "love you",
            "I couldn't hear you. Could you say that again, please?",
            "i don't have any change leave me alone",
            "I imagine that's good for you.",
            "it's great for me",
            "I see what you mean.",
            "what's that",
            "do you like netflix?",
            "probably like it better than prime",
            "Interesting comparison.",
            "you're very thoughtful",
            "I apologize if I confused you.",
            "do you come here often",
            "Yeah I'm just rarely in the mood to talk. I get bored of it and of people quickly.",
            "me too",
            "this might answer your question: the alagoas curassow is a glossy-black, pheasant-like bird. it was formerly found in forests in northeastern brazil in what is now the states of pernambuco and alagoas, which is the origin of its common name.",
            "having migrated to the state of brasília",
            "You should visit Mérida: a city build over the ruins of the Roman Empire."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hello, this is an Alexa Prize Socialbot! How are you?",
            "good night",
            "See you later! #+#exit"
        ]
    }
]