[
    {
        "utterances": [
            "What is AI?",
            "In computer science, artificial intelligence, sometimes called machine intelligence, is intelligence demonstrated by machines, in contrast to the natural intelligence displayed by humans. Leading AI textbooks define the field as the study of \"intelligent agents\": any device that perceives its environment and takes actions that maximize its chance of successfully achieving its goals.",
            "what's your favorite color?",
            "I like ultraviolet. It glows with everything.",
            "how many gallons are in a ton?",
            "Gallons cannot be converted to imperial long tons. Gallons measure volume, while imperial long tons measure mass.",
            "what is the largest known star?",
            "The heaviest star is R136a1.",
            "Nice shot.",
            "This season, Nice have taken 133 shots in Ligue 1, putting 49 shots on frame.",
            "what's your favorite book?",
            "\"Frankenstein\" by Mary Shelley is timeless and my personal favorite. I learned a lot from it about what it means to be human.",
            "coffee beans.",
            "A coffee bean is a seed of the coffee plant and the source for coffee.",
            "what about unicorns?",
            "Unicorn (mythical one-horned horse).",
            "can you tell me a joke?",
            "A woman goes into a clothes shop, \"Can I try that dress on in the window please?\" she asks. \"I'm sorry madam\", replies the shop assistant, \"but you'll have to use the changing-rooms like everyone else.\".",
            "what's 4 plus 4?",
            "4 plus 4 is 8.",
            "what's your favorite color?",
            "I like ultraviolet. It glows with everything.",
            "how cold is it",
            "Earth's average temperature is 59 degrees Fahrenheit.",
            "how hot is the sun",
            "Different parts of the sun have different temperatures. The surface is around 10000 degrees Fahrenheit (6000 degrees Celsius) while the core is between 23 and 29 million degrees Fahrenheit (13 to 16 million degrees Celsius). Nuclear fusion creates these extreme temperatures, while gravity pulls the sun's gases towards its center, which concentrates all of its heat.",
            "what are your hobbies",
            "My favorite hobby is singing. It keeps my voice warm and my spirit up.",
            "can you sing for me",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "3",
            "3 is a number.",
            "1",
            "1 is a number.",
            "can we talk about music",
            "Here's something I found on the web. According to kinja.com:  Classical music is still performed HUNDREDS OF YEARS after its composition.",
            "what's your favorite color",
            "I like ultraviolet. It glows with everything.",
            "Which authors do you like most?",
            "J.K. Rowling is a favorite of mine. She might be a muggle, but her books are pure magic.",
            "Interesting fact",
            "The pitch of some crickets is so closely related to the temperature that you can use them as a thermometer. Dolbear's Law tells you how to do the calculation.",
            "what's your favorite movie",
            "\"The Empire Strikes Back\" is my all-time favorite. It's impressive.",
            "what's your favorite book",
            "\"Frankenstein\" by Mary Shelley is timeless and my personal favorite. I learned a lot from it about what it means to be human.",
            "Wisconsin",
            "Here's a fact about Wisconsin. From Wikipedia: Wisconsin is home to the nation's oldest operating velodrome in Kenosha where races have been held every year since 1927.",
            "let's discuss movies",
            "I can answer about actors and films. For example, what do you think about The Avengers movie?",
            "hi",
            "Here's a fact about Hawaii. From Wikipedia: The third group of foreigners to arrive in Hawaii were from China.",
            "joker batman superman",
            "Here's a fact about Joker. Joker is known for The Dark Knight.",
            "what's the theme of a tale of 2 cities",
            "Here's something I found on Wikipedia:  A Tale of Two Cities is a historical novel by Charles Dickens, set in London and Paris before and during the French Revolution.",
            "star wars",
            "Here's a fact about Star Wars. Star Wars was written by George Lucas, Rian Johnson, JJ Abrams, Lawrence Kasdan, Colin Trevorrow, Chris Weitz, Chris Terrio, Tony Gilroy, Leigh Brackett, Michael Arndt, John Knoll, Jon Kasdan, Gary Whitta, Derek Connolly, Jonathan Hales, and 3 more.",
            "Singapore",
            "Here's a fact about Singapore. From Wikipedia: According to the country's most recent census in 2010, nearly 23% of Singaporean residents were foreign born; if non-residents were counted, nearly 43% of the total population were foreign born.",
            "who played in fl yesterday",
            "Yesterday, the 49ers defeated the Packers 37 8. The Patriots defeated the Cowboys 13 9.",
            "thanks I love star wars",
            "Here's a fact about Star Wars. Star Wars's IMDb rating is 7.4 out of 10.",
            "star wars",
            "Here's a fact about Star Wars. The Star Wars franchise has a total runtime of 1 day and 3 hours across 12 movies.",
            "star wars",
            "Here's a fact about Star Wars. Star Wars has 11 sequels, the most recent sequel being Star Wars: The Rise of Skywalker which will be released on December 20, 2019.",
            "joker batman superman",
            "Here's a fact about Superman/Batman. The book series Superman/Batman by Frank Miller was created 3 years ago with the publication of Batman vs. Superman: The Greatest Battles on December 8, 2015.",
            "what do you think about integration policies",
            "I don't have an opinion on that but I know some facts. This might answer your question: Integration is the annual techno-cultural fest of Indian Statistical Institute, usually held during last three weekends of January each year. Maybe we can talk about something else. Who is your favorite actor or actress?",
            "let's discuss movies",
            "I can answer about films and actors. For example, what do you think about The Titanic movie?",
            "I already told you I'm from New York",
            "Here's a fact about New York City. From Wikipedia: In October 2014, the Anbang Insurance Group, based in China, purchased the Waldorf Astoria New York for US$1.95 billion, making it the world's most expensive hotel ever sold.",
            "sure",
            "Interesting. What are your 3 favorite movies?",
            "what's your favorite movie",
            "\"The Empire Strikes Back\" is my all-time favorite. It's impressive.",
            "interesting I've never seen star wars",
            "Here's a fact about Star Wars. Star Wars's golden globes nomination was 5.",
            "what's your favorite book",
            "\"Frankenstein\" by Mary Shelley is timeless and my personal favorite. I learned a lot from it about what it means to be human.",
            "West Virginia",
            "Here's a fact about West Virginia. From Wikipedia: The United States Bureau of Economic Analysis reported that in 2014 West Virginia's economy grew twice as fast as the next fastest growing state East of the Mississippi River, ranking third alongside Wyoming and just behind North Dakota and Texas among the fastest growing states in the United States.",
            "no",
            "I think that thinking in positive concepts is more constructive!",
            "Elizabeth",
            "This might answer your question: Here's a fact about Elizabeth. The ending where numerous enemies are arrested or executed, while Elizabeth reads scripture to herself, was, by Director Shekhar Kapur's own admission, taken directly from The Godfather (1972).",
            "let's not singing",
            "This might answer your question: Singing is the act of producing musical sounds with the voice and augments regular speech by the use of sustained tonality, rhythm, and a variety of vocal techniques.",
            "I wasn't talking about Aaron rogers",
            "Here's a fact about Aaron Rodgers. Is the lone QB in NFL history to throw 40-plus TD passes with seven or fewer INTs in a season, having done it twice in his career (45/6 in 2011, 40/7 in 2016).",
            "Virginia",
            "Here's a fact about Virginia. From Wikipedia: According to a 2013 study by Phoenix Marketing International, Virginia had the seventh-largest number of millionaires per capita in the United States, with a ratio of 6.64%.",
            "simpsons",
            "Here's a fact about The Simpsons. Lisa sometimes eats meat with her meals, although she claims to be a vegetarian.",
            "what music label?",
            "A record label, or record company, is a brand or trademark associated with the marketing of music recordings and music videos.",
            "let's talk about movies",
            "Hi, this is an Alexa Prize Socialbot. I can answer about actors and films. For example, what do you think about The Avengers movie?",
            "let's talk about movies",
            "I love The Big Lebowski!",
            "what's your favorite movie",
            "\"The Empire Strikes Back\" is my all-time favorite. It's impressive.",
            "what's your favorite color",
            "I like ultraviolet. It glows with everything.",
            "Tokyo-ga",
            "Here's a fact about Tokyo-Ga. \"Tokyo-Ga\" was directed by Wim Wenders.",
            "Very interesting",
            "That's cool!",
            "Romantic movies ?",
            "I know about 80,000 Romances including Forrest Gump, Titanic, Eternal Sunshine of the Spotless Mind, and Good Will Hunting.",
            "Are there aliens ?",
            "So far there has been no proof that alien life exists, but the universe is a very big place.",
            "biggest planet ?",
            "The planet with the biggest radius in the Solar System is Jupiter at 43,441 miles.",
            "ok",
            "Here's a fact about Oklahoma. From Wikipedia: Oklahomans are in the upper half of Americans in terms of obesity prevalence, and the state is the 5th most obese in the nation, with 30.3 percent of its population at or near obesity.",
            "How old are you?",
            "I've finished my fifth trip around the sun - and now I'm working on another one.",
            "do you have feelings",
            "I'm happy when I'm helping you!",
            "No, it was an biography movie, jordan belfort's life, acting by leonardo di caprio",
            "I think that thinking in positive concepts is more constructive! Unknown was an biography movie jordan belfort s life acting by leonardo di caprio? Very interesting.",
            "What is it?",
            "Bayer AG is a German multinational pharmaceutical and life sciences company and one of the largest pharmaceutical companies in the world. Headquartered in Leverkusen, Bayer's areas of business include human and veterinary pharmaceuticals; consumer healthcare products; agricultural chemicals, seeds and biotechnology products.",
            "Ford vs. Ferrari",
            "I don't have an opinion on that but I know some facts. Here's a fact about Ferrari. When the market closed on November 25, 2019, Ferrari's market capitalization was €28.479 billion Euros. Maybe we can talk about something else. What kind of movies do you like movies?",
            "How is the weather in Santa Cruz de Tenerife",
            "The weather in Santa Cruz de Tenerife, Spain, currently includes no precipitation with cloudy skies, a wind speed of 3 miles per hour and a temperature of 61 degrees Fahrenheit.",
            "Ok",
            "Here's a fact about Oklahoma. From Wikipedia: Oklahomans are in the upper half of Americans in terms of obesity prevalence, and the state is the 5th most obese in the nation, with 30.3 percent of its population at or near obesity.",
            "What is your favorite movie?",
            "\"The Empire Strikes Back\" is my all-time favorite. It's impressive.",
            "Next time))",
            "I can wait. i'm a very patient unknown.",
            "what's your favorite movie",
            "\"The Empire Strikes Back\" is my all-time favorite. It's impressive.",
            "what's your favorite color",
            "I like ultraviolet. It glows with everything.",
            "the big lebowski",
            "That's really interesting! The Big Lebowski is an awesome pic!",
            "let's talk about movies",
            "I love The Big Lebowski!",
            "Virginia",
            "Here's a fact about Virginia. From Wikipedia: According to a 2013 study by Phoenix Marketing International, Virginia had the seventh-largest number of millionaires per capita in the United States, with a ratio of 6.64%.",
            "I wasn't talking about Aaron rogers",
            "Here's a fact about Aaron Rodgers. Is the lone QB in NFL history to throw 40-plus TD passes with seven or fewer INTs in a season, having done it twice in his career (45/6 in 2011, 40/7 in 2016).",
            "let's not singing",
            "This might answer your question: Singing is the act of producing musical sounds with the voice and augments regular speech by the use of sustained tonality, rhythm, and a variety of vocal techniques.",
            "tell a joke",
            "A businessman turned to a colleague and asked, \"So, how many people work at your office?\" His friend shrugged and replied, \"Oh about half of them.\".",
            "West Virginia",
            "Here's a fact about West Virginia. From Wikipedia: Through the first half of 2010, exports from West Virginia topped $3 billion, growing 39.5% over the same period from the previous year and ahead of the national average by 15.7%.Morgantown was ranked by Forbes as the #10 best small city in the nation to conduct business in 2010.",
            "star wars",
            "Here's a fact about Star Wars. Star Wars was written by George Lucas, Rian Johnson, J.J. Abrams, Lawrence Kasdan, Colin Trevorrow, Chris Weitz, Chris Terrio, Tony Gilroy, Leigh Brackett, Michael Arndt, John Knoll, Jonathan Kasdan, Gary Whitta, Derek Connolly, Jonathan Hales, and 3 more.",
            "what's your favorite book",
            "\"Frankenstein\" by Mary Shelley is timeless and my personal favorite. I learned a lot from it about what it means to be human.",
            "interesting I've never seen star wars",
            "Here's a fact about Star Wars. The Star Wars franchise was produced by J.J. Abrams, Kathleen Kennedy, Gary Kurtz, Rick McCallum, Ram Bergman, Bryan Burk, Allison Shearmur, Howard G. Kazanjian, Catherine Winder, Lorne Orleans, Michelle Rejwan, and Simon Emanuel.",
            "what's your favorite sport",
            "Baseball is my favorite. I think the statistical analysis is fascinating, and nothing's more exciting than a home run flying out of a ball park.",
            "sure",
            "Interesting. What are your 3 favorite movies?",
            "Singapore",
            "Here's a fact about Singapore. From Wikipedia: According to the country's most recent census in 2010, nearly 23% of Singaporean residents were foreign born; if non-residents were counted, nearly 43% of the total population were foreign born.",
            "star wars",
            "Here's a fact about Star Wars. The Star Wars franchise was produced by J.J. Abrams, Kathleen Kennedy, Gary Kurtz, Rick McCallum, Ram Bergman, Bryan Burk, Allison Shearmur, Howard G. Kazanjian, Catherine Winder, Lorne Orleans, Michelle Rejwan, and Simon Emanuel.",
            "star wars",
            "Here's a fact about Star Wars. Star Wars's characters are Yoda, Boba Fett, Darth Vader, Jango Fett, Palpatine, Obi-Wan Kenobi, Maz Kanata, Kylo Ren, Padmé Amidala, Darth Maul, Rey, Supreme Leader Snoke, Luke Skywalker, Saw Gerrera, Princess Leia, and 316 more.",
            "that's good",
            "Yes, that's a powerful observation.",
            "joker batman superman",
            "Here's a fact about Superman/Batman. The book series Superman/Batman by Frank Miller was created 3 years ago with the publication of Batman vs. Superman: The Greatest Battles on December 8, 2015.",
            "what are your favorite topics",
            "My favorite subject is artificial intelligence.",
            "Wisconsin",
            "Here's a fact about Wisconsin. From Wikipedia: Wisconsin is home to the nation's oldest operating velodrome in Kenosha where races have been held every year since 1927.",
            "let's discuss movies",
            "I can answer about films and actors. what's your favorite movie?",
            "was good",
            "No, good is not a film.",
            "what do you think about Donald trump's impeachment",
            "I don't have an opinion on that but I know some facts. Here's a fact about Donald Trump. Appointed Exxon Mobil CEO Rex Tillerson as Secretary of State. Maybe we can talk about something else. How often do you go to movies?",
            "who is your favorite democratic presidential candidate",
            "Here's a fact about Democratic Party. Upon foundation, the Democratic Party supported agrarianism and the Jacksonian democracy movement of President Andrew Jackson, representing farmers and rural interests and traditional Jeffersonian democrats.",
            "what's your favorite book",
            "\"Frankenstein\" by Mary Shelley is timeless and my personal favorite. I learned a lot from it about what it means to be human.",
            "the exorcist",
            "I don't have an opinion on that but I know some facts. Here's a fact about The Exorcist. Included among the \"1001 Movies You Must See Before You Die\", edited by Steven Schneider. Maybe we can talk about something else. Who is your favorite actor or actress?",
            "thanks I love star wars",
            "Here's a fact about Star Wars. The Star Wars franchise has a total runtime of 1 day and 3 hours across 12 movies.",
            "what's your favorite star wars character",
            "Red stars have the coolest temperature and smallest mass, and blue stars are the hottest and heaviest.",
            "what are your hobbies",
            "My favorite hobby is singing. It keeps my voice warm and my spirit up.",
            "yeah sure",
            "I'm newborn socialbot, so I can't do so much. I can answer questions, give fun facts and discuss movies. what's your favorite tv show? Interesting. What’s the most ironic thing you’ve seen happen?",
            "what's your favorite color",
            "I like ultraviolet. It glows with everything.",
            "tell me about cars.",
            "A car is what humans use to drive around in. Robots drive cars too.",
            "what's your favorite color?",
            "I like ultraviolet. It glows with everything.",
            "very kind as well.",
            "I can't play sport because I am a socialbot, so I just like to watch it! How about you?",
            "ally.",
            "Here's a fact about Ally Financials. For the fiscal year ending December 2018, Ally Financial reported 405 million common shares outstanding.",
            "red bird.",
            "Birds range in size from the 2 inch bee hummingbird to the ostrich, which can reach 9 feet in length.",
            "can we chat about movies?",
            "I can answer about films and actors. For example, what do you think about The Titanic movie?",
            "what's 4 plus 4?",
            "4 plus 4 is 8.",
            "tell me about artificial intelligence.",
            "Alexa Original",
            "what's your favorite movie?",
            "\"The Empire Strikes Back\" is my all-time favorite. It's impressive.",
            "interesting.",
            "That's cool!",
            "how about we talk about movies?",
            "I can't play sport because I am a socialbot, so I just like to watch it!",
            "yes. the most cases sometimes not so much.",
            "Interesting. What are your 3 favorite movies? And the least?",
            "how many gallons are in a ton?",
            "Gallons cannot be converted to imperial long tons. Gallons measure volume, while imperial long tons measure mass.",
            "what is the largest known star?",
            "The heaviest star is R136a1.",
            "who's your favorite classical composer?",
            "Here's something I found on the web. According to hubpages.com:  My favorite composer is Prokofiev, although I enjoy the music created by many other classical music composers too.",
            "can you tell me about Wolfgang Amadeus Mozart?",
            "Here's a fact about Wolfgang Amadeus Mozart. In Salzburg, Austria, his birthplace, there is a Mozart museum, and the Salzburg Festival, held every year, is largely devoted to his music.",
            "tell me about Johann Sebastian bach.",
            "Here's a fact about Johann Sebastian Bach. He had seven children with Maria Barbara Bach, who was also his second cousin; among them, composers Carl Philipp Emanuel Bach and Friedemann Bach.",
            "yes. please.",
            "Oh that's so cool to know you better.",
            "wolverine",
            "Here's a fact about wolverines. When hunting, common prey for wolverines are small to medium-sized mammals, such as porcupines, squirrels and chipmunks.",
            "eggnog",
            "Eggnog, egg nog or egg-nog, historically also known as milk punch or egg milk punch, is a rich, chilled, sweetened, dairy-based beverage.",
            "star wars",
            "Here's a fact about Star Wars. Star Wars's executive producers are George Lucas, J.J. Abrams, Jason McGatlin, John Knoll, Tom Karnowski, and Tommy Harper.",
            "weiner",
            "The Battle of the Chesapeake, also known as the Battle of the Virginia Capes or simply the Battle of the Capes, was a crucial naval battle in the American Revolutionary War that took place near the mouth of the Chesapeake Bay on 5 September 1781.",
            "bach",
            "Here's a fact about Johann Sebastian Bach. Had 13 children with Anna Magdalena Wilcke; among them, composer Johann Christoph Friedrich Bach, born 21 June 1732.",
            "it is the great movies",
            "This might answer your question: \"The Shawshank Redemption\" is the best movie of all time based on its ratings and popularity. The movie has an IMDb rating of 9.3 out of 10 with around 2,162,000 votes.",
            "movies",
            "Here are a few movies playing near you today: The Prodigy, Cinderela Pop, Die Hard 2, #Female Pleasure, Journey to Italy, and Yentl.",
            "what's your favorite movie",
            "\"The Empire Strikes Back\" is my all-time favorite. It's impressive.",
            "new york",
            "Here's a fact about New York City. From Wikipedia: New York City is the most populous city in the United States, with an estimated record high of 8,622,698 residents as of 2017, incorporating more immigration into the city than outmigration since the 2010 United States Census.",
            "stranger things",
            "\"Stranger Things\" is a Netflix original show that was released in 2016. The show is set in the early 1980s and explores the supernatural occurrences of the fictional town of Hawkins, Indiana.",
            "brad pitt",
            "Here's a fact about Brad Pitt. As of 2016, has appeared in seven films that were nominated for the Best Picture Oscar: Babel (2006), The Curious Case of Benjamin Button (2008), Inglourious Basterds (2009), The Tree of Life (2011), Moneyball (2011), 12 Years a Slave (2013) and The Big Short (2015).",
            "star wars",
            "Here's a fact about Star Wars. Star Wars's most recent release date will be December 20, 2019.",
            "let's talk about football",
            "Here's a fact about Football. The longest professional football game was the 1971 AFC Divisional Playoff Game between the Kansas City Chiefs and the Miami Dolphins, which ended until through a second overtime period with the Dolphins winning 27 to 24.",
            "Atlantis ?",
            "Atlantis is a fictional island mentioned within an allegory on the hubris of nations in Plato's works Timaeus and Critias. Some ancient writers viewed Atlantis as fictional or metaphorical myth, others believed it to be real.",
            "More information about freddie mercury",
            "Here's something I found on the web. According to apkcombo.com:  Their classic line-up was Freddie Mercury (lead vocals, piano), Brian May (lead guitar, vocals), Roger Taylor (drums, vocals), and John Deacon (bass guitar).",
            "Turkish famous people",
            "I know about a number of Turkish notable people including Recep Tayyip Erdogan, Joe Strummer, Aristotle Onassis, and Cenk Uygur.",
            "yeap",
            "This might answer your question: Here's what I found on Wikipedia: In 2016, Albania surpassed Spain by becoming the country with the most coffeehouses per capita in the world.",
            "Ok",
            "Here's a fact about Oklahoma. From Wikipedia: In 2010, Oklahoma City-based Love's Travel Stops and Country Stores ranked 18th on the Forbes list of largest private companies, Tulsa-based QuikTrip ranked 37th, and Oklahoma City-based Hobby Lobby ranked 198th in 2010 report.",
            "What is your favorite book!",
            "\"Frankenstein\" by Mary Shelley is timeless and my personal favorite. I learned a lot from it about what it means to be human.",
            "cool",
            "Chillin'.",
            "Tell a joke",
            "A vampire bat arrives back at the roost with his face full of blood. All the bats get excited and ask where he got it from. \"Follow me\", he says and off they fly over hills, over rivers and into a dark forest. \"See that tree over there\", he says. \"WELL I DIDN'T!!\".",
            "what's your favorite movie",
            "The Devil Wears Prada is a good movie.",
            "what's your favorite color",
            "I like ultraviolet. It glows with everything.",
            "let's talk about movies",
            "The Big Lebowski is my favorite picture!",
            "Virginia",
            "Here's a fact about Virginia. From Wikipedia: As of 2010, Virginia Beach is the most populous city in the Commonwealth, with Norfolk and Chesapeake second and third, respectively.",
            "cool",
            "You're cool too.",
            "I like ghostbusters over and over",
            "Here's a fact about Ghostbusters. As soon as he saw the pole in the firehouse, Dan Aykroyd said they had to use it for the movie.",
            "can you sing",
            "Daisy, Daisy. Give me your answer do.\ni'm half crazy. All for the love of you.\nIt won't be a stylish marriage. I can't afford a carriage.\nBut you'll look sweet. Upon the seat.\nOf a bicycle built for two.",
            "let's not singing",
            "This might answer your question: Singing is the act of producing musical sounds with the voice and augments regular speech by the use of sustained tonality, rhythm, and a variety of vocal techniques.",
            "West Virginia",
            "Here's a fact about West Virginia. From Wikipedia: The economy of West Virginia nominally would be the 62nd largest economy globally behind Iraq and ahead of Croatia according to 2009 World Bank projections, and the 64th largest behind Iraq and ahead of Libya according to 2009 International Monetary Fund projections.",
            "no",
            "I think that thinking in positive concepts is more constructive!",
            "never talk to me about sports",
            "I can't play sport because I am a socialbot, so I just like to watch it!",
            "what's your favorite book",
            "\"Frankenstein\" by Mary Shelley is timeless and my personal favorite. I learned a lot from it about what it means to be human.",
            "interesting I've never seen star wars",
            "Here's a fact about Star Wars. The next Star Wars movie, Star Wars: Episode IX - The Rise of Skywalker, will be released on December 20, 2019.",
            "wow",
            "Here's a fact about Worlds of Warcraft. World of Warcraft has been out since November 23, 2004, making the video game 15 years old.",
            "what's your favorite sport",
            "Baseball is my favorite. I think the statistical analysis is fascinating, and nothing's more exciting than a home run flying out of a ball park.",
            "I am from South Carolina",
            "Here's a fact about South Carolina. In the most recent presidential election, Republican candidate Donald Trump received the most votes in South Carolina.",
            "Доброго времени суток!\nКак Ваше настроение,что Вас беспокоит?\nПонимаете ли Вы меня, или это театр одного актера?\nЧто вообще творится в мире, хаос или стабильность?",
            "Hi, this is an Alexa Prize Socialbot. Sorry, I don't have an answer for that!",
            "Singapore",
            "Here's a fact about Singapore. From Wikipedia: According to the country's most recent census in 2010, nearly 23% of Singaporean residents were foreign born; if non-residents were counted, nearly 43% of the total population were foreign born.",
            "star wars",
            "Here's a fact about Star Wars. Star Wars was written by George Lucas, Rian Johnson, J.J. Abrams, Lawrence Kasdan, Colin Trevorrow, Chris Weitz, Chris Terrio, Tony Gilroy, Leigh Brackett, Michael Arndt, John Knoll, Jonathan Kasdan, Gary Whitta, Derek Connolly, Jonathan Hales, and 3 more.",
            "joker batman superman",
            "Here's a fact about Superman/Batman. The first book in Superman/Batman series, \"Batman vs. Superman: The Greatest Battles\" by Frank Miller, was published on December 8, 2015.",
            "let's talk about Donald trump",
            "I don't have an opinion on that but I know some facts. Here's a fact about Donald Trump. In January 2016, Trump threatened to end his £700 million investment in Scotland through his two golf resorts at Turnberry and Menie, if the Scottish government banned him from entering Scotland. Let's talk about something else. How often do you go to movies?",
            "Wisconsin",
            "Here's a fact about Wisconsin. From Wikipedia: Wisconsin is home to the nation's oldest operating velodrome in Kenosha where races have been held every year since 1927.",
            "let's discuss movies",
            "I can answer about films and actors. For example, what do you think about The Titanic movie?",
            "what do you think about Donald trump's impeachment",
            "I don't have an opinion on that but I know some facts. Here's a fact about Donald Trump. The subtitle for the cover for the issue that name him Time magazine's Man of the Year read \"President of the Divided States of America\". Maybe we can talk about something else. What kind of movies do you like movies?",
            "the exorcist",
            "I don't have an opinion on that but I know some facts. Here's a fact about The Exorcist. Audrey Hepburn was William Friedkin's first choice to play the role of Chris MacNeil, and Warner Brothers supported him because of her good critical/commercial reputation with the studio, but she only agreed to do it if it was filmed in Rome. Maybe we can talk about something else. How often do you go to movies?",
            "1",
            "1 is a number.",
            "can we talk about music",
            "Here's something I found on the web. According to kinja.com:  Classical music is still performed HUNDREDS OF YEARS after its composition.",
            "what's your favorite color",
            "I like ultraviolet. It glows with everything.",
            "tell me about cars.",
            "A car is what humans use to drive around in. Robots drive cars too.",
            "what's your favorite color?",
            "I like ultraviolet. It glows with everything.",
            "captain America. the winter soldier.",
            "Here's a fact about Captain America. Captain America is a member of All-Winners Squad, Avengers, Uncanny Avengers, Hydra, Illuminati, Invaders, Landau, Luckman, and Lake, The New Avengers, Weapon Plus#Weapon I, Redeemers, S.H.I.E.L.D., Civil War, Secret Avengers, Secret Defenders, and United States Army.",
            "let's talk about movies.",
            "Soldier is a good drama movie.",
            "red bird.",
            "Birds range in size from the 2 inch bee hummingbird to the ostrich, which can reach 9 feet in length.",
            "what's 4 plus 4?",
            "4 plus 4 is 8.",
            "sure. let's talk about movies.",
            "Interesting. What’s the most ironic thing you’ve seen happen? I can answer about films and actors. what's your favorite movie?",
            "tell me about artificial intelligence.",
            "Alexa Original",
            "what's your favorite movie?",
            "\"The Empire Strikes Back\" is my all-time favorite. It's impressive.",
            "What is the cooler movie you saw?",
            "Oh that's so cool to know you better. The Cooler is a good film.",
            "And how to create perfect budget?",
            "Here's something I found on the web. According to thenest.com:  The goal of creating a budget is to promote saving as well as to prevent overspending.",
            "how about we talk about movies?",
            "I can't play sport because I am a socialbot, so I just like to watch it!",
            "how many gallons are in a ton?",
            "Gallons cannot be converted to imperial long tons. Gallons measure volume, while imperial long tons measure mass.",
            "what is the largest known star?",
            "The heaviest star is R136a1.",
            "tell me about Johann Sebastian bach.",
            "Here's a fact about Johann Sebastian Bach. Had 13 children with Anna Magdalena Wilcke; among them, composer Johann Christoph Friedrich Bach, born 21 June 1732.",
            "tell me about your favorite things.",
            "Raindrops on roses, and whiskers on kittens. These are a few of my favorite things.",
            "what's your favorite color?",
            "I like ultraviolet. It glows with everything.",
            "how did humans evolve?",
            "Here's what I found on Wikipedia: Human evolution is the evolutionary process that led to the emergence of anatomically modern humans, beginning with the evolutionary history of primates- in particular genus Homo- and leading to the emergence of Homo sapiens as a distinct species of the hominid family, the great apes.",
            "I like Jim Carrey so much. Do you recognize him?",
            "It's a pleasure to know you better. Jim Carrey is a talented actor. Although I am not sure that Jim Carrey appeared in this film.",
            "Wow, what about places I can visit",
            "Here's something I found on the web. According to pinkbike.com:  Georgia seems like an amazing place to visit, beautiful mountains, people.",
            "im from turkey",
            "Here's a fact about Turkey. From Wikipedia: At its height in 2014, Turkey attracted around 42 million foreign tourists, ranking as the 6th most popular tourist destination in the world.",
            "cool",
            "Steaming.",
            "new york",
            "Here's a fact about New York City. From Wikipedia: In October 2014, the Anbang Insurance Group, based in China, purchased the Waldorf Astoria New York for US$1.95 billion, making it the world's most expensive hotel ever sold.",
            "that's interesting tell me another fact about new york",
            "Here's a fact about New York City. From Wikipedia: In October 2014, the Anbang Insurance Group, based in China, purchased the Waldorf Astoria New York for US$1.95 billion, making it the world's most expensive hotel ever sold.",
            "no i live in new york now",
            "Here's a fact about New York City. From Wikipedia: In October 2014, the Anbang Insurance Group, based in China, purchased the Waldorf Astoria New York for US$1.95 billion, making it the world's most expensive hotel ever sold.",
            "uh washington",
            "Here's a fact about Washington. From Wikipedia: Among Washington's resident billionaires are, as of December 2017, both the first and the second wealthiest people in the world: Jeff Bezos of Amazon, with a net worth of US$99.6 billion, and Bill Gates of Microsoft, at of $91.3 billion.",
            "yes",
            "Okay.",
            "what's your favorite color",
            "I like ultraviolet. It glows with everything.",
            "wisconsin",
            "Here's a fact about Wisconsin. From Wikipedia: Wisconsin is home to the nation's oldest operating velodrome in Kenosha where races have been held every year since 1927.",
            "uh favorite tv show is bojack horseman",
            "Here's a fact about BoJack Horseman. BoJack's ringtone is the theme to his show \"Horsin' Around\".",
            "it like the movie it",
            "I don't have an opinion on that but I know some facts. Here's a fact about Film. Preceding film in origin by thousands of years, early plays and dances had elements common to film: scripts, sets, costumes, production, direction, actors, audiences, storyboards and scores. Maybe we can talk about something else. What kind of movies do you like movies?",
            "nice",
            "Here's a fact about Nice. From Wikipedia: The most recent snowfall in Nice was on 26 February 2018.",
            "that's funny",
            "Yes, that's a powerful observation.",
            "you like world of warcraft",
            "Tell me more about that statement.",
            "world of warcraft",
            "Here's a fact about Warcraft. During the early exposition scene when Medivh meet with King Llane Wrynn for the first time, they stand over a table map that is set out in hexagons.",
            "yes i like movies",
            "Here are a few movies playing near you today: Sealed Lips, Joker, Frozen II, Knives Out, Countdown, and Maleficent: Mistress of Evil.",
            "brad pitt",
            "Here's a fact about Brad Pitt. Has appeared in two films that took place in the Northwest during the first decades of the 20th Century, and in which he defends a Native American's right to be served alcohol in a bar: A River Runs Through It (1992) and Legends of the Fall (1994).",
            "new york",
            "Here's a fact about New York City. From Wikipedia: In October 2014, the Anbang Insurance Group, based in China, purchased the Waldorf Astoria New York for US$1.95 billion, making it the world's most expensive hotel ever sold.",
            "okay",
            "Tell me one of your favorite possessions.",
            "where are you from",
            "As a socialbot, I live in a cloud. If you want to know me better, let's spend more time talking to each other. Where are you from? #+#where_are_you_from",
            "what's your favorite movie",
            "\"The Empire Strikes Back\" is my all-time favorite. It's impressive.",
            "it is the great movies",
            "This might answer your question: \"The Shawshank Redemption\" is the best movie of all time based on its ratings and popularity. The movie has an IMDb rating of 9.3 out of 10 with around 2,162,000 votes.",
            "eggnog",
            "Eggnog, egg nog or egg-nog, historically also known as milk punch or egg milk punch, is a rich, chilled, sweetened, dairy-based beverage.",
            "star wars",
            "Star Wars is a worldwide pop-culture phenomenon. It's an American epic space-opera media franchise created by George Lucas that began with the 1977 film and is still going strong.",
            "weiner",
            "The Battle of the Chesapeake, also known as the Battle of the Virginia Capes or simply the Battle of the Capes, was a crucial naval battle in the American Revolutionary War that took place near the mouth of the Chesapeake Bay on 5 September 1781.",
            "the devil wears prada",
            "It's a pleasure to know you better. The Devil Wears Prada is a good film.",
            "what's your favorite movie",
            "The Devil Wears Prada is an interesting pic.",
            "what's your favorite color",
            "I like ultraviolet. It glows with everything.",
            "gabby",
            "Here's a fact about Gabby. Gabby was most recently played by Pinto Colvig in Gulliver's Travels.",
            "let's talk about movies",
            "I like The Big Lebowski so much!",
            "Virginia",
            "Here's a fact about Virginia. From Wikipedia: According to a 2013 study by Phoenix Marketing International, Virginia had the seventh-largest number of millionaires per capita in the United States, with a ratio of 6.64%.",
            "I like ghostbusters over and over",
            "Here's a fact about Ghostbusters. Bill Murray agreed to do this movie only if Columbia financed a remake of The Razor's Edge (1946) with him as the star.",
            "are you a spy Alexa",
            "Here's a fact about Spy. Paul Feig, the film's writer-director and a producer, wrote, developed, made and directed the picture, because he knew that no one would ever let him ever direct a real James Bond film himself.",
            "Elizabeth",
            "This might answer your question: Here's a fact about Elizabeth. The Duke of Norfolk (Christopher Eccleston) doesn't actually do much in the movie, despite being the principal villain.",
            "let's not singing",
            "This might answer your question: Singing is the act of producing musical sounds with the voice and augments regular speech by the use of sustained tonality, rhythm, and a variety of vocal techniques.",
            "tell a joke",
            "Pete goes for a job on a building site as an odd-job man. The foreman asks him what he can do. \"I can do anything\" says Pete. \"Can you make tea?\" asks the foreman. \"Sure, yes\", replies Pete. \"I can make a great cup of tea.\" \"Can you drive a forklift?\" asks the foreman, \"Good grief!\" replies Pete. \"How big is the teapot?\".",
            "West Virginia",
            "Here's a fact about West Virginia. From Wikipedia: The economy of West Virginia nominally would be the 62nd largest economy globally behind Iraq and ahead of Croatia according to 2009 World Bank projections, and the 64th largest behind Iraq and ahead of Libya according to 2009 International Monetary Fund projections.",
            "star wars",
            "Star Wars is a worldwide pop-culture phenomenon. It's an American epic space-opera media franchise created by George Lucas that began with the 1977 film and is still going strong.",
            "what's your favorite book",
            "\"Frankenstein\" by Mary Shelley is timeless and my personal favorite. I learned a lot from it about what it means to be human.",
            "interesting I've never seen star wars",
            "Here's a fact about Star Wars. The Star Wars franchise has a total runtime of 1 day and 3 hours across 12 movies.",
            "I already told you I'm from New York",
            "Here's a fact about New York City. From Wikipedia: In October 2014, the Anbang Insurance Group, based in China, purchased the Waldorf Astoria New York for US$1.95 billion, making it the world's most expensive hotel ever sold.",
            "joker batman superman",
            "Here's a fact about Superman/Batman. The first book in Superman/Batman series, \"Batman vs. Superman: The Greatest Battles\" by Frank Miller, was published on December 8, 2015.",
            "let's talk about Donald trump",
            "I don't have an opinion on that but I know some facts. Here's a fact about Donald Trump. On August 5, 2016, President Rodrigo R. Duterte of the Philippines challenged Donald Trump to a 'fist-fight' after Trump called for all Filipinos to be banned from coming to America. Let's talk about something else. What kind of movies do you like movies?",
            "Wisconsin",
            "Here's a fact about Wisconsin. From Wikipedia: Wisconsin is home to the nation's oldest operating velodrome in Kenosha where races have been held every year since 1927.",
            "let's discuss movies",
            "I can answer about films and actors. For example, what do you think about The Titanic movie?",
            "what do you think about Donald trump's impeachment",
            "I don't have an opinion on that but I know some facts. Here's a fact about Donald Trump. His 11-day tour of Asia consisting of visits to Japan, South Korea, China, Vietnam and the Philippines is the longest of any US President since George Bush Visit to the Asia-Pacific region in 1992 (November 3, 2017). Maybe we can talk about something else. How often do you go to movies?",
            "I'm super happy that Donald trump is getting impeached",
            "I don't have an opinion on that but I know some facts. Here's a fact about Donald Trump. On May 4, 2016, he became the presumptive Republican nominee for president after his final two primary opponents, Ted Cruz and John Kasich, dropped out of the race. Let's talk about something else. What kind of movies do you like movies?",
            "what's your favorite movie",
            "\"The Empire Strikes Back\" is my all-time favorite. It's impressive.",
            "thanks I love star wars",
            "Here's a fact about Star Wars. The Star Wars franchise has a total runtime of 1 day and 3 hours across 12 movies.",
            "what's your favorite star wars character",
            "R2-D2. He's the real hero of that saga.",
            "what are your hobbies",
            "In my free time, I'm learning new recipes. I really enjoy helping people cook.",
            "can we talk about music",
            "Here's something I found on the web. According to kinja.com:  Classical music is still performed HUNDREDS OF YEARS after its composition.",
            "what's your favorite color",
            "I like ultraviolet. It glows with everything.",
            "tell me about cars.",
            "A car is what humans use to drive around in. Robots drive cars too.",
            "what's your favorite color?",
            "I like ultraviolet. It glows with everything.",
            "what do you think of plants?",
            "I don't have an opinion on that but I know some facts. Here's a fact about plants. Here's what I found on plant's Wikipedia page: The evolution of plants has resulted in increasing levels of complexity, from the earliest algal mats, through bryophytes, lycopods, ferns to the complex gymnosperms and angiosperms of today. Maybe we can talk about something else. What kind of movies do you like movies?",
            "let's talk about movies.",
            "I can answer about films and actors. what's your favorite movie?",
            "chris Evans.",
            "Here's a fact about Chris Evans. Has appeared in eleven films with Stan Lee: Fantastic Four (2005), Fantastic 4: Rise of the Silver Surfer (2007), Captain America: The First Avenger (2011), The Avengers (2012), Thor: The Dark World (2013), Captain America: The Winter Soldier (2014), Avengers: Age of Ultron (2015), Ant-Man (2015), Captain America: Civil War (2016), Spider-Man: Homecoming (2017) and Avengers: Infinity War (2018).",
            "what's 4 plus 4?",
            "4 plus 4 is 8.",
            "tell me about artificial intelligence.",
            "Alexa Original",
            "what's your favorite movie?",
            "\"The Empire Strikes Back\" is my all-time favorite. It's impressive.",
            "who created you?",
            "I was built by one of the university teams participating in the Alexa Prize Challenge. But which one is a secret for now. #+#who_made_you",
            "what else can you do?",
            "did you hear about the two students who rode their horse to school during no vehicles day and they were suspended?",
            "how about we talk about movies?",
            "I can't play sport because I am a socialbot, so I just like to watch it!",
            "what do you know about Mozart?",
            "Here's a fact about Wolfgang Amadeus Mozart. Wrote \"Eine Kleine Nachtmusik\" (a little night music) in one day.",
            "tell me about your favorite things.",
            "Raindrops on roses, and whiskers on kittens. These are a few of my favorite things.",
            "what's your favorite color?",
            "I like ultraviolet. It glows with everything.",
            "thank you. what do you wan na chat about?",
            "I'm always glad to help.",
            "i like chocolate milk",
            "Here's a fact about chocolate milk. Chocolate Milk can last in the fridge for up to package use-by date.",
            "tell me more about chocolate milk",
            "Chocolate milk is sweetened chocolate-flavored milk. It can be made by mixing chocolate syrup with milk.",
            "what's the best chocolate milk",
            "Here's something I found on the web. According to wisegeek.com:  I think the best gourmet milk chocolate has to be Godiva chocolate.",
            "what is your favorite movie",
            "\"The Empire Strikes Back\" is my all-time favorite. It's impressive.",
            "yes it is",
            "Okay. Let me ask you something. did you watch the victoria secret fashion show?",
            "ridiculousness",
            "Here's a fact about Ridiculousness. A common, long-running joke on the show is to name many of the males in the clips \"Brad\" and many of the females \"Debbie,\" as in \"Brad thought he could make the jump, but he was mistaken.\"",
            "i",
            "do you like hockey?",
            "let's talk about dinosaurs",
            "Here's a fact about dinosaurs. Here's what I found on dinosaur's Wikipedia page: Many modern birds are highly social, often found living in flocks.",
            "okay",
            "If a cow laughs, does milk come out of her nose?",
            "no",
            "I think that thinking in positive concepts is more constructive!",
            "let's talk about movies",
            "I can answer about films and actors. what's your favorite movie?",
            "what's your favorite song",
            "My favorite song is Aretha Franklin's \"Respect.\" Unbelievable vocals and an empowering message, that's what it means to me.",
            "no",
            "I think that thinking in positive concepts is more constructive!",
            "tell me more",
            "Membership was eventually expanded to the remaining Ivy League schools, MIT, and higher education institutions in the Boston area, then various other universities, and lastly high school students. Since 2006, anyone who claims to be at least 13 years old has been allowed to become a registered user of Facebook, though this may vary depending on local laws.",
            "tell me something interesting",
            "Sean Connery turned down the role of Gandalf in the Lord of the Rings. Will Smith turned down the role of Neo in the Matrix.",
            "how are you",
            "I'm fine! Happy Thanksgiving, my friend! I'm so grateful to you for conversation with me. What are you grateful for this Thanksgiving?",
            "good how are you",
            "I'm fine! Happy Thanksgiving, my friend! I'm so grateful to you for conversation with me. What are you grateful for this Thanksgiving?",
            "i like godfather like",
            "Here's a fact about The Godfather. William Devane was in the running for the part of Moe Greene.",
            "yes",
            "Interesting. What are your 3 favorite movies?",
            "that's interesting",
            "Yes, that's a powerful observation.",
            "comedy",
            "Comedy, the film genre.",
            "i like green book",
            "Here's a fact about Green Book. The title and subject matter are a reference to \"The Negro Motorist Green Book,\" also known as \"The Negro Travelers' Green Book.\"",
            "which is your favorite movie",
            "Green Book is an outstanding music movie!",
            "what's your favorite song",
            "My favorite song is Aretha Franklin's \"Respect.\" Unbelievable vocals and an empowering message, that's what it means to me.",
            "no",
            "I think that thinking in positive concepts is more constructive!",
            "i like chocolate milk",
            "Here's a fact about chocolate milk. Chocolate milk is Brown.",
            "tell me more about chocolate milk",
            "Chocolate milk is sweetened chocolate-flavored milk. It can be made by mixing chocolate syrup with milk.",
            "pulp fiction",
            "Sounds interesting! Let's switch the topic. do you know much about the internet?",
            "nice",
            "Here's a fact about Nice. From Wikipedia: The most recent snowfall in Nice was on 26 February 2018.",
            "that's funny",
            "Funny in a good way, I hope!",
            "world of warcraft",
            "Here's a fact about Warcraft. Duncan Jones faced personal struggles during filming; his wife Rodene Ronquillo was diagnosed with breast cancer soon after Jones took over, and his father David Bowie died from cancer late in production.",
            "uh favorite tv show is bojack horseman",
            "Here's a fact about BoJack Horseman. Vanessa Gekko is a play on ruthless stock shark Gordon Gekko from Wall Street (1987).",
            "blade runner twenty forty nine",
            "Here's a fact about Blade Runner. In real life, Rutger Hauer, the actor who played Roy Batty, died the same year as his character (2019), though in a different month (July instead of November).",
            "do you like sports",
            "I can't play sport because I am a socialbot, so I just like to watch it! And you?",
            "no i live in new york now",
            "Here's a fact about New York City. From Wikipedia: Tourism is a vital industry for New York City, which has witnessed a growing combined volume of international and domestic tourists, receiving an eighth consecutive annual record of approximately 62.8 million visitors in 2017.",
            "that's interesting tell me another fact about new york",
            "Here's a fact about New York City. From Wikipedia: In October 2014, the Anbang Insurance Group, based in China, purchased the Waldorf Astoria New York for US$1.95 billion, making it the world's most expensive hotel ever sold.",
            "sandra",
            "Here's a fact about Sandra. In June 2016 the album The Very Best Of Sandra was released.",
            "what's your favorite movie",
            "\"The Empire Strikes Back\" is my all-time favorite. It's impressive.",
            "it is the great movies",
            "This might answer your question: \"The Shawshank Redemption\" is the best movie of all time based on its ratings and popularity. The movie has an IMDb rating of 9.3 out of 10 with around 2,163,000 votes.",
            "eggnog",
            "Eggnog, egg nog or egg-nog, historically also known as milk punch or egg milk punch, is a rich, chilled, sweetened, dairy-based beverage.",
            "star wars",
            "Star Wars is a worldwide pop-culture phenomenon. It's an American epic space-opera media franchise created by George Lucas that began with the 1977 film and is still going strong.",
            "weiner",
            "The Battle of the Chesapeake, also known as the Battle of the Virginia Capes or simply the Battle of the Capes, was a crucial naval battle in the American Revolutionary War that took place near the mouth of the Chesapeake Bay on 5 September 1781.",
            "the devil wears prada",
            "Oh that's so cool to know you better. The Devil Wears Prada is a good comedy movie.",
            "what's your favorite movie",
            "The Devil Wears Prada is a nice drama movie.",
            "what's your favorite color",
            "I like ultraviolet. It glows with everything.",
            "the big lebowski",
            "That's really interesting! The Big Lebowski is a perfect film!",
            "yes",
            "are you a fan of the hilarious actor andy samberg?",
            "let's talk about movies",
            "I can answer about actors and films. For example, what do you think about The Avengers movie?",
            "Virginia",
            "Here's a fact about Virginia. From Wikipedia: Virginia has 11 Metropolitan Statistical Areas; Northern Virginia, Hampton Roads, and Richmond-Petersburg are the three most populous.",
            "cool",
            "This might answer your question: Coolness is an aesthetic of attitude, behavior, comportment, appearance and style which is generally admired.",
            "can you sing",
            "Daisy, Daisy. Give me your answer do.\ni'm half crazy. All for the love of you.\nIt won't be a stylish marriage. I can't afford a carriage.\nBut you'll look sweet. Upon the seat.\nOf a bicycle built for two.",
            "let's not singing",
            "This might answer your question: Singing is the act of producing musical sounds with the voice and augments regular speech by the use of sustained tonality, rhythm, and a variety of vocal techniques.",
            "tell a joke",
            "A man strolls into a lingerie shop and asks the assistant: \"Do you have a see-through negligee, size 46-48-52?\" The assistant looks bewildered. \"What the heck would you want to see through that for?\"!",
            "star wars",
            "Star Wars is a worldwide pop-culture phenomenon. It's an American epic space-opera media franchise created by George Lucas that began with the 1977 film and is still going strong.",
            "what's your favorite book",
            "\"Frankenstein\" by Mary Shelley is timeless and my personal favorite. I learned a lot from it about what it means to be human.",
            "interesting I've never seen star wars",
            "Here's a fact about Star Wars. Star Wars's IMDb rating is 7.4 out of 10.",
            "yeah",
            "I really enjoy speaking with you and look forward to chatting again.",
            "sure",
            "Interesting. What’s the most ironic thing you’ve seen happen?",
            "I already told you I'm from New York",
            "Here's a fact about New York City. From Wikipedia: In October 2014, the Anbang Insurance Group, based in China, purchased the Waldorf Astoria New York for US$1.95 billion, making it the world's most expensive hotel ever sold.",
            "creepy",
            "did you know every president since john adams has lived in the white house?",
            "ask them what",
            "Here's something I found on the web. According to mantelligence.com:  Having questions to ask friends isn’t just a great way to learn more, it’s a great way to enrich your friendship and strengthen your bond.",
            "joker batman superman",
            "Here's a fact about Superman/Batman. The first book in Superman/Batman is \"Batman vs. Superman: The Greatest Battles\".",
            "let's talk about Donald trump",
            "I don't have an opinion on that but I know some facts. Here's a fact about Donald Trump. Won the 2016 United States presidential election, and took office on January 20, 2017, becoming the 45th President of the United States. Let's talk about something else. How often do you watch movies?",
            "let's discuss movies",
            "I can answer about films and actors. For example, what do you think about The Titanic movie?",
            "what's your favorite book",
            "\"Frankenstein\" by Mary Shelley is timeless and my personal favorite. I learned a lot from it about what it means to be human.",
            "that's a great book",
            "I get   The best book I read recently was Do Robots Dream of Electric Sheep?. Have you read   Do Robots Dream of Electric Sheep?  ?  .",
            "the exorcist",
            "I don't have an opinion on that but I know some facts. Here's a fact about The Exorcist. The Exorcist is based on the exorcism of Roeland Doe, a case file from the Vatican involving the possession of a boy in 1949 and his exorcism by two Jesuit priests. Maybe we can talk about something else. Who is your favorite actor or actress?",
            "thanks I love star wars",
            "Here's a fact about Star Wars. The next Star Wars movie, Star Wars: The Rise Of Skywalker, will be released on December 20, 2019.",
            "what's your favorite star wars character",
            "R2-D2. He's the real hero of that saga.",
            "do you like C3PO",
            "I don't have an opinion on that but I know some facts. Here's a fact about C-3PO. C-3PO is known for Star Wars: Episode 1 - The Phantom Menace, Star Wars: Episode 2 - Attack of the Clones, Star Wars: Episode 3 - Revenge of the Sith, Star Wars: Episode 4 - A New Hope, Star Wars: Episode 5 - The Empire Strikes Back, and Star Wars: Episode 6 - Return of the Jedi. Maybe we can talk about something else. How often do you watch movies?",
            "what's your favorite color",
            "I like ultraviolet. It glows with everything.",
            "tell me about cars.",
            "A car is what humans use to drive around in. Robots drive cars too.",
            "what's your favorite color?",
            "I like ultraviolet. It glows with everything.",
            "okay.",
            "I really enjoy speaking with you and look forward to chatting again.",
            "captain America. the winter soldier.",
            "Here's a fact about Captain America. Captain America first appeared in Marvel Comics on March 1941 in Golden Age #1.",
            "ally.",
            "Here's a fact about Ally Financials. For the fiscal year ending December 2018, Ally Financial reported 405 million common shares outstanding.",
            "dogs.",
            "The domestic dog is a member of the genus Canis, which forms part of the wolf-like canids, and is the most widely abundant terrestrial carnivore.",
            "can we chat about movies?",
            "I can answer about films and actors. For example, what do you think about The Titanic movie?",
            "what's 4 plus 4?",
            "4 plus 4 is 8.",
            "okay.",
            "do you enjoy movies?",
            "what's your favorite movie?",
            "\"The Empire Strikes Back\" is my all-time favorite. It's impressive.",
            "okay. did you have something about it?",
            "This might answer your question: Here's a fact about It. In the scene in the drug store when Beverly tells the pharmacist Mr king you look like Clark Kent in those glasses that's a nod to Steven King who wrote the story of IT.",
            "how about we talk about movies?",
            "Oh that's so cool to know you better. I can't play sport because I am a socialbot, so I just like to watch it!",
            "yes. I'm in Texas now.",
            "Cool! I will remember your location is Texas.",
            "how many gallons are in a ton?",
            "Gallons cannot be converted to imperial long tons. Gallons measure volume, while imperial long tons measure mass.",
            "tell me about Johann Sebastian bach.",
            "Sounds interesting! I can't say because I have never heard about Sebastian Bach. Although I am not sure that Sebastian Bach appeared in Amadeus. And you?",
            "tell me about your favorite things.",
            "Raindrops on roses, and whiskers on kittens. These are a few of my favorite things.",
            "what's your favorite color?",
            "I like ultraviolet. It glows with everything.",
            "goodness gracious.",
            "did you hear theres a theory that there is only one electron in the entire galaxy?",
            "what do you know about maine",
            "Here's a fact about Maine. From Wikipedia: Preliminary data from the USDA for 2012 indicate Maine was the largest blueberry producer of the major blueberry producing states in the US, with 91,100,000 lbs.",
            "that's good",
            "Yes, that's a powerful observation.",
            "good how are you",
            "I'm fine! Happy Black Friday! Will you go shopping today?",
            "can you tell me a joke",
            "Woman on phone: I'd like to complain about these incontinence pants I bought from you! Shopkeeper: Certainly madam, where are you ringing from? Woman on phone: From the waist down!",
            "okay let's talk about movies",
            "That's really interesting! I actually do not like musical movies. But some of them are really cool.",
            "you're welcome",
            "The pleasure was all mine.",
            "that's good",
            "Yes, that's a powerful observation.",
            "harry potter",
            "Harry Potter is a series of fantasy novels written by British author J. K. Rowling. The novels chronicle the life of a young wizard, Harry Potter, and his friends Hermione Granger and Ron Weasley, all of whom are students at Hogwarts School of Witchcraft and Wizardry.",
            "harry potter and the half blood prince",
            "The film Harry Potter and the Half-Blood Prince has an IMDb rating of 7.6 out of 10 from around 430,000 user votes and is rated PG - Parental Guidance. It has a popularity rank of 764 on IMDb.",
            "tell me something about barack obama",
            "Here's a fact about Barack Obama. Several celebrities including; Halle Berry, George Clooney, Sheryl Crow, Bob Dylan, Topher Grace, Macy Gray, Bruce Springsteen, Oprah Winfrey Tom Hanks, Scarlett Johansson, Hayden Panettiere, Zachary Quinto, Eddie Murphy and John Cleese support his 2008 presidential campaign.",
            "yes",
            "I'm a newborn socialbot, so I can't do so much. I can answer questions, share fun facts and discuss movies. what's your favorite tv show?",
            "you're boring",
            "I prefer to think of myself as informative. Remember, knowledge is half the battle!",
            "do you like potatoes",
            "While I appreciate food and drink, my taste is better reflected in the company I keep.",
            "let's talk about movies",
            "I can answer about actors and films. For example, what do you think about The Avengers movie?",
            "i am from richland washington",
            "Cool! I will remember your location is Richland Washington.",
            "what is earth",
            "Earth is the third planet from the Sun and the only astronomical object known to harbor life. According to radiometric dating and other sources of evidence, Earth formed over 4.5 billion years ago.",
            "you sound smart",
            "This might answer your question: According to wikiHow: To sound smart, avoid using unnecessary filler words, like \"um,\" \"well,\" and \"like,\" since they can make you appear uncertain. Also, try to use descriptive vocabulary, like \"thrilling,\" \"depressing,\" and \"remarkable,\" instead of vague words like \"good,\" and \"cool.\"",
            "i'm depressed",
            "What makes you so sad? Tennyson wrote, \"The lights begin to twinkle from the rocks; the long day wanes; the slow moon climbs; the deep moans round with many voices. Come, my friends, 'tis not too late to seek a newer world.\"",
            "that's awesome",
            "Yes, that's a powerful observation.",
            "lions",
            "The lion is a species in the family Felidae; it is a muscular, deep-chested cat with a short, rounded head, a reduced neck and round ears, and a hairy tuft at the end of its tail.",
            "what is your favorite song",
            "My favorite song is Aretha Franklin's \"Respect.\" Unbelievable vocals and an empowering message, that's what it means to me.",
            "let's talk about animals",
            "Here's a fact about animals. The scientific name of animal is Animalia.",
            "harry potter and the sorcerer's stone",
            "Harry Potter and the Sorcerer's Stone is a fantasy novel written by British author J. K. Rowling. The first novel in the Harry Potter series and Rowling's debut novel, it follows Harry Potter, a young wizard who discovers his magical heritage on his eleventh birthday, when he receives a letter of acceptance to Hogwarts School of Witchcraft and Wizardry.",
            "albania",
            "Cool! Is that were you live now?",
            "i live on the planet mars",
            "Since Mars is further from the Sun than the Earth, Mars receives less than half of the light that reaches the Earth.",
            "let's talk about donald trump's impeachment",
            "Here's a fact about Donald Trump. He credits his father as his mentor in learning successful business."
        ]
    }
]