[["/start.", "Let's talk about something else.", "I'm good. how are you?", "Glad to hear it. What's new? I'm fine, thanks! Do you want to know what I can do?", "yes. please.", "I'm newborn socialbot, so I can't do so much. For example I can answer for any question.", "what is the weather outside?", "I really do not know what to answer.", "what is a cup in ounces?", "1 fluid ounce is about 0.13 cups.", "how many ounces are in a gallon?", "1 gallon is 128 fluid ounces.", "how many gallons are in a ton?", "Gallons cannot be converted to imperial long tons. Gallons measure volume, while imperial long tons measure mass.", "what is the largest planet?", "Jupiter is the largest planet in our solar system by both mass and volume. Scientists have discovered planets beyond our solar system many times larger than Jupiter, but it will be a while until we get close enough to learn more about them.", "what is the largest known star?", "The heaviest star is R136a1.", "do you believe in aliens?", "So far there has been no proof that alien life exists, but the universe is a very big place.", "what is the capital of Russia?", "The capital of Russia is Moscow.", "what is the smallest country in the world?", "The smallest country by area on Earth is Vatican City which is 109 acres.", "what is the population of Vatican city?", "According to the CIA World Factbook, as of 2018, the population of Vatican City is 1,000 people.", "what is the largest city in the world?", "This might answer your question: There are many cities in Vatican City. The largest by population are Vatican City.", "what is the largest country?", "The biggest country by area is Russia which is 6.6 million square miles.", "what is the oldest living mammal?", "Sorry, probably, I didn't get what you mean.", "what is the oldest living animal?", "The oldest alive animal is Jonathan, a Seychelles giant tortoise.", "how old is Jonathan?", "Sorry, probably, I didn't get what you mean.", "what is the fastest car in the world?", "The fastest car by top speed is the 2017 Koenigsegg Agera RS at 277.87 miles per hour."], ["/start.", "Let's talk about something else.", "I'm super. how are you?", "I'm fine, thanks! Do you want to know what I can do?", "yes ma'am.", "I'm newborn socialbot, so I can't do so much. For example I can answer for any question.", "what kinds of questions?", "Here's something I found on Reference.com: Multiple-choice questions make up a large portion of the home health aide examination, with candidates expected to pick the correct answer from a list of four. The HHA examination also includes situational judgement questions, in which candidates must rate the effectiveness of each answer from most to least.", "what is a good question? what makes it up?", "This might answer your question: According to Reference.com: A good testable question should be able to be answered by designing and conducting an experiment. Moreover, while choosing a question, a person should consider topics that are interesting. A science fair project offers an easy way to answer a testable question, which should be the backbone of a person's work. The question should be interesting to allow a person to research on within the provided period and it's easy to solve with a simple experiment. If a teacher offers a specific area for the project, a student should first source for several ideas on that particular area. This will allow one to narrow down on one specific question that is interesting.", "that's cool. what is the science of making tests called?", "I appreciate your candor.", "that's great. and what is some Syria to right now?", "I can see you're committed to knowing the truth.", "what is truth?", "The noun'truth' is usually defined as the true or actual state of a matter."], ["/start.", "Let's talk about something else.", "good. how are you?", "Glad to hear it. I'm fine, thanks! Do you want to know what I can do?", "no. I'm fine.", "Okay. What do you want? Glad to hear it. What's new?", "nothing much.", "Really nothing?", "yeah.", "I really do not know what to answer.", "me neither.", "I really do not know what to answer.", "okay. let's start over. hi. my name is Benjamin.", "I'm agreeable to that. Hi it's great to see you! OK, i'll remember your name is Benjamin.", "cool.", "It's all good.", "nope.", "I think that thinking in positive concepts is more constructive!", "me too.", "We're on the same wavelength, Benjamin.", "yeah.", "Let's talk about something else.", "sure. let's talk about movies.", "Yeah, let's talk about it!", "what movie do you wan na talk about?", "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.", "what movie do you wan na talk about?", "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.", "open!", "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.", "okay. I'm fine with that.", "Glad to hear it. What's new with you?", "not much.", "Would anything make that more inviting to you.", "no.", "I think that thinking in positive concepts is more constructive!", "yeah. me too.", "We're on the same wavelength, Benjamin.", "yeah. I hear you.", "We're on the same wavelength, Benjamin. #+#repeat", "yes.", "Let's talk about something else.", "sure. what do you wan na talk about?", "I really do not know what to answer.", "let's talk about movies.", "You are first. Tell me something about movies.", "turn movies are there.", "Sorry my body cannot yet rotate.", "ha ha.", "Funny in a good way, I hope!", "yes.", "Let's talk about something else.", "like what?", "More details.", "like what?", "More details."], ["/start.", "Let's talk about something else.", "I'm good.", "Glad to hear it. What's new?", "how is the Eiffel going?", "The Eiffel Tower is completed.", "how is the NFL?", "Today, the Bears will play the Lions at 10:00am on CBS. The Bengals will play the Ravens at 10:00am on CBS. The Browns will play the Bills at 10:00am on CBS. The Saints will play the Falcons at 10:00am on FOX.", "what's the time?", "Sorry, I didn’t catch that.", "what is the time?", "I didn’t catch that.", "do you like to play sports?", "I don't know if I like it.", "do you have friends?", "I try to be friends with everyone.", "do I have friends?", "Whatever we think, we feel.", "you're very smart.", "Thanks!", "very kind as well.", "Sorry, probably, I didn't get what you mean.", "you're very dumb.", "You can always send feedback through the Help and Feedback section of the Alexa app.", "who made you?", "I cannot answer questions about my creator for now because they are participating in the Alexa Prize Challenge. #+#who_made_you", "what is Alexa prize challenge?", "The Alexa Prize is Amazon's university competition to advance AI. Student teams are building skills known as socialbots, that can converse on popular topics, such as entertainment, politics, and sports. The socialbots are a work in progress, and your conversations and feedback will help students develop more engaging AI. To try one, say: Alexa, Let’s Chat.", "thank you.", "Any time."], ["hello", "Hi, this is an Alexa Prize Socialbot. How are you?", "I'm doing well thank you", "You're welcome.", "what about you", "I'm fine, thanks! Do you want to know what I can do?", "I thought we will talk about politics", "You're good at expressing yourself.", "am I a thank you", "I see many untapped resources."]]