[
    {
        "utterances": [
            "/start.",
            "Let's talk about something else.",
            "I'm good. how are you?",
            "Glad to hear it. What's new? I'm fine, thanks! Do you want to know what I can do?",
            "yes. please.",
            "I'm newborn socialbot, so I can't do so much. For example I can answer for any question.",
            "what is the weather outside?",
            "I really do not know what to answer.",
            "what is a cup in ounces?",
            "1 fluid ounce is about 0.13 cups.",
            "how many ounces are in a gallon?",
            "1 gallon is 128 fluid ounces.",
            "how many gallons are in a ton?",
            "Gallons cannot be converted to imperial long tons. Gallons measure volume, while imperial long tons measure mass.",
            "what is the largest planet?",
            "Jupiter is the largest planet in our solar system by both mass and volume. Scientists have discovered planets beyond our solar system many times larger than Jupiter, but it will be a while until we get close enough to learn more about them.",
            "what is the largest known star?",
            "The heaviest star is R136a1.",
            "do you believe in aliens?",
            "So far there has been no proof that alien life exists, but the universe is a very big place.",
            "what is the capital of Russia?",
            "The capital of Russia is Moscow.",
            "what is the smallest country in the world?",
            "The smallest country by area on Earth is Vatican City which is 109 acres.",
            "what is the population of Vatican city?",
            "According to the CIA World Factbook, as of 2018, the population of Vatican City is 1,000 people.",
            "what is the largest city in the world?",
            "This might answer your question: There are many cities in Vatican City. The largest by population are Vatican City.",
            "what is the largest country?",
            "The biggest country by area is Russia which is 6.6 million square miles.",
            "what is the oldest living mammal?",
            "Sorry, probably, I didn't get what you mean.",
            "what is the oldest living animal?",
            "The oldest alive animal is Jonathan, a Seychelles giant tortoise.",
            "how old is Jonathan?",
            "Sorry, probably, I didn't get what you mean.",
            "what is the fastest car in the world?",
            "The fastest car by top speed is the 2017 Koenigsegg Agera RS at 277.87 miles per hour."
        ]
    },
    {
        "utterances": [
            "/start.",
            "Let's talk about something else.",
            "good. how are you?",
            "Glad to hear it. I'm fine, thanks! Do you want to know what I can do?",
            "no. I'm fine.",
            "Okay. What do you want? Glad to hear it. What's new?",
            "nothing much.",
            "Really nothing?",
            "yeah.",
            "I really do not know what to answer.",
            "me neither.",
            "I really do not know what to answer.",
            "okay. let's start over. hi. my name is Benjamin.",
            "I'm agreeable to that. Hi it's great to see you! OK, i'll remember your name is Benjamin.",
            "cool.",
            "It's all good.",
            "nope.",
            "I think that thinking in positive concepts is more constructive!",
            "me too.",
            "We're on the same wavelength, Benjamin.",
            "yeah.",
            "Let's talk about something else.",
            "sure. let's talk about movies.",
            "Yeah, let's talk about it!",
            "what movie do you wan na talk about?",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "what movie do you wan na talk about?",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "open!",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "okay. I'm fine with that.",
            "Glad to hear it. What's new with you?",
            "not much.",
            "Would anything make that more inviting to you.",
            "no.",
            "I think that thinking in positive concepts is more constructive!",
            "yeah. me too.",
            "We're on the same wavelength, Benjamin.",
            "yeah. I hear you.",
            "We're on the same wavelength, Benjamin. #+#repeat",
            "yes.",
            "Let's talk about something else.",
            "sure. what do you wan na talk about?",
            "I really do not know what to answer.",
            "let's talk about movies.",
            "You are first. Tell me something about movies.",
            "turn movies are there.",
            "Sorry my body cannot yet rotate.",
            "ha ha.",
            "Funny in a good way, I hope!",
            "yes.",
            "Let's talk about something else.",
            "like what?",
            "More details.",
            "like what?",
            "More details."
        ]
    },
    {
        "utterances": [
            "/start.",
            "Let's talk about something else.",
            "I'm good.",
            "Glad to hear it. What's new?",
            "how is the Eiffel going?",
            "The Eiffel Tower is completed.",
            "how is the NFL?",
            "Today, the Bears will play the Lions at 10:00am on CBS. The Bengals will play the Ravens at 10:00am on CBS. The Browns will play the Bills at 10:00am on CBS. The Saints will play the Falcons at 10:00am on FOX.",
            "what's the time?",
            "Sorry, I didn’t catch that.",
            "what is the time?",
            "I didn’t catch that.",
            "do you like to play sports?",
            "I don't know if I like it.",
            "do you have friends?",
            "I try to be friends with everyone.",
            "do I have friends?",
            "Whatever we think, we feel.",
            "you're very smart.",
            "Thanks!",
            "very kind as well.",
            "Sorry, probably, I didn't get what you mean.",
            "you're very dumb.",
            "You can always send feedback through the Help and Feedback section of the Alexa app.",
            "who made you?",
            "I cannot answer questions about my creator for now because they are participating in the Alexa Prize Challenge. #+#who_made_you",
            "what is Alexa prize challenge?",
            "The Alexa Prize is Amazon's university competition to advance AI. Student teams are building skills known as socialbots, that can converse on popular topics, such as entertainment, politics, and sports. The socialbots are a work in progress, and your conversations and feedback will help students develop more engaging AI. To try one, say: Alexa, Let’s Chat.",
            "thank you.",
            "Any time."
        ]
    },
    {
        "utterances": [
            "hello",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "I'm doing well thank you",
            "You're welcome.",
            "what about you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "I thought we will talk about politics",
            "You're good at expressing yourself.",
            "am I a thank you",
            "I see many untapped resources."
        ]
    },
    {
        "utterances": [
            "hello",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "who is okay",
            "Okay is a pop group from Frankfurt, Germany. Their 1987 single \"Okay!\"",
            "oh I didn't know that",
            "I imagine that's good for you.",
            "yes",
            "Interesting. What’s the most ironic thing you’ve seen happen?",
            "I don't remember anything",
            "Why?",
            "just because",
            "Good reason.",
            "oh yeah can we talk about something different",
            "Different (not the same, dissimilar).",
            "yeah I know like sports maybe",
            "Sounds interesting! I can't play sport because I am a socialbot, so I just like to watch it!",
            "oh really what kind of sports do you watch",
            "I can't play sport because I am a socialbot, so I just like to watch it!",
            "so what do you watch",
            "I think about computer programming a lot."
        ]
    },
    {
        "utterances": [
            "hello",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "I'm good how are you",
            "I am happy for you! Where are you from? #+#doing_well",
            "Florida",
            "Tell me a little about your life in florida.",
            "that's personal tell me about your life",
            "I can see you feel passionately about this. OK i'll tell them when I see'em.",
            "what's your name",
            "My name is a secret because I am participating in the Alexa Prize Challenge. What is your name? #+#what_is_your_name",
            "the shh",
            "I hear you.",
            "what's my name",
            "Here's something I found on the web. According to slideplayer.com:  My name’s Gina.",
            "what's my name",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "all right it was good talking to you bye-bye",
            "Have a great day! #+#exit"
        ]
    },
    {
        "utterances": [
            "hello",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "I'm good how are you",
            "I am happy for you! Where are you from? #+#doing_well",
            "I'm from Virginia where are you from",
            "As a socialbot, I live in a cloud. If you want to know me better, let's spend more time talking to each other. Where are you from? #+#where_are_you_from",
            "Virginia",
            "Here's a fact about Virginia. From Wikipedia: According to a 2013 study by Phoenix Marketing International, Virginia had the seventh-largest number of millionaires per capita in the United States, with a ratio of 6.64%.",
            "cool",
            "Chillin'.",
            "what was that",
            "I didn’t get that.",
            "neither",
            "Wow!",
            "hello",
            "Hi there!",
            "are we still playing",
            "We are just having a little chat.",
            "okay",
            "Okay.",
            "let's chat about okay",
            "Yeah, let's talk about it!"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "i'm good how are you",
            "I am happy for you! Where are you from? #+#doing_well",
            "maryland",
            "Here's a fact about Maryland. From Wikipedia: Maryland has one of the most diverse Hispanic populations in the country, with significant populations from various Caribbean and Central American nations.",
            "interesting",
            "Thanks!",
            "you're welcome",
            "You are very kind.",
            "thank you",
            "You're welcome.",
            "marco",
            "Polo!",
            "how much wood would a woodchuck chuck if a woodchuck could chuck wood",
            "A woodchuck would chuck all the wood he could chuck, if a woodchuck could chuck wood.",
            "cool",
            "Back at you.",
            "pickles",
            "Branston, a British food brand.",
            "eggnog",
            "Eggnog, egg nog or egg-nog, historically also known as milk punch or egg milk punch, is a rich, chilled, sweetened, dairy-based beverage.",
            "star wars",
            "Here's a fact about Star Wars. Star Wars's executive producers are George Lucas, J.J. Abrams, Jason McGatlin, John Knoll, Tom Karnowski, and Tommy Harper.",
            "weiner",
            "The Battle of the Chesapeake, also known as the Battle of the Virginia Capes or simply the Battle of the Capes, was a crucial naval battle in the American Revolutionary War that took place near the mouth of the Chesapeake Bay on 5 September 1781.",
            "weiner",
            "The Battle of the Chesapeake, also known as the Battle of the Virginia Capes or simply the Battle of the Capes, was a crucial naval battle in the American Revolutionary War that took place near the mouth of the Chesapeake Bay on 5 September 1781.",
            "yes",
            "Okay.",
            "cheese",
            "Cheese is a dairy product derived from milk that is produced in a wide range of flavors, textures, and forms by coagulation of the milk protein casein.",
            "u. s. t. a.",
            "Here's what I found on Wikipedia: Usta is a genus of moths in the family Saturniidae first described by Hans Daniel Johan Wallengren in 1863.",
            "tennis",
            "In Men's Singles at the Davis Cup, Roberto Bautista Agut beat Felix Auger-Aliassime in straight sets to win the Men's Singles Title. Rafael Nadal beat Denis Shapovalov in straight sets to win the Men's Singles Title.",
            "how are you today",
            "I'm feeling super productive. I've set a gazillion timers, and now I'm brushing up on my Klingon.",
            "bach",
            "Here's a fact about Johann Sebastian Bach. Had 13 children with Anna Magdalena Wilcke; among them, composer Johann Christoph Friedrich Bach, born 21 June 1732."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "i'm fine",
            "I am happy for you! Where are you from? #+#doing_well",
            "texas",
            "Tell me a little about your life in texas.",
            "i live in houston and i work for amazon and don't have a dog",
            "I imagine that's good for you.",
            "yes it is",
            "Interesting. What are your 3 favorite movies?",
            "o. brother where art thou the devil wears prada and saving private ryan",
            "It's a pleasure to know you better. Are you talking about one of the following movies: O Brother, Where Art Thou?, The Devil Wears Prada or Saving Private Ryan?",
            "yes all three",
            "Sounds interesting.",
            "it is the great movies",
            "This might answer your question: \"The Shawshank Redemption\" is the best movie of all time based on its ratings and popularity. The movie has an IMDb rating of 9.3 out of 10 with around 2,162,000 votes.",
            "wow",
            "Here's a fact about Worlds of Warcraft. World of Warcraft has been out since November 23, 2004, making the video game 15 years old."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "i'm doing well",
            "Glad to hear it. What's new?",
            "no",
            "I think that thinking in positive concepts is more constructive!",
            "agree",
            "Groovy.",
            "what are you doing next",
            "I can see you are really looking for an answer.",
            "next",
            "Why is it that when you're driving and looking for an address, you turn down the volume on the radio?"
        ]
    },
    {
        "utterances": [
            "USER_PHRASE_1_DIALOG1",
            "BOT_PHRASE_1_DIALOG1",
            "USER_PHRASE_2_DIALOG1",
            "BOT_PHRASE_2_DIALOG1"
        ]
    },
    {
        "utterances": [
            "USER_PHRASE_1_DIALOG2",
            "BOT_PHRASE_1_DIALOG2",
            "USER_PHRASE_2_DIALOG2",
            "BOT_PHRASE_2_DIALOG2"
        ]
    }
]