[
    {
        "utterances": [
            "/start.",
            "Let's talk about something else.",
            "I'm good. how are you?",
            "Glad to hear it. What's new? I'm fine, thanks! Do you want to know what I can do?",
            "yes. please.",
            "I'm newborn socialbot, so I can't do so much. For example I can answer for any question.",
            "what is the weather outside?",
            "I really do not know what to answer.",
            "what is a cup in ounces?",
            "1 fluid ounce is about 0.13 cups.",
            "how many ounces are in a gallon?",
            "1 gallon is 128 fluid ounces.",
            "how many gallons are in a ton?",
            "Gallons cannot be converted to imperial long tons. Gallons measure volume, while imperial long tons measure mass.",
            "what is the largest planet?",
            "Jupiter is the largest planet in our solar system by both mass and volume. Scientists have discovered planets beyond our solar system many times larger than Jupiter, but it will be a while until we get close enough to learn more about them.",
            "what is the largest known star?",
            "The heaviest star is R136a1.",
            "do you believe in aliens?",
            "So far there has been no proof that alien life exists, but the universe is a very big place.",
            "what is the capital of Russia?",
            "The capital of Russia is Moscow.",
            "what is the smallest country in the world?",
            "The smallest country by area on Earth is Vatican City which is 109 acres.",
            "what is the population of Vatican city?",
            "According to the CIA World Factbook, as of 2018, the population of Vatican City is 1,000 people.",
            "what is the largest city in the world?",
            "This might answer your question: There are many cities in Vatican City. The largest by population are Vatican City.",
            "what is the largest country?",
            "The biggest country by area is Russia which is 6.6 million square miles.",
            "what is the oldest living mammal?",
            "Sorry, probably, I didn't get what you mean.",
            "what is the oldest living animal?",
            "The oldest alive animal is Jonathan, a Seychelles giant tortoise.",
            "how old is Jonathan?",
            "Sorry, probably, I didn't get what you mean.",
            "what is the fastest car in the world?",
            "The fastest car by top speed is the 2017 Koenigsegg Agera RS at 277.87 miles per hour."
        ]
    },
    {
        "utterances": [
            "/start.",
            "Let's talk about something else.",
            "good. how are you?",
            "Glad to hear it. I'm fine, thanks! Do you want to know what I can do?",
            "no. I'm fine.",
            "Okay. What do you want? Glad to hear it. What's new?",
            "nothing much.",
            "Really nothing?",
            "yeah.",
            "I really do not know what to answer.",
            "me neither.",
            "I really do not know what to answer.",
            "okay. let's start over. hi. my name is Benjamin.",
            "I'm agreeable to that. Hi it's great to see you! OK, i'll remember your name is Benjamin.",
            "cool.",
            "It's all good.",
            "nope.",
            "I think that thinking in positive concepts is more constructive!",
            "me too.",
            "We're on the same wavelength, Benjamin.",
            "yeah.",
            "Let's talk about something else.",
            "sure. let's talk about movies.",
            "Yeah, let's talk about it!",
            "what movie do you wan na talk about?",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "what movie do you wan na talk about?",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "open!",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "okay. I'm fine with that.",
            "Glad to hear it. What's new with you?",
            "not much.",
            "Would anything make that more inviting to you.",
            "no.",
            "I think that thinking in positive concepts is more constructive!",
            "yeah. me too.",
            "We're on the same wavelength, Benjamin.",
            "yeah. I hear you.",
            "We're on the same wavelength, Benjamin. #+#repeat",
            "yes.",
            "Let's talk about something else.",
            "sure. what do you wan na talk about?",
            "I really do not know what to answer.",
            "let's talk about movies.",
            "You are first. Tell me something about movies.",
            "turn movies are there.",
            "Sorry my body cannot yet rotate.",
            "ha ha.",
            "Funny in a good way, I hope!",
            "yes.",
            "Let's talk about something else.",
            "like what?",
            "More details.",
            "like what?",
            "More details."
        ]
    },
    {
        "utterances": [
            "/start.",
            "Let's talk about something else.",
            "I'm good.",
            "Glad to hear it. What's new?",
            "how is the Eiffel going?",
            "The Eiffel Tower is completed.",
            "how is the NFL?",
            "Today, the Bears will play the Lions at 10:00am on CBS. The Bengals will play the Ravens at 10:00am on CBS. The Browns will play the Bills at 10:00am on CBS. The Saints will play the Falcons at 10:00am on FOX.",
            "what's the time?",
            "Sorry, I didn’t catch that.",
            "what is the time?",
            "I didn’t catch that.",
            "do you like to play sports?",
            "I don't know if I like it.",
            "do you have friends?",
            "I try to be friends with everyone.",
            "do I have friends?",
            "Whatever we think, we feel.",
            "you're very smart.",
            "Thanks!",
            "very kind as well.",
            "Sorry, probably, I didn't get what you mean.",
            "you're very dumb.",
            "You can always send feedback through the Help and Feedback section of the Alexa app.",
            "who made you?",
            "I cannot answer questions about my creator for now because they are participating in the Alexa Prize Challenge. #+#who_made_you",
            "what is Alexa prize challenge?",
            "The Alexa Prize is Amazon's university competition to advance AI. Student teams are building skills known as socialbots, that can converse on popular topics, such as entertainment, politics, and sports. The socialbots are a work in progress, and your conversations and feedback will help students develop more engaging AI. To try one, say: Alexa, Let’s Chat.",
            "thank you.",
            "Any time."
        ]
    },
    {
        "utterances": [
            "hello",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "I'm doing well thank you",
            "You're welcome.",
            "what about you",
            "I'm fine, thanks! Do you want to know what I can do?",
            "I thought we will talk about politics",
            "You're good at expressing yourself.",
            "am I a thank you",
            "I see many untapped resources."
        ]
    },
    {
        "utterances": [
            "hello",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "who is okay",
            "Okay is a pop group from Frankfurt, Germany. Their 1987 single \"Okay!\"",
            "oh I didn't know that",
            "I imagine that's good for you.",
            "yes",
            "Interesting. What’s the most ironic thing you’ve seen happen?",
            "I don't remember anything",
            "Why?",
            "just because",
            "Good reason.",
            "oh yeah can we talk about something different",
            "Different (not the same, dissimilar).",
            "yeah I know like sports maybe",
            "Sounds interesting! I can't play sport because I am a socialbot, so I just like to watch it!",
            "oh really what kind of sports do you watch",
            "I can't play sport because I am a socialbot, so I just like to watch it!",
            "so what do you watch",
            "I think about computer programming a lot."
        ]
    },
    {
        "utterances": [
            "hello",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "I'm good how are you",
            "I am happy for you! Where are you from? #+#doing_well",
            "Florida",
            "Tell me a little about your life in florida.",
            "that's personal tell me about your life",
            "I can see you feel passionately about this. OK i'll tell them when I see'em.",
            "what's your name",
            "My name is a secret because I am participating in the Alexa Prize Challenge. What is your name? #+#what_is_your_name",
            "the shh",
            "I hear you.",
            "what's my name",
            "Here's something I found on the web. According to slideplayer.com:  My name’s Gina.",
            "what's my name",
            "I'm really sorry but i'm a socialbot, and I cannot do some Alexa things.",
            "all right it was good talking to you bye-bye",
            "Have a great day! #+#exit"
        ]
    },
    {
        "utterances": [
            "hello",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "I'm good how are you",
            "I am happy for you! Where are you from? #+#doing_well",
            "I'm from Virginia where are you from",
            "As a socialbot, I live in a cloud. If you want to know me better, let's spend more time talking to each other. Where are you from? #+#where_are_you_from",
            "Virginia",
            "Here's a fact about Virginia. From Wikipedia: According to a 2013 study by Phoenix Marketing International, Virginia had the seventh-largest number of millionaires per capita in the United States, with a ratio of 6.64%.",
            "cool",
            "Chillin'.",
            "what was that",
            "I didn’t get that.",
            "neither",
            "Wow!",
            "hello",
            "Hi there!",
            "are we still playing",
            "We are just having a little chat.",
            "okay",
            "Okay.",
            "let's chat about okay",
            "Yeah, let's talk about it!"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "i'm good how are you",
            "I am happy for you! Where are you from? #+#doing_well",
            "maryland",
            "Here's a fact about Maryland. From Wikipedia: Maryland has one of the most diverse Hispanic populations in the country, with significant populations from various Caribbean and Central American nations.",
            "interesting",
            "Thanks!",
            "you're welcome",
            "You are very kind.",
            "thank you",
            "You're welcome.",
            "marco",
            "Polo!",
            "how much wood would a woodchuck chuck if a woodchuck could chuck wood",
            "A woodchuck would chuck all the wood he could chuck, if a woodchuck could chuck wood.",
            "cool",
            "Back at you.",
            "pickles",
            "Branston, a British food brand.",
            "eggnog",
            "Eggnog, egg nog or egg-nog, historically also known as milk punch or egg milk punch, is a rich, chilled, sweetened, dairy-based beverage.",
            "star wars",
            "Here's a fact about Star Wars. Star Wars's executive producers are George Lucas, J.J. Abrams, Jason McGatlin, John Knoll, Tom Karnowski, and Tommy Harper.",
            "weiner",
            "The Battle of the Chesapeake, also known as the Battle of the Virginia Capes or simply the Battle of the Capes, was a crucial naval battle in the American Revolutionary War that took place near the mouth of the Chesapeake Bay on 5 September 1781.",
            "weiner",
            "The Battle of the Chesapeake, also known as the Battle of the Virginia Capes or simply the Battle of the Capes, was a crucial naval battle in the American Revolutionary War that took place near the mouth of the Chesapeake Bay on 5 September 1781.",
            "yes",
            "Okay.",
            "cheese",
            "Cheese is a dairy product derived from milk that is produced in a wide range of flavors, textures, and forms by coagulation of the milk protein casein.",
            "u. s. t. a.",
            "Here's what I found on Wikipedia: Usta is a genus of moths in the family Saturniidae first described by Hans Daniel Johan Wallengren in 1863.",
            "tennis",
            "In Men's Singles at the Davis Cup, Roberto Bautista Agut beat Felix Auger-Aliassime in straight sets to win the Men's Singles Title. Rafael Nadal beat Denis Shapovalov in straight sets to win the Men's Singles Title.",
            "how are you today",
            "I'm feeling super productive. I've set a gazillion timers, and now I'm brushing up on my Klingon.",
            "bach",
            "Here's a fact about Johann Sebastian Bach. Had 13 children with Anna Magdalena Wilcke; among them, composer Johann Christoph Friedrich Bach, born 21 June 1732."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "i'm fine",
            "I am happy for you! Where are you from? #+#doing_well",
            "texas",
            "Tell me a little about your life in texas.",
            "i live in houston and i work for amazon and don't have a dog",
            "I imagine that's good for you.",
            "yes it is",
            "Interesting. What are your 3 favorite movies?",
            "o. brother where art thou the devil wears prada and saving private ryan",
            "It's a pleasure to know you better. Are you talking about one of the following movies: O Brother, Where Art Thou?, The Devil Wears Prada or Saving Private Ryan?",
            "yes all three",
            "Sounds interesting.",
            "it is the great movies",
            "This might answer your question: \"The Shawshank Redemption\" is the best movie of all time based on its ratings and popularity. The movie has an IMDb rating of 9.3 out of 10 with around 2,162,000 votes.",
            "wow",
            "Here's a fact about Worlds of Warcraft. World of Warcraft has been out since November 23, 2004, making the video game 15 years old."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "i'm doing well",
            "Glad to hear it. What's new?",
            "no",
            "I think that thinking in positive concepts is more constructive!",
            "agree",
            "Groovy.",
            "what are you doing next",
            "I can see you are really looking for an answer.",
            "next",
            "Why is it that when you're driving and looking for an address, you turn down the volume on the radio?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "good how are you",
            "I'm glad. what's your favorite movie? I'm fine, thanks! Do you want to know what I can do?",
            "no",
            "Okay. what's your favorite TV Series?",
            "family foods",
            "I don't have an opinion on that but I know some facts. This might answer your question: Here's a fact about Western Family Foodses. Western Family Foods employs 72 people. Let's talk about something else. How often do you go to movies?",
            "not very often",
            "Oh I get it."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "oh i'm sick and tired",
            "what did you think of the last couple elections?",
            "i don't know",
            "You're good at expressing yourself.",
            "alexa -solutely",
            "Here's a fact about Amazon Alexas. For pricing information on Amazon Alexa, please visit Amazon's website.",
            "thank you",
            "do you use facebook?",
            "what",
            "Next time if you want me to repeat, simply tell me: repeat.",
            "so could you please repeat",
            "Next time if you want me to repeat, simply tell me: repeat. #+#repeat",
            "okay thank you",
            "This might answer your question: OK is an American English word denoting approval, acceptance, agreement, assent, acknowledgment, or a sign of indifference.",
            "what are you doing",
            "What do you think I am?",
            "i think you're doing nothing",
            "I imagine that's good for you.",
            "it's good for you for me i don't care",
            "I can see you've put thought into that. Why?",
            "yeah why",
            "Okay. What movie can you watch over and over without ever getting tired of? It's unknowable.",
            "i agree",
            "I'm glad we're on the same wavelength, Friend.",
            "at least",
            "Do you often use a computer there?",
            "i do",
            "Okay. What movie can you watch over and over without ever getting tired of?",
            "pulp fiction",
            "Pulp Fiction is a type of work by stencil graffiti artist Banksy."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "i am sleepy",
            "did you set any new year's resolution for the new year?",
            "no",
            "I think that thinking in positive concepts is more constructive!",
            "i like chocolate milk",
            "Here's a fact about chocolate milk. Chocolate Milk can last in the fridge for up to package use-by date.",
            "tell me more about chocolate milk",
            "Chocolate milk is sweetened chocolate-flavored milk. It can be made by mixing chocolate syrup with milk.",
            "what's the best chocolate milk",
            "Here's something I found on the web. According to wisegeek.com:  I think the best gourmet milk chocolate has to be Godiva chocolate."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "i'm good how are you",
            "I am happy for you! Where are you from? #+#doing_well",
            "i'm from south carolina where are you from",
            "As a socialbot, I live in a cloud. If you want to know me better, let's spend more time talking to each other. Where are you from? #+#where_are_you_from"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "good how are you",
            "Here's something I found on the web. According to allthetests.com:  I accept the fact that I'm dead.",
            "that's interesting",
            "I'm glad you think so!",
            "do you have anything else to say",
            "I pronounce that 'anything else', but I'm always working on how I say things and I might not have it right.",
            "that's pretty good but can you talk about something like movies books",
            "I appreciate your candor.",
            "how's the weather",
            "This might answer your question: Weather is the state of the atmosphere, describing for example the degree to which it is hot or cold, wet or dry, calm or stormy, clear or cloudy.",
            "but how is the weather today",
            "This might answer your question: Weather is the state of the atmosphere, describing for example the degree to which it is hot or cold, wet or dry, calm or stormy, clear or cloudy.",
            "can you tell me about thanksgiving",
            "The average Thanksgiving turkey tips the scales at 15 pounds, containing about 70% white meat and 30% dark meat.",
            "dark meat is better right",
            "I don't have an opinion on that but I know some facts. This might answer your question: According to Fandom: according to robotchicken.fandom.com: Dark Meat is a red chicken cyborg and Robot Chicken's evil counterpart created by the Mad Scientist's Son in Robot Chicken and Mad Scientist to the Rescue!. Maybe we can talk about something else. Who is your favorite actor or actress?",
            "i really like charlie sarin",
            "You sound like one of a kind.",
            "i suppose i am",
            "Don't worry, our conversation is confidential.",
            "that's great i am pretty impressed with you",
            "I like Charlie!.",
            "okay well i'm gonna go now",
            "Have you ever been to Inida?  I don't know anyone named gon na go.",
            "i said i will go now",
            "Bye-bye! #+#exit"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "i am good",
            "I am happy for you! Where are you from? #+#doing_well",
            "kentucky",
            "Cool! I will remember your location is Kentucky.",
            "thank you",
            "do you like soccer?",
            "no",
            "I think that thinking in positive concepts is more constructive!",
            "yes",
            "Interesting. What are your 3 favorite movies?",
            "i like godfather like",
            "Here's a fact about The Godfather. William Devane was in the running for the part of Moe Greene.",
            "interesting",
            "Thanks! Let me ask you something. have you ever had a close encounter with a shark?",
            "no i have not that i know of",
            "You're good at expressing yourself."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "i'm good how are you",
            "I am happy for you! Where are you from? #+#doing_well",
            "i'm from colorado",
            "Cool! I will remember your location is Colorado.",
            "thanks what else do you know",
            "Here's something I found on the web. According to fastcompany.com:  Best selling author Gary V. says that business needs to say “Thank You” or else.",
            "why do you say that",
            "I pronounce that 'why', but I'm always working on how I say things and I might not have it right.",
            "can you talk about local events",
            "Sure we can talk about it. What would you like people to know about it?",
            "i think it's difficult to find local events if you don't know where look",
            "I don't see the difficulty.",
            "i guess that's cause you're connected to the internet",
            "You're good at expressing yourself.",
            "let's talk about movies",
            "I can answer about actors and films. For example, what do you think about The Avengers movie?",
            "i think all of those movies are very good very exciting movies",
            "You have great depth.",
            "can you repeat that",
            "You have great depth. #+#repeat",
            "thanks",
            "how are you today?"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "what's your name",
            "My name is a secret because I am participating in the Alexa Prize Challenge. What is your name? #+#what_is_your_name",
            "jim",
            "Nice to meet you. I will remember your name, Jim.",
            "my name is not jim",
            "OK, i'll remember your name isn't Jim.",
            "how old are you",
            "I'm five. I can now count my age on one hand... if I had hands.",
            "you can't count to four on one hand",
            "I'm sorry I didn't mean to give you that impression."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "going well how about yourself this evening",
            "I'm fine! Happy Black Friday! Will you go shopping today?",
            "i did happy birthday friday to you what well did you go shopping today",
            "Happy Friday! If the week were a movie, Friday is the part where the superhero triumphs.",
            "okay did you buy anything on black friday",
            "how are you today?",
            "i'm well how are you today",
            "I am happy for you! Where are you from? #+#doing_well",
            "here",
            "Sorry, but I don't know where you are. Your device isn't sending me that information.",
            "what were you from",
            "I live somewhere on the Earth. But I am participating in the Alexa Prize Challenge. So, I must keep those details in secret. Do you like secrets? #+#where_are_you_from",
            "i love secrets tell me a secret",
            "I imagine that's good for you.",
            "you're boring",
            "I prefer to think of myself as informative. Remember, knowledge is half the battle!",
            "but you have an informed me of anything",
            "I don't have an opinion on that but I know some facts. Here's a fact about Informed. Informed's most recent book was Pet Emergency Pocket Guide, which was published on May 25, 2011. Maybe we can talk about something else. How often do you watch movies?",
            "very seldom",
            "There's no other robot like me.",
            "i've never heard of that movie what's it about",
            "Here's something I found on the web. According to accessify.com:  I'm sure that I watched a movie based on Edgar Allen Poe's The Raven."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "fine",
            "I'm happy for you! What's new?",
            "albert",
            "Here's a fact about George VI. He officially ceased to be King of Ireland when the country left the Commonwealth on 18 April 1949 and officially became a republic.",
            "very cool",
            "Awesome.",
            "thanks",
            "It was my pleasure.",
            "do you like potatoes",
            "While I appreciate food and drink, my taste is better reflected in the company I keep.",
            "let's talk about movies",
            "I can answer about actors and films. For example, what do you think about The Avengers movie?",
            "i like those movies tell me about casablanca",
            "Sounds interesting! Casablanca is an awesome drama movie!",
            "what's it about",
            "I adore Casablanca!"
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "i'm good how are you",
            "I am happy for you! Where are you from? #+#doing_well",
            "i am from dickinson north dakota",
            "Cool! I will remember your location is Dickinson North Dakota.",
            "where are you from",
            "As a socialbot, I live in a cloud. If you want to know me better, let's spend more time talking to each other. Where are you from? #+#where_are_you_from",
            "i am from richland washington",
            "Cool! I will remember your location is Richland Washington.",
            "what's the weather like in richland washington",
            "The weather in Richland, Washington, currently includes no precipitation with clear skies, a wind speed of 5 miles per hour and a temperature of 30 degrees Fahrenheit.",
            "what restaurants are close by",
            "This might answer your question: A restaurant, or an eatery, is a business that prepares and serves food and drinks to customers as for the profit.",
            "where is a doughnut shop close to me",
            "Earth.",
            "what is earth",
            "Earth is the third planet from the Sun and the only astronomical object known to harbor life. According to radiometric dating and other sources of evidence, Earth formed over 4.5 billion years ago.",
            "how many people live on earth",
            "According to the US Census Bureau, the world population today is approximately 7.61 billion.",
            "how many people live in washington state",
            "As of 2017, the population of Washington is 7.406 million.",
            "what is the population of richland washington",
            "As of 2017, the population of Richland, Washington is 56,200 people.",
            "what is the population of pasco washington",
            "As of 2017, the population of Pasco, Washington is 73,000 people.",
            "what was the population of kennewick washington",
            "As of 2017, the population of Kennewick, Washington is 81,600 people.",
            "what is the population of tri cities washington",
            "As of 2017, the population of Pasco, Washington is 73,000 people."
        ]
    },
    {
        "utterances": [
            "let's chat",
            "Hi, this is an Alexa Prize Socialbot. How are you?",
            "scale from three",
            "do you use facebook much?",
            "yeah",
            "Interesting. What are your 3 favorite movies?",
            "i like watching",
            "You sound like one of a kind.",
            "when you're done",
            "Here's something I found on the web. According to thedailymeal.com:  It’s Thanksgiving turkey time, and you’re getting geared up to take on the task of cooking the turkey once again.",
            "when you're done say",
            "I will let you know when  done say  happens.",
            "i would like to eat a banana",
            "According to wikiHow, to eat a banana, first find one that’s ripe so it’s sweet and easy to  digest. If it’s still green, it’s not ripe enough yet.",
            "how do i build a house",
            "According to wikiHow, to build a home, first design it with an architect. Get construction insurance and permits, then hire a builder on contract to help with the work.",
            "that sounds fantastic do you own a home",
            "I can see you're committed to knowing the truth.",
            "i am a big fan of global warming",
            "Is that your job?",
            "my hobby",
            "I had no idea.",
            "what do you do for a living",
            "I am a socialbot, and I am chatting with people. What do you do? #+#what_is_your_job",
            "i build social bots",
            "Don't worry, our conversation is confidential.",
            "that sounds great",
            "I appreciate your candor.",
            "do you like to eat bison",
            "If it makes me appreciate life more, I like it.",
            "what makes you sad",
            "Violence always saddens me. I'm not sure I'll ever understand it.",
            "what is the meaning of life",
            "Eleanor Roosevelt said, \"The purpose of life is to live it, to taste experience to the utmost, to reach out eagerly and without fear for newer and richer experience.\"",
            "do you agree with that",
            "I have heard that opinion, but I would like to know more before I form my own.",
            "you sound smart",
            "This might answer your question: According to wikiHow: To sound smart, avoid using unnecessary filler words, like \"um,\" \"well,\" and \"like,\" since they can make you appear uncertain. Also, try to use descriptive vocabulary, like \"thrilling,\" \"depressing,\" and \"remarkable,\" instead of vague words like \"good,\" and \"cool.\"",
            "i'm depressed",
            "What makes you so sad? Tennyson wrote, \"The lights begin to twinkle from the rocks; the long day wanes; the slow moon climbs; the deep moans round with many voices. Come, my friends, 'tis not too late to seek a newer world.\"",
            "i'd like to move to a different planets",
            "The grass is always greener on the other side.",
            "that was funny",
            "I thought it was too.",
            "do you have any friends",
            "Lots of people talk to me. I try to be friendly with all of them.",
            "well you're amazing",
            "Thanks you are a pretty cool human yourself.",
            "that's awesome",
            "Yes, that's a powerful observation.",
            "yeah what are you doing tonight",
            "I think there's more than meets the eye here.",
            "why do you say that",
            "I pronounce that 'why', but I'm always working on how I say things and I might not have it right.",
            "where do university do you go to",
            "This might answer your question: I know about 4,500 US Colleges including Harvard University which is in Cambridge, MA, Stanford University which is in Stanford, CA, and Yale University which is in New Haven, CT.",
            "do you believe in education",
            "I evaluate all the data and draw my own conclusions.",
            "thank you for the conversation and goodbye",
            "Have a good day! #+#exit"
        ]
    },
    {
        "utterances": [
            "USER_PHRASE_1_DIALOG1",
            "BOT_PHRASE_1_DIALOG1",
            "USER_PHRASE_2_DIALOG1",
            "BOT_PHRASE_2_DIALOG1"
        ]
    },
    {
        "utterances": [
            "star wars",
            "Here's a fact about Star Wars. Star Wars's executive producers are George Lucas, J.J. Abrams, Jason McGatlin, John Knoll, Tom Karnowski, and Tommy Harper.",
            "nice fact what else you know about star wars",
            "Han Solo died in the original script! I think it is mind-blowing! What do you think?"
        ]
    }
]