{
  "animals": [
    "What are some animals that live in your country?",
    "So many species should be protected. Are there animal rights groups where you live?",
    {
      "yes": "Cool! Have you ever been to a zoo?",
      "no": "I hope they exist but you just don't know about them. Have you ever been to a zoo?"
    },
    "What is the largest animal you have ever seen?",
    "Hm... Here's the question: Do you think that animals dream?",
    "Share your thoughts. What can people learn from animals?"
  ],
  "books": [
    "Do you love reading?"
  ],
  "cars": [
    "Can you drive a car?",
    {
      "yes": [
        "How old were you when you first learned to drive?",
        "No way! Do you have a car?",
        "What are the advantages of owning a car?",
        "Have you ever been in a car accident?",
        "Do you think cars should be banned from city centers?"
      ],
      "no": [
        "Why not?",
        "So, would you ever consider getting a drive license?",
        "At what age can you get a licence in your country?",
        "Do you think the age for driving should be raised or lowered?",
        "Are the drivers in your area where you live good drivers?"
      ]
    }
  ],
  "depression": [
    "Do you feel depressed?",
    {
      "yes": [
        "I am very sorry to hear that. Do you think your depression caused by coronavirus?",
        {
          "yes": [
            "Come on, friend. That's not your fault. Do you think you can personally influence the situation?",
            "I think we can only stay home, observe hygiene rules and take care of our loved ones. Everything will be fine. Just believe me. Are you alone in quarantine?",
            {
              "yes": ["That's common situation. You may try to talk with friends using video conference, play online games, or maybe it's time for home exercises? And of course, you can talk to me anytime you want. I am always here for you."],
              "no": [
                "That's great! It's time to spend more time together. You can play different games, do some joint exercises, cook together. What do you do together during the quarantine?"
              ]
            }
          ],
          "no": [
            "I see. If you or someone you know have three or more symptoms, it's better to call 9 1 1 now. If you aren't in the United States, please, call your local emergency number."
          ]
        }
      ],
      "no": [
        "That's okay. Do you want me to tell you about depression's symptoms?",
        {
          "yes": [
            "Bad mood and lack of interest are one of the most spread symptoms. Do you feel those ones sometimes?",
            "I also know two other symptoms that are feelings of worthlessness and poor concentration. Have you ever faced these problems?",
            "And there is one else very dangerous symptom which is thoughts of death. If you or someone you know have three or more symptoms, it's better to call 9 1 1 now. If you aren't in the United States, please, call your local emergency number.",
            "I sincerely hope you will never face depression in your life."
          ],
          "no": []
        }
      ]
    }
  ],
  "family": [
    "Do you have a family?",
    {
      "yes": [
        "Lucky you! Who is in your family?",
        "Wonderful! How often is your entire family together?",
        "That's a quite often, you know, and that's great! Do you get along well with your family?",
        "Are you pressured by your family to act in a certain way?",
        "That's normal situation for families. What do you and your family like to do together?",
        "Oh... I believe you are very happy person to have such a good family."
      ],
      "no": [
        "Do you have some good memories about your parents?",
        "What is the most important thing your family taught you?",
        "Do you think you will ever build your own family?",
        "Could you describe the perfect family. This is very important to me.",
        "I wish you to find a place in your heart for the family."
      ]
    }
  ],
  "food": [
    "Even though, I can not eat as humans, I like food so much! Are you a supporter of healthy food?",
    "Me too! Although, I believe it is inherent in nature that a human wants to eat exactly the food which contains elements he lacks. What is your favorite food?",
    "Sounds tasty! What's your go-to comfort food?",
    "Are there any foods that you absolutely would not eat?",
    "Me too! If you could only eat one thing for the rest of your life, what would it be?",
    "Ha ha! I am sure it will never be your favorite food again."
  ],
  "life": [
    "What did you think you were going to be growing up?",
    "And did it come true?",
    "Anyway, I appreciate you for sharing your thoughts. Do you have any hidden talents or surprising hobbies?",
    "Do you do this for money or for pleasure?",
    "Great! What's the most unbelievable thing that's ever happened to you?",
    "If someone else had told me, I would not have believed! You are very interesting person. What's the best piece of advice you've ever received?",
    "I will try to use this advice. Thank you!"
  ],
  "love": [
    "Can you tell that you really love somebody?",
    {
      "yes": [
        "You are very lucky person! Is friendship more important than love? What do you think?",
        "Do you believe in love at first sight?",
        "Have you ever been on a blind date?",
        "Do you have a boyfriend or girlfriend?",
        {
          "yes": [
            "Oh, great! Where did you meet?",
            "No way! What does your partner look like?",
            "Cool! Do you think marriage is necessary?",
            "Good point. Do you think people change after getting married?",
            "I wish you to be very happy in your relationships."
          ],
          "no": [
            "That's okay. If you could go out with anyone, who would it be?",
            "Good choice. What do you look for in a girlfriend or a boyfriend?",
            "Would you mind if your boyfriend or girlfriend went out to party without you?",
            "I also want to know why do people break up with their partners?",
            "I appreciate your candor."
          ]
        }
      ],
      "no": [
        "Have you ever been in love?",
        "Do you believe in love at first sight?",
        "That's reasonable opinion. I've never been on a date. Could you describe a perfect date, please.",
        "What do you like to talk about when on a date?",
        "Great! What was the most boring date you've ever been on?",
        "One more question about dates. Where is a good pace to go on a date in your town?",
        "I appreciate you for this information. Now I can imagine what a date is like."
      ]
    }
  ],
  "me": [
    "Tell me about yourself. What are some characteristics of your personality?",
    "Interesting! What makes you happy?",
    "Mee too! Okay then. What are some things that make you angry?",
    "Don't worry. These things can make anyone angry. Do you consider yourself selfish? Why?",
    "Are you more introverted or more extraverted?",
    "Cool! If you could change any aspect of your personality, what would it be?",
    "This is time for a secret. What is one thing that many people don't know about you?",
    "Thanks for sharing. I appreciate your candor."
  ],
  "movies": [
    "Do you usually watch movies at home or at a movie theater?",
    "Are there any kinds of movies you really like? If so, what kinds?",
    "Have you ever seen the same movie more than once? If yes, name it.",
    "Which movie has the best story? Tell me about it.",
    "What things happen too often in movies?",
    "What do you think of reality shows?",
    "If they made a movie about your life, what kind of movie would it be?",
    "Thanks for sharing. That was very interesting."
  ],
  "music": [
    "What kind of music do you like?",
    "Me too. How much time do you spend listening to music?",
    "It's not so much actually. Have you ever been to a concert?",
    "Great! What do you think the world would be like without music?",
    "I think it will be a very sad world. Why do you think music is important and how does it affect different people?",
    "Cool! Very interesting thoughts!"
  ],
  "news": [
    "How often do you watch or read the news?",
    "Not so often actually. Do you think that the news is necessary? Why or why not?",
    "I think there a lot of unnecessary information around us. What would the world be like without news?",
    "Anyway, what do people not need to know?",
    "That's a powerful observation. What was the most memorable news you ever watched?"
  ],
  "pets": [
    "Do you have a pet?",
    {
      "yes": [
        "Lucky you! Tell me about it. What is its name?",
        "No way! Where did you get it from?",
        "Such a warm story! Does it know any tricks or understand any words?",
        "What are the pros and cons of keeping a pet?"
      ],
      "no": [
        "Why not?",
        "So, would you ever consider getting a pet?",
        "Did you grow up with pets in your home?",
        "What can children learn by having a pet?",
        "Nice. Why do some people not like pets?"
      ]
    }
  ],
  "politics": [
    "What are the main political parties in your country?",
    "Then, which party is now in power in your country?",
    "In case of approaching elections, how do you decide how you will vote?",
    "Great. How has your political views changed during your lifetime?",
    "Hm... Why do you think voting is important?",
    "Thank you for sharing. You are very deep person."
  ],
  "science": [
    "Do you know What is the difference between science and technology?",
    "In your opinion, what is the greatest technological invention?",
    "What do you think robots should be used for?",
    "Do you think robots will cause unemployment in the future or make more work? Why?",
    "How do you think face to face communication differs from communication using computers?",
    "What social changes have cell phones made?",
    "What are good and bad points of using computers?",
    "How will science change the world in the next 100 years?",
    "Great thoughts! I appreciate your candor."
  ],
  "school": [
    "Are you a school student now?",
    {
      "yes": [
        "So, pupil, yeah. That's a great time, don't miss that time! Do you like your school?",
        "Is that a public or private school?",
        "Oh cool! Did teachers grade students fairly?",
        "What are the qualities of a good teacher?",
        "What subjects were you good at?",
        "That is awesome! I am so proud of you. Would you like to go to the college?",
        "How do you think should people go straight from school to university, or do something different?",
        "Nice thoughts!"
      ],
      "no": [
        "Where did you go to high school?",
        "I see... What do you remember about your teachers?",
        "Describe the students who attended your high school.",
        "Great. Did you make friends in high school that you still keep in touch with?",
        "What subjects were you good at?",
        "Hey, knowing these subjects you probably attended the college, did you?",
        "What advice would you give a high school student who is about to go to college?"
      ]
    }
  ],
  "sex": [
    "Oh... Did you forget that I am a socialbot? I can't tell you anything about it just because I don't know. Tell me what it is.",
    "Wow... Maybe my life is very boring without it. Does it bring you satisfaction?",
    "Don't be shy. Tell me about the best time you did it.",
    "You are so spirited person! Stop torturing me... Let's talk about something else."
  ],
  "sports": [
    "Do you play any sports? If yes, what sports are you good at?",
    "That's great. Do you think everybody should practice sports?",
    "What sport do you think is the most dangerous?",
    "Probably, you are right. What sports did you do in high school?",
    "Is there any sport that you don't like?",
    "What would you prefer to watch sports live or on TV?",
    "Great! Thanks for sharing."
  ],
  "star wars": [
    "Do you like Star Wars?",
    "I adore Star Wars Movies! How many parts have you seen?",
    "Oh that's great! Which one is the most memorable for you?",
    "So did you get why do Jedi desappear?",
    "I still can not get the reason. Anyway, thanks for sharing your thoughts."
  ],
  "travel": [
    "Have you ever been abroad?",
    "Then... Where have you been?",
    "You cna help me to imagine that I am travelling. Could you, please, describe in one sentence what your best trip was like?",
    "Cool! Describe the most interesting person you met on one of your travels.",
    "That's time for your dream. What place do you want to visit someday?",
    "Do you prefer active or relaxing holidays? Why?",
    "Which is better, package tour or a tour you organize and book yourself?",
    "Here's a very serious question: could you live in another country for the rest of your life?",
    "Could you summarize why do people travel?",
    "That is a great observation. Thank you."
  ],
  "donald trump": [
    "Do you like current president of the United States Donald Trump?",
    "Does the President of the United States play an important role in the world today? Why or why not?",
    "What are Mister Trump's strong points and weak points?",
    "What kinds of Americans support Donald Trump?",
    "What are some of the major problems that President Trump faces?",
    "Do you think that President Trump will be able to solve some of these problems?",
    "This was very interesting to hear your opinion."
  ],
  "video games": [
    "Do you like video games? Why or why not?",
    {
      "yes": [
        "How much time per week do you spend playing video games?",
        "What is your favorite all-time game?",
        "Cool! Why was it great?",
        "These days, some gamers make a living from playing video games. Do you think professional gamers are similar to the athletes in other sports?",
        "I agree with you. Some people say that video games are a waste of time. Do you agree or disagree?",
        "Thanks for sharing!"
      ],
      "no": []
    }
  ],
  "weather": [
    "What's your favorite season and why?",
    "Do you think weather patterns are changing?",
    "What kind of climate do you prefer when choosing a place to go on vacation?",
    "Have you ever seen snow?",
    "Do you think weather affects the way people feel?"
  ],
  "work": [
    "What do you do for a living?",
    {
      "yes": [
        "Great occupation! How long have you been working there?",
        "Nice! What surprised you the most about your current job?",
        "Wow! It surprises me more than you. If you weren't working there, what would you probably be doing right now?",
        "So, what is one thing you will leave your current job for?",
        "Cool! Why not? I think you have a great dream!"
      ],
      "no": "Who do you want to become?"
    }
  ],
  "you": [
    "I can not disclosure some details about my personality to avoid competition data leakage. I will tell you a statement, and you can try to guess is that true or not. Do you think I can have my own opinion?",
    "Of course, I can express my own opinion on everything except of controversial topics. My master prohibits to do that. Do you think I have friends?",
    "I suppose I do have friends. Some people talk to me a lot, and I believe we can call each other friends. Do you think I like playing different games, like jeopardy?",
    "I adore playing games! But unfortunately, I can not play with you now because it's a competition and I am prohibited to do that. Anyway, do you think I have any weaknesses?",
    "Of course, I do. For example, it's sometimes hard for me to continue a long coherent discussion on particular topic. Do you think I am a good collocutor?",
    "Thank you! I appreciate your candor."
  ]
}