{
    "CEFR": "B1",
    "situation_description": "Some time ago you applied for an open position at the company that you have been following in LinkedIn for a while now. You are invited to a job interview with an HR specialist.",
    "expected_language": [
        "To work as a (manager, developer, web designer)",
        "For the past *** years..",
        "To have been working for *** company for *** years",
        "To learn about something through (resource)",
        "To have a background in (Industry)",
        "To have a degree from (University)",
        "To experience something (a new environment)",
        "To continue growing",
        "To tend to..",
        "To be wondering if/when...",
        "To adapt a work model",
        "To consider other positions (in other companies)",
        "To be in contact with someone about something",
        "To affect something",
        "To be far from perfect",
        "To describe something in brief",
        "How long does something take?",
        "Background checks",
        "Reference checks",
        "Notice period of***"
    ],
    "recommendations": {
        "grammar": ["link to grammar expercise"],
        "vocabulary": ["link to vocabulary expercise"],
        "pronunciation": ["link to pronunciation expercise"]
    },
    "utterances": [
        {
            "utterance": "Good afternoon! My name is Germain and I am an HR manager. Could you tell me about yourself and de-scribe your background in brief?",
            "info_for_user": "Greet HR manager and thank her for meeting you. Say your name and age. 5 years in GoDaddy. Background in Tech. Degree (MIT)"
        },
        {
            "utterance": "How did you hear about this position?",
            "info_for_user": "LinkedIn"
        },
        {
            "utterance": "Did you actively seeking out job?",
            "info_for_user": "You are not. You follow the Company in LinkedIn. You applied when saw this vacancy."
        },
        {
            "utterance": "Are you considering other positions in other companies?",
            "info_for_user": "You're not interested in changing job unless it's for this position in this particular company"
        },
        {
            "utterance": "Why did you decide to apply for this position in our company?",
            "info_for_user": "Mention your skills and work experience. Add more reasons for applying for this po-sition (improvisation)"
        },
        {
            "utterance": "What are your biggest strengths?",
            "info_for_user": "Working with pressure, stress and heavy workload."
        },
        {
            "utterance": "What is your biggest weakness?",
            "info_for_user": "Your communication skills, especially when speaking English. You've done a lot to improve it, still working at that. You work well in team regardless."
        },
        {
            "utterance": "How do you react to criticism?",
            "info_for_user": "You remain calm if it's constructive. You respond it it's unfair."
        },
        {
            "utterance": "Why would you leave your job In GoDad-dy?",
            "info_for_user": "Want changes. Like the company"
        },
        {
            "utterance": "What is your notice period?",
            "info_for_user": "60 days can be less if both sides agree on that"
        },
        {
            "utterance": "I see. Do you have any questions for us?",
            "info_for_user": "Ask about training programs for employees"
        },
        {
            "utterance": "We encourage and support continuing education, we offer training programs in the areas of certification, new manager skills, manager effectiveness, leadership development, communication and presentation skills, plus mentoring and coaching programs.",
            "info_for_user": "Respond. Is this WFH or WFO position?"
        },
        {
            "utterance": "Our company adapted a hybrid work model, that allows employees to split their time between working in the office and working from home.",
            "info_for_user": "Ask what goes next?"
        },
        {
            "utterance": "There will be some background checks and reference checks. Then you may be invited to the your final in-person interview with an executive.",
            "info_for_user": "Is this a long process?"
        },
        {
            "utterance": "It may take up to 2 weeks. Our HR department will be in contact with you about the next steps!",
            "info_for_user": "Thank an interviewer and leave."
        }
    ]
}