{
    "CEFR": "B1",
    "situation_description": "Some time ago you applied for an open position at the company that you have been following in LinkedIn for a while now. You are invited to a job interview with an HR specialist.",
    "keywords": ["job", "interview"],
    "expected_language": [
        "To work as a (manager, developer, web designer)",
        "For the past *** years...",
        "To have been working for *** company for *** years",
        "To learn about something through (resource)",
        "To have a background in (Industry)",
        "To have a degree from (University)",
        "To experience something (a new environment)",
        "To continue growing",
        "To tend to...",
        "To be wondering if...",
        "To be wondering when...",
        "To adapt a work model",
        "To consider other positions (in other companies)",
        "To be in contact with someone about something",
        "To affect something",
        "To be far from perfect",
        "To describe something in brief",
        "How long does something take?",
        "Background checks",
        "Reference checks",
        "Notice period of***"
    ],
    "recommendations": {
        "grammar": ["link to grammar expercise"],
        "vocabulary": ["link to vocabulary expercise"],
        "pronunciation": ["link to pronunciation expercise"]
    },
    "utterances": [
        {
            "utterance": "Hello, {user name}! My name is {avatar name}. And I am an HR manager at {company name}. Thank you for finding the time today to have this conversation with me about an open position we are looking to fill. If you don't mind, I will ask you a couple of questions to know a bit more about your professional experience and your preferences. I wouldn't want to take a lot of your time so it is more than OK to provide brief responses. At the same time, it would be beneficial if you could focus on the most important aspects. OK. Are you ready?",
            "info_for_user": ""
        },
        {
            "utterance": "Good. Why are you looking for a new job? Why did you decide to have a chat with me today?",
            "info_for_user": "Say that it is always a good idea to monitor the market and look at different opportunities."
        },
        {
            "utterance": "What are you looking for? What kind of job or position would be of interest to you?",
            "info_for_user": "Say that you are looking for new challenges. Mention industries you are most interested in."
        },
        {
            "utterance": "Can you tell me about one of your career achievements you are most proud of?",
            "info_for_user": "Describe one of the projects you worked on by describing a situation, project goals, your actions and results."
        },
        {
            "utterance": "Can you tell me about the key areas of your expertise? What areas do you consider yourself to be an expert in?",
            "info_for_user": "Answer with a number of years of experience in your domain of choice. Mention your hard skills, such as tech skills, and soft skills, such as communication, management, etc."
        },
        {
            "utterance": "What are your key strengths or superpowers?",
            "info_for_user": "Focus on your responsibility, proactivity, attention to details, willingness to learn and adapt, focusing on company's business targets."
        },
        {
            "utterance": "What do you consider to be your areas for development?",
            "info_for_user": "Say that continuous education and self development are key for you and that you never stop learning. Mention that you are working to improve your English speaking and presentational skills."
        },
        {
            "utterance": "What is the notice period at the company you currently work for?",
            "info_for_user": "Say that it is usually around a month."
        },
        {
            "utterance": "What are your salary expectations?",
            "info_for_user": "If you are not sure, say 50 thousand euros for example."
        },
        {
            "utterance": "Do you have any questions for me?",
            "info_for_user": "Ask if you can work remotely if hired."
        },
        {
            "utterance": "Our company adapted a hybrid work model. This allows employees to split their time between working from office or from home. However, full-time office or fully remote options are also available. It will be totally up to you to decide.",
            "info_for_user": "Ask about training programs for employees at the company."
        },
        {
            "utterance": "We encourage and strongly support our employees' professional development. We partner with various educational platforms and offer online training programs in a variety of areas covering everything imaginable, including technical skills, communications skills, effective leadership, and so much more.",
            "info_for_user": "Ask about the next steps"
        },
        {
            "utterance": "We are currently talking to a number of potential candidates. I will be able to share your CV with the team. If everything goes smoothly, we will invite you to the next interview with the hiring manager. And if that goes well, you may be expected to have the final interview with our CEO. We pay a lot of attention to the culture fit. So, don't be surprised.",
            "info_for_user": "Thank the HR manager for a pleasant conversation."
        },
        {
            "utterance": "Well, thank you, {user name}. I do appreciate you having found the time for our meeting today. I really enjoyed our conversation. And I will be looking forward to our next conversation. Bye-bye.",
            "info_for_user": ""
        }
    ]
}