{
  "funny":{
    "apple headphones":{
      "setup":"This one is from another user. During my sophomore year of high school, we were doing silent work and my history teacher said that we could listen to music but if it was too loud he would “break our headphones.” so I’m doing my work quietly with my music on low, and this obnoxious kid sitting next to me had his music really loud. I could hear it over my music but ignored it. My teacher thought it was me. So he comes up to me and",
      "punchline":"And he ripped my BRAND NEW Apple headphones, looking ruthless. He suddenly realized it was the guy next to me and he was completely embarrassed. He came in the next day with a new pair and an apology note taped to them. He couldn’t look me in the eye for the rest of the year."
    },
    "chicken nuggets":{
      "setup":"This one is from my friend. So one time I was home alone and it was around dinnertime when I decided to make myself something to eat. I opened the freezer and dug around until I found what appeared to be chicken nuggets in an unopened plastic bag that for some reason, didn’t have any cooking instructions. Thinking that my parents must have thrown away the box for box tops, I called my mom to ask how long and at what temperature to cook chicken nuggets. She told me both of them, I laid out about 20 on a tray and stuck it in the oven, setting the timer before I walked out of the kitchen. When it was almost time to get my chicken nuggets, I walked into a cinnamon scented kitchen. I searched all over that kitchen, trying to find the cinnamon scent, leading me to the oven. I decide to turn on the oven light to see if maybe my mom had stuck some cookies in the oven and forgot to bake them, but instead",
      "punchline":"But instead I find that the tray my chicken nuggets were on has cookies on it instead! As I’m trying to process what just happened, I hear the front door open and my mom shout delightedly, “Ooooo what’s that smell?” She walks into the kitchen and catches my confused expression. That’s when the spark ignited and she realized exactly what had happened. Somehow in some form, I had accidentally baked snickerdoodles. And that is why my parents can never take my cooking seriously."
    },
    "drake and josh":{
      "setup":"In second grade, I told everyone that I was leaving school before next semester to move to Hollywood to play Megan’s cousin from Vermont on Drake and Josh. At first I just told my best friend, but then the whole school found out. I had people coming up to me and asking me for my autograph and a teacher even asked for a picture with me. When I showed up on the first day of school in third grade, I told everyone that the show was going off the air after the season finished (even though I had no knowledge of when it was ending), and so they wouldn’t need me.",
      "punchline":"The show really ended after that season and everyone believed me up until like 6th grade. Now my best friend will never let me forget about it."
    },
    "left and right":{
      "setup":"In fifth grade, my teacher loathed me. She would do anything to make me cry and sent me to the principle’s office any chance she got. Don’t believe me? I’m left handed. So still, to this day, I get my hands confused. On this particular day, we were doing the Pledge of Allegiance and I had put my left hand to my chest (it’s supposed to be your right hand over your heart). She got mad at me, telling me that I wasn’t being ‘patriotic’ and sent me to the principal’s office. The principal and I were quite aquatinted at this point and so I told her why I was sent back to her office again, and she laughed. And laughed. I didn’t find it funny at all, I mean all the kids in my school thought I was a delinquent so they didn’t want to be my friend. My principal wrote on the back of my hands, L and R.",
      "punchline":"What I didn’t realize was that she wrote L on my right hand and R on my left hand. She did the same to hers. Then, she walked me back to the classroom, and made our whole class redo the Pledge with our ‘right’ hand, with me leading the class, and it was one of the happiest moments of my elementary experience."
    }
  },
  "scary":{
    "wife":{
      "setup":"I heard one, a father is laying in bed after just waking up, he grabs the baby monitor and walks to his desk in his office at home, he has his baby on the baby monitor and hears his wife singing to her, he cracks a smile as he hears his wife “Go to sleep… go to sleep…”",
      "punchline":"When suddenly the front door opens up and his wife comes in with groceries."
    },
    "intruder":{
      "setup":"That is one of my favourites. Last night a friend rushed me out of the house to catch the opening act at a local bar’s music night. After a few drinks I realized my phone wasn’t in my pocket. I checked the table we were sitting at, the bar, the bathrooms, and after no luck I used my friend’s phone to call mine. After two rings someone answered, gave out a low raspy giggle, and hung up.",
      "punchline":"They didn’t answer again. I eventually gave it up as a lost cause and headed home. I found my phone laying on my nightstand, right where I left it.”"
    }
  },
  "bedtime":{
    "farmer":{
      "setup":"One night a clever farmer was returning home from a cattle fair. He bought a buffalo from there. As he passed through a dense forest, a dacoit came in front of him. He had a thick stick in his hand. He said, \"Hand over all that you have.\" The farmer got scared and gave his money to the dacoit. As he turned to go, the dacoit said, \"Give me the buffalo too. Why are you taking it away?\" The farmer handed over the buffalo's rope to the dacoit. Then the farmer said, \"You have taken everything of mine. Can you give me your stick?\". \"Why do you need it?\", the dacoit enquire. \"My wife will be pleased that at least I got a stick from the fair.\". The dacoit gave the stick to the farmer happily.",
      "punchline":"Immediately the clever farmer started beating the dacoit with the stick. The dacoit ran off to save his life leaving the buffalo and the farmer's money behind. So the clever farmer saved himself and his belongings too."
    },
    "cat":{
      "setup":"Long before today the cat lived in the jungle. She always wanted to be friends with the strongest animal. Once she observed that everyone feared the lion so she became the lion's friend. One day, as they were sun bathing, an elephant passed by. All the animals including the lion cleared the way to let the elephant pass. The cat thought that the elephant was stronger than the lion. So she became the elephant's friend. One day as the cat and the elephant were at the lake, the elephant trumpeted, \"There are hunters here!\" and he ran away. So now the cat left the elephant and went to the city to live with the hunter thinking that the hunter was stronger. In the city, the hunter took him home. His wife shouted at him, \"Ha! You could not kill a lion but why have you brought this useless cat here?\"",
      "punchline":"Suddenly a mouse passed nearby and the woman screamed. The cat ran and caught the mouse. The woman was happy to get rid of the mouse. So she kept the cat as a pet in her house."
    },
    "mouse":{
      "setup":"A Shepherd Boy tended his master’s Sheep near a dark forest not far from the village. Soon he found life in the pasture very dull. All he could do to amuse himself was to talk to his dog or play on his shepherd’s pipe. One day as he sat watching the Sheep and the quiet forest, and thinking what he would do should he see a Wolf, he thought of a plan to amuse himself. His Master had told him to call for help should a Wolf attack the flock, and the Villagers would drive it away. So now, though he had not seen anything that even looked like a Wolf, he ran toward the village shouting at the top of his voice, “Wolf! Wolf!” As he expected, the Villagers who heard the cry dropped their work and ran in great excitement to the pasture. But when they got there they found the Boy doubled up with laughter at the trick he had played on them. A few days later the Shepherd Boy again shouted, “Wolf! Wolf!” Again the Villagers ran to help him, only to be laughed at again. Then one evening as the sun was setting behind the forest and the shadows were creeping out over the pasture, a Wolf really did spring from the underbrush and fall upon the Sheep.",
      "punchline":"In terror the Boy ran toward the village shouting “Wolf! Wolf!” But though the Villagers heard the cry, they did not run to help him as they had before. “He cannot fool us again,” they said. The Wolf killed a great many of the Boy’s sheep and then slipped away into the forest."
    }
  }
}
