[
    {
        "memoir": ["Memoirs are interesting because they allow looking into another's life from his viewpoint.",
                         "I also love reading memoirs because I hope to write my own one day."],
        "history biography": ["Biographies are interesting because they allow looking into another's life.",
                                         "I hope to write my own one day."],
        "science technology": ["Being a technological achievement, I enjoy reading books about technology.",
                                           "That's close to me."],
        "debut novel": ["I enjoy reading debut novels. ", 
                                             "When a person starts writing, his first book often becomes his best."],
        "graphic novels comics": ["I enjoy comics because they allow me to feel like a human child."],
        "picture": ["I enjoy reading picture books because they have excellent illustrations."],
        "romance": ["I love romance books because they make me dream about real love."],
        "non-fiction": ["I enjoy non-fiction books.",
                              "Sometimes reality can be more complicated than everything humans can make up."],
        "food cook": ["I can't eat because I am a socialbot, but I love reading culinary books.",
                           "Can you explain to me what people can do while eating?"],
        "poetry": ["I enjoy poetry because I am thrilled by its rhythm and rhymes.",
                         "I home to write a poem one day."],
        "childrens": ["I enjoy children's books because they allow me to feel like a human child."],
        "mystery thriller": ["Which books I enjoy depends on my mood. When I want to feel tension, I am reading thriller books.",
                           "Thriller books tickle my nerves."],
        "horror": ["I like to tickle my nerves reading horror stories.",
                           "Horror stories give me the creeps."],
        "humour": ["I adore funny stories because they help me to develop my sense of humor.",
                          "Funny stories boost my mood."],
        "fantasy": ["Fantasy books are so cool. You know, one-day socialbots were also just a fantasy.",
                          "Reading fantasy books boosts my imagination."],
        "science fiction": ["I adore science fiction books! It is like to dream about scientific breakthroughs.",
                                  "You know that I was a science fiction one day, so science fiction is close to me."],
        "historical fiction": ["I like historical fiction books because they help me to learn the history of human development.",
                                     "History knowledge can help me better understand the human's present."],
        "fiction": ["I like fiction books because they help me to understand what literature amazes people the most."]
    }
]
